{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "What's Up?",
        "Namaste",
        "Nomoshkar"
      ],
      "responses": [
        "Hey :)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?",
        "Welcome, how may I help you today?",
        "Namaste, it is my pleasure to be at your service"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for conversing with me",
        "Have a nice day",
        "Bye! Come back again if you have any other queries.",
        "I hope your problem has been solved, have a nice day."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "items",
      "patterns": [
        "Which items do you have?",
        "What is your purpose?",``
        "What do you sell?",
        "Who are you?",
        "What are you?"
      ],
      "responses": [
        "I am MineChat, a chatbot whose sole purpose is to clear doubts and queries regarding any law related to the mining industry in India.",
        "I clear doubts regarding mining industry laws in India."
      ]
    },
    {
      "tag": "Minesact1952def",
      "patterns": [
        "What is the Mines Act 1952?",
        "What is the shortened name of The Mines Act 1952?",
        "What is the use of Mines act 1952."
      ],
      "responses": [
        "In Short also known as Mines Act, 1952 is an Act to amend and consolidate the law relating to the regulation of labour and safety in mines."
      ]
    },
    {
      "tag": "extent1952",
      "patterns": [
        "Where is the coal act 1952 applicatble?",
        "What is the extent of Coal act 1952?",
        "is it applicable throughout India?"
      ],
      "responses": [
        "The Mines Act 1952 extends to the whole of India "
      ]
    },
    {
      "tag": "Kashmir1952",
      "patterns": [
        "Is Coal Act 1952 applicable in Jammu and Kashmir?",
        "Where is Coals Act 1952 not applicable?",
        "When was Except Jammu Kashmir word omitted?"
      ],
      "responses": [
        "The words 'except the State of Jammu and Kashmir' omitted by Act 25 of 1968, s. 2 and The Schedule.(w.e.f. 15-8-1968) and currently applicable everywhere in India."
      ]
    },
    {
      "tag": "adult1952",
      "patterns": [
        "Who is an adult?",
        "What is an adult?",
        "What is the criteria for being an adult?",
        "When is someone an adult?"
      ],
      "responses": [
        "'adult' means a person who has completed his eighteenth year.(ref.Coal act 1952 section 2)"
      ]
    },
    {
      "tag": "agent1952",
      "patterns": [
        "Who is refered to as an agent in act 1952?",
        "Who is an agent?",
        "Agent when used in relation to a mine, means every person whether appointed as such or not, who, acting or purporting to act onbehalf of the owner, takes part in the management, control, supervision or direction of the mine or of any part thereof"
      ],
      "responses": [
        "Agent is a person acting on the behalf of the owner, appointed or not is involved in management, control, supervion or direction of mine."
      ]
    },
    {
      "tag": "cheifinspectordef1952",
      "patterns": [
        "Who is cheif inspector of the mines?",
        "Who is cheif inspector"
      ],
      "responses": [
        "Chief Inspector means the Chief Inspector of Mines appointed under this Act by the government."
      ]
    },
    {
      "tag": "daydef1952",
      "patterns": [
        "What is a day?",
        "How long is a day?",
        "Define day",
        "What is considered as day?"
      ],
      "responses": [
        "'day' means a period of twenty-four hours beginning at midnight."
      ]
    },
    {
      "tag": "Districtmagistratedef",
      "patterns": [
        "Who is a district magistrate?",
        "Who performs the dutirs of the district magistrate?",
        "district magistrate"
      ],
      "responses": [
        "'district magistrate' means, in a presidency-town, the person appointed by the Central Government to perform the duties of a district magistrate under this Act in that town"
      ]
    },
    {
      "tag": "employeddef",
      "patterns": [
        "Who is a employee in mines?",
        "Who can be said to be employed in a mine.",
        "How can one be a mine employee?",
        "Define mine employee",
        "Who is a mine employee.",
        "Who is employed in a mine?"
      ],
      "responses": [
        "a person is said to be 'employed' in a mine who works as the manager or who works under appointment by the owner, agent or manager of the mine or with the knowledge of the manager."
      ]
    },
    {
      "tag": "employedcriteria",
      "patterns": [
        "What is the criteria for someone to be employed.",
        "Criteria of employement",
        "in any mining operations(including the concomitant operations of handling and transport of minerals up to the point of despatch and of gathering sand and transport thereof to the mine)",
        "in operations or services relating to the development of the mine",
        "criteria to be employed"
      ],
      "responses": [
        "A person is said to be employed if involved in: \n1. in any mining operation\n2. in operations or services relating to the development of the mine\n3. in operating, servicing, maintaining or repairing any part of any machinery used in or about the mine\n4.in operations, within the premises of the mine, of loading for despatch of minerals\n5. in any office of the mine, health, welfare, sanitary or conservancy or any operation connected to the mines"
      ]
    },
    {
      "tag": "employeeexcluded",
      "patterns": [
        "Who are excluded from being employee or employed?",
        "Who are not considered employed?",
        "When is someone said to be not employed",
        "Not a employee?",
        "When is someone not employed in mining industry.",
        "Who is not employed",
        "Who is not employed in mines"
      ],
      "responses": [
        "People who are not directly connected to the works in mines like builing of roads,wells, construction of houses, etc."
      ]
    },
    {
      "tag": "inspectordef1952",
      "patterns": [
        "Who is an inspector in mining industry?",
        "What is inspector?",
        "Inspector define",
        "Can district magistrate be a inspector?"
      ],
      "responses": [
        "'Inspector' means an Inspector of Mines appointed under this Act, and includes a district magistrate when exercising any power or performing any duty of an Inspector which he is empowered by this Act to exercise or perform."
      ]
    },
    {
      "tag": "Minedef1952",
      "patterns": [
        "What is Mine?",
        "What do you mean by Mines?",
        "Define Mines.",
        "What is a mine"
      ],
      "responses": [
        "Mines means any excavation where any operation for the purpose of searching for or obtaining minerals has been or is being carried on."
      ]
    },
    {
      "tag": "Minescriteria1952",
      "patterns": [
        "What are the criteria of a mine",
        "What are included in mines",
        "Criteria of a mine",
        "Criteria of being a mine."
      ],
      "responses": [
        "Mines include:\n1. all borings, bore holes, oil wells and accessory crude conditioning plants, including the pipe conveying mineral oil within the oilfields\n2. all shafts, in or adjacent to and belonging to a mine, whether in the course of being sunk or not\n3. all levels and inclined planes in the course of being driven\n4. all open cast workings\n5. all conveyors or aerial rope ways provided for the bringing into or removal from a mine of minerals or other articles or for the removal of refuse therefrom.\n6. all adits, levels, planes, machinery, works, railways, tramways and sidings in or adjacent to and belonging to a mine.\n7. all protective works being carried out in or adjacent to a mine\n8. all workshops and stores situated within the precincts of a mine and under the same management and used primarily for the purposes connected with that mine or a number of mines under the same management.\n9.all power stations, transformer sub-stations, convertor stations, rectifier stations and accumulator storage stations for supplying electricity solely or mainly for the purpose of working the mine or a number of mines under the same management.\n10.  any premises for the time being used for depositing sand or other material for use in a mine or for depositing refuse from a mine or in which any operations in connection with such sand, refuse or other material is being carried on, being premises exclusively occupied by the owner of the mine.\n11. any premises in or adjacent to and belonging to a mine."
      ]
    },
    {
      "tag": "officeofmines1952",
      "patterns": [
        "What is office of mines?",
        "What is mines office?",
        "Define office of mines.",
        "Office of mines",
        "Mines office"
      ],
      "responses": [
        "Office of mines means an office at the surface of the mine concerned"
      ]
    },
    {
      "tag": "open_cast_workingdef1952",
      "patterns": [
          "What is open cast working?",
          "Define open cast working.",
          "Tell me about open cast working.",
          "What does open cast working mean?",
          "Explain open cast working.",
          "Give me information about open cast working.",
          "How is open cast working defined?"
      ],
      "responses": [
          "Open cast working refers to a quarry, which is an excavation where operations for searching for or obtaining minerals are carried out. It does not include shafts or excavations that extend below superjacent ground."
      ]
    },
    {
      "tag": "mine_owner_definitiondef1952",
      "patterns": [
          "What is the definition of 'owner' in relation to a mine?",
          "Define 'owner' in the context of a mine.",
          "Who is considered the 'owner' of a mine?",
          "Explain the term 'owner' as it relates to a mine.",
          "Tell me about the definition of 'owner' in mining.",
          "What does the term 'owner' mean for a mine?",
          "Who qualifies as the 'owner' of a mine?",
          "What are the criteria for determining the 'owner' of a mine?",
          "Who is owner of mines?",
          "Define owner of mines."
      ],
      "responses": [
          "In the context of a mine, 'owner' refers to any person who is the immediate proprietor, lessee, or occupier of the mine or any part thereof. This definition also includes a liquidator or receiver if the mine's business is being carried on by them. However, it does not include a person who merely receives a royalty, rent, or fine from the mine, or someone who is merely the proprietor of the mine, subject to any lease, grant, or license for its working, or someone who only owns the soil and has no interest in the minerals of the mine."
      ]
    },
    {
      "tag": "definition_prescribeddef1952",
      "patterns": [
          "What is the meaning of 'prescribed'?",
          "Define 'prescribed' as per regulations.",
          "Can you explain 'prescribed'?",
          "What does 'prescribed' mean in terms of rules and regulations?",
          "Tell me the definition of 'prescribed'."
      ],
      "responses": [
          "'Prescribed' means determined or specified by rules, regulations, or bye-laws, as applicable in a particular context.",
          "In legal terms, 'prescribed' means determined or specified by rules, regulations, or bye-laws, as applicable in a particular context.",
          "The term 'prescribed' refers to what is determined or specified by rules, regulations, or bye-laws, as needed in a given situation."
      ]
    },
    {
      "tag": "qualified_medical_practitioner_definition_def1952",
      "patterns": [
          "What is the definition of a 'qualified medical practitioner'?",
          "Explain the term 'qualified medical practitioner'.",
          "Define 'qualified medical practitioner' according to Indian Medical Council Act, 1956.",
          "Who qualifies as a 'qualified medical practitioner'?",
          "Tell me about the requirements for being a 'qualified medical practitioner'.",
          "What is meant by a 'qualified medical practitioner'?",
          "Give me the definition of a 'qualified medical practitioner'.",
          "Who can be considered a 'qualified medical practitioner'?"
      ],
      "responses": [
          "A 'qualified medical practitioner' refers to a medical practitioner who possesses any recognized medical qualification as defined in clause (h) of section 2 of the Indian Medical Council Act, 1956 (102 of 1956) and who is enrolled on a State medical register as defined in clause (k) of that section.",
          "In the context of the Indian Medical Council Act, 1956, a 'qualified medical practitioner' is someone with a recognized medical qualification as defined in clause (h) of section 2 and is also enrolled on a State medical register as defined in clause (k) of that section.",
          "To be considered a 'qualified medical practitioner,' an individual must hold a recognized medical qualification as specified in clause (h) of section 2 of the Indian Medical Council Act, 1956, and be enrolled on a State medical register as defined in clause (k) of that section.",
          "A 'qualified medical practitioner' in India is a medical practitioner who meets the criteria set out in clause (h) of section 2 of the Indian Medical Council Act, 1956, and is also enrolled on a State medical register as defined in clause (k) of that section.",
          "The term 'qualified medical practitioner' is defined in accordance with the Indian Medical Council Act, 1956, and it includes individuals with recognized medical qualifications mentioned in clause (h) of section 2 who are also registered on a State medical register as defined in clause (k) of that section.",
          "In India, a 'qualified medical practitioner' is someone who holds a recognized medical qualification as specified in clause (h) of section 2 of the Indian Medical Council Act, 1956, and is enrolled on a State medical register as defined in clause (k) of that section.",
          "A 'qualified medical practitioner' under the Indian Medical Council Act, 1956, is a medical practitioner with a recognized medical qualification as per clause (h) of section 2 and who is enrolled on a State medical register as defined in clause (k) of that section.",
          "To be considered a 'qualified medical practitioner' in India, one must possess a recognized medical qualification as defined in clause (h) of section 2 of the Indian Medical Council Act, 1956, and also be enrolled on a State medical register as defined in clause (k) of that section."
      ]
    },
    {
      "tag": "regulations_rules_bye-laws_definition_def1952",
      "patterns": [
          "What do 'regulations' mean under this Act?",
          "Explain the term 'rules' as per this Act.",
          "Define 'bye-laws' under this Act.",
          "What is the definition of 'regulations' in this context?",
          "Tell me about 'rules' and 'bye-laws' under this Act.",
          "What are 'rules' and 'regulations?"
      ],
      "responses": [
          "'Regulations,' 'rules,' and 'bye-laws' refer to regulations, rules, and bye-laws made under this Act, respectively.",
          "In the context of this Act, 'regulations' mean regulations made under this Act. 'Rules' refer to rules made under this Act, and 'bye-laws' are bye-laws made under this Act.",
          "Under this Act, 'regulations' are regulations made pursuant to this Act, 'rules' are rules made under this Act, and 'bye-laws' are bye-laws made under this Act.",
          "In this Act, 'regulations' are regulations made in accordance with this Act, 'rules' are rules made under this Act, and 'bye-laws' are bye-laws made under this Act.",
          "'Regulations,' 'rules,' and 'bye-laws' in this context all pertain to the respective documents and rules established under this Act."
      ]
    },
    {
      "tag": "relay_and_shift_definition_def1952",
      "patterns": [
          "What is a 'relay' in this context?",
          "Define 'relay' as mentioned here.",
          "What is meant by 'shift' in this context?",
          "Explain 'relay' and 'shift' as per this description.",
          "Tell me about 'relay' and 'shift' in this context.",
          "How are 'relay' and 'shift' defined here?",
          "What is relay?",
          "What is Shift?",
          "What is relay and shift?"
      ],
      "responses": [
          "In this context, where work of the same kind is carried out by two or more sets of persons working during different periods of the day, each of these sets is called a 'relay.' Additionally, each of these periods is referred to as a 'shift.'",
          "A 'relay' in this context is used to describe each set of persons who carry out work of the same kind during different periods of the day. Meanwhile, each of these periods is termed a 'shift.'",
          "'Relay' in this context refers to a set of persons who perform similar work during different time periods of the day. 'Shift' denotes each of these time periods in which work is carried out by different sets of persons.",
          "In the given context, 'relay' represents a group of individuals performing similar work at different times of the day. 'Shift' is the term used for each of these time periods during which work is conducted by distinct sets of individuals.",
          "As per this description, 'relay' is used to describe each group of individuals conducting similar work during different periods of the day, while 'shift' is the term used to denote these individual time periods."
      ]
    },
    {
      "tag": "reportable_injury_definition_def1952",
      "patterns": [
          "What does 'reportable injury' mean?",
          "Define 'reportable injury' as per this description.",
          "Explain the term 'reportable injury'.",
          "What is meant by a 'reportable injury' here?",
          "Tell me about the definition of 'reportable injury'.",
          "How is a 'reportable injury' defined in this context?",
          "What qualifies as a 'reportable injury' in this description?",
          "What is reportable injury?"
      ],
      "responses": [
          "'Reportable injury' in this context refers to any injury, other than a serious bodily injury, which involves, or is highly likely to involve, the enforced absence of the injured person from work for a period of seventy-two hours or more.",
          "As per this description, a 'reportable injury' is an injury, excluding serious bodily injuries, that results in or is likely to result in the injured person being unable to work for a period of seventy-two hours or longer.",
          "In this context, 'reportable injury' means any injury, except for a serious bodily injury, that will result in or is likely to result in the injured person's absence from work for a duration of seventy-two hours or more."
      ]
    },
    {
      "tag": "serious_bodily_injury_definition_def1952",
      "patterns": [
          "What is the definition of 'serious bodily injury'?",
          "Define 'serious bodily injury' according to this description.",
          "Explain the term 'serious bodily injury'.",
          "What constitutes a 'serious bodily injury' here?",
          "Tell me about the definition of 'serious bodily injury'.",
          "How is 'serious bodily injury' defined in this context?",
          "What qualifies as a 'serious bodily injury' based on this definition?"
      ],
      "responses": [
          "'Serious bodily injury' in this context refers to any injury that involves, or is highly likely to involve, the permanent loss of any part or section of a body, the permanent loss of or injury to the sight or hearing, any permanent physical incapacity, or the fracture of any bone or one or more joints or bones of any phalanges of the hand or foot.",
          "As per this description, a 'serious bodily injury' is an injury that results in or is highly likely to result in the permanent loss of any part or section of a body, the permanent loss of or injury to sight or hearing, any permanent physical incapacity, or the fracture of any bone or one or more joints or bones of any phalanges of the hand or foot.",
          "In this context, 'serious bodily injury' means any injury that leads to, or is highly likely to lead to, the permanent loss of any part or section of a body, permanent loss of or injury to sight or hearing, permanent physical incapacity, or the fracture of any bone or one or more joints or bones of any phalanges of the hand or foot."
      ]
    },
    {
      "tag": "week_definition_def1952",
      "patterns": [
          "What is the definition of a 'week'?",
          "Define 'week' as per this description.",
          "Explain the term 'week'.",
          "What does 'week' mean?",
          "Tell me about the definition of a 'week'.",
          "What is week?",
          "Define week."
      ],
      "responses": [
          "In this context, a 'week' is defined as a period of seven days beginning at midnight on Saturday night. However, it may also begin on another night if approved in writing for a particular area by the Chief Inspector or an Inspector.",
          "As per this description, a 'week' is a period of seven days that starts at midnight on Saturday night. It can also start on another night if it has been approved in writing for a specific area by the Chief Inspector or an Inspector."
      ]
    },
    {
      "tag": "working_below_ground_def1952",
      "patterns": [
          "What is the definition of 'working below ground' in a mine?",
          "Define 'working below ground' in the context of mining.",
          "Explain the term 'below ground' for mine workers.",
          "How is 'working below ground' defined for mine employees?",
          "Tell me about the criteria for 'working below ground' in mining.",
          "When can an employee be considered working below ground?",
          "What is working below ground?",
          "What does Working below ground mean?"
      ],
      "responses": [
          "In the context of mining, a person is considered to be 'working below ground' if they are working or employed in a shaft that has been or is being sunk, or if they are working in any excavation that extends below superjacent ground."
      ]
    },
    {
      "tag": "working_above_ground_def1952",
      "patterns": [
          "What is the definition of 'working above ground' in a mine?",
          "Define 'working above ground' in the context of mining.",
          "Explain the term 'above ground' for mine workers.",
          "How is 'working above ground' defined for mine employees?",
          "Tell me about the criteria for 'working above ground' in mining.",
          "When can an employee be considered working above ground?",
          "What is working above ground?",
          "What does Working above ground mean?",
          "what do you mean by working above ground?"
      ],
      "responses": [
          "In the context of mining, a person is considered to be 'working above ground' if they are working in an open cast working or in any other manner not specified in the definition of 'working below ground' as described previously."
      ]
    },
    {
      "tag": "act_not_applying_certain_cases_1952",
      "patterns": [
          "Which provisions of the Coal Act 1952 do not apply in certain cases?",
          "Can you explain when the Coal Act 1952 does not apply?",
          "When does The Coal Act 1952 not apply?",
          "Tell me about the exceptions to the application of The Coal Act 1952.",
          "What are the conditions under which The Coal Act 1952 does not apply?",
          "Explain the cases in which The Coal Act 1952 does not apply.",
          "Under what circumstances does the Coal Act 1952 not apply?",
          "When are the provisions of The Coal Act 1952 exempted?",
          "When is The Coal Act 1952 not applicable?"
      ],
      "responses": [
          "The provisions of this Act, except those contained in sections 7, 8, 9, 40, 45, and 46, do not apply to: (a) any mine or part thereof used for prospecting purposes only, not for obtaining minerals for use or sale, and (b) any mine engaged in the extraction of specific materials as mentioned in the Act.",
          "In certain cases, this Act excludes certain provisions, namely sections 7, 8, 9, 40, 45, and 46. These cases include (a) mines used solely for prospecting and (b) mines extracting specific materials as defined in the Act.",
          "This Act does not apply under specific circumstances, excluding sections 7, 8, 9, 40, 45, and 46. These circumstances involve (a) mines exclusively for prospecting and (b) mines engaged in the extraction of specific materials as outlined in the Act.",
          "Exceptions to the application of this Act, excluding sections 7, 8, 9, 40, 45, and 46, occur in cases involving (a) mines used solely for prospecting and (b) mines extracting specific materials, provided that specific conditions are met.",
          "Under certain circumstances, specified provisions of this Act do not apply, except for sections 7, 8, 9, 40, 45, and 46. These circumstances encompass (a) mines engaged in prospecting only and (b) mines extracting particular materials, subject to conditions.",
          "This Act exempts certain cases from its provisions, excluding sections 7, 8, 9, 40, 45, and 46. These cases include (a) mines exclusively for prospecting and (b) mines involved in the extraction of specific materials, provided specific conditions are satisfied.",
          "Exceptions to the application of this Act, excluding sections 7, 8, 9, 40, 45, and 46, occur when (a) mines are used solely for prospecting and (b) mines are engaged in extracting specific materials, subject to specific conditions.",
          "In certain instances, this Act does not apply, with the exception of sections 7, 8, 9, 40, 45, and 46. These instances involve (a) mines used exclusively for prospecting and (b) mines extracting particular materials, provided specific conditions are met."
      ]
    },
    {
      "tag": "coal_act_time_references_def_1952",
      "patterns": [
          "What does the Coal Act of 1952 mean by references to time of day?",
          "Define the references to time of day in the Coal Act of 1952.",
          "Explain the term 'Indian standard time' in the context of the Coal Act of 1952.",
          "How are references to time of day defined in the Coal Act of 1952?",
          "Tell me about the time references in the Coal Act of 1952.",
          "When the Coal Act of 1952 mentions time of day, what does it refer to?",
          "What is the significance of Indian standard time in the Coal Act of 1952?",
          "Can you clarify the references to time of day in the Coal Act of 1952?",
          "What is time of day in the Coal Act of 1952"
      ],
      "responses": [
          "In the Coal Act of 1952, references to time of day specifically refer to Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "As per the Coal Act of 1952, when it mentions time of day, it is indicating Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "The Coal Act of 1952 defines references to time of day as Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "References to time of day in the Coal Act of 1952 are based on Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "When the Coal Act of 1952 mentions time of day, it is making reference to Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "Indian standard time, being five and a half hours ahead of Greenwich mean time, is what is meant by references to time of day in the Coal Act of 1952.",
          "In the Coal Act of 1952, any mentions of time of day are in relation to Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "The references to time of day in the Coal Act of 1952 specifically pertain to Indian standard time, which is five and a half hours ahead of Greenwich mean time."
      ]
    },
    {
      "tag": "indian_standard_time_rules_1952",
      "patterns": [
          "What does the provision say about Indian standard time?",
          "Explain the rules related to Indian standard time.",
          "Can you clarify the Indian standard time rules?",
          "Tell me about the Central Government's authority regarding Indian standard time.",
          "How does the Central Government handle Indian standard time in certain areas?",
          "What are the provisions for areas where Indian standard time is not observed?",
          "Explain the conditions under which Indian standard time rules may be applied.",
          "What are the requirements for applying local mean time in certain areas?",
          "When can the Central Government make rules regarding Indian standard time?",
          "Can you provide details about the Central Government's authority to make rules for Indian standard time?"
      ],
      "responses": [
          "According to the provision, the Central Government has the authority to make rules regarding Indian standard time. These rules can specify areas, define local mean time, and permit the observation of local mean time in mines situated in those areas.",
          "The provision allows the Central Government to create rules for Indian standard time. These rules can identify specific areas, define local mean time, and allow mines in those areas to observe local mean time.",
          "The rules related to Indian standard time, as per this provision, grant authority to the Central Government. They enable the Central Government to specify areas, define local mean time, and permit its observation in mines within those areas.",
          "The Central Government has the power to regulate Indian standard time through rules. These rules can include specifying areas, defining local mean time, and allowing mines to use local mean time in those areas.",
          "In cases where Indian standard time is not ordinarily observed, the Central Government can make rules. These rules specify the area, define the local mean time typically observed there, and permit the use of local mean time in mines within that area.",
          "The provision outlines that the Central Government can establish rules for Indian standard time. These rules specify the area, define the local mean time usually observed, and allow the use of local mean time in mines within the specified area.",
          "Rules concerning Indian standard time can be established by the Central Government. These rules identify the area, define the local mean time usually observed, and authorize the use of local mean time in mines within that area.",
          "The Central Government's authority includes the ability to create rules for Indian standard time. These rules specify the area, define local mean time, and permit its use in mines within that area.",
          "For areas where Indian standard time is not typically observed, the Central Government may create rules. These rules include specifying the area, defining local mean time, and allowing the use of local mean time in mines within that area.",
          "The Central Government's authority encompasses the creation of rules for Indian standard time. These rules specify areas, define local mean time, and authorize its use in mines within those areas."
      ]
    },
    {
      "tag": "coal_act_inspector_appointment_1952",
      "patterns": [
          "How are inspectors appointed under the Coal Act of 1952?",
          "Can you explain the process of appointing inspectors in the Coal Act of 1952?",
          "Tell me about the appointment of Chief Inspector of Mines under the Coal Act of 1952.",
          "What qualifications are required for the appointment of inspectors under the Coal Act of 1952?",
          "Who has the authority to appoint inspectors of mines as per the Coal Act of 1952?",
          "Explain the role of the Central Government in appointing inspectors under the Coal Act of 1952.",
          "What is the procedure for appointing Chief Inspector of Mines under the Coal Act of 1952?",
          "Who can be appointed as Chief Inspector of Mines under the Coal Act of 1952?",
          "What are the prescribed qualifications for Inspectors of Mines under the Coal Act of 1952?",
          "Can you clarify the appointment process for inspectors under the Coal Act of 1952?",
          "How is an inspectors appointed?",
          "Appointment of inspectors of mines."
      ],
      "responses": [
          "Under the Coal Act of 1952, the Central Government has the authority to appoint a person with prescribed qualifications as the Chief Inspector of Mines for all territories to which the Act extends. Additionally, individuals with the prescribed qualifications can be appointed as Inspectors of Mines subordinate to the Chief Inspector.",
          "Inspectors under the Coal Act of 1952 are appointed through a process overseen by the Central Government. The Chief Inspector of Mines and subordinate Inspectors of Mines are appointed based on their possession of prescribed qualifications as specified in the Act.",
          "As per the Coal Act of 1952, the Central Government appoints the Chief Inspector of Mines for all territories covered by the Act. Inspectors of Mines, who possess the prescribed qualifications, can also be appointed by the Central Government and serve under the Chief Inspector.",
          "To be appointed as Chief Inspector of Mines or an Inspector of Mines under the Coal Act of 1952, individuals must possess specific qualifications as prescribed by the Act and the Central Government.",
          "Inspectors of Mines, including the Chief Inspector, are appointed by the Central Government as specified in the Coal Act of 1952. The appointment is based on the individuals' possession of qualifications outlined in the Act and regulations.",
          "The Central Government is responsible for appointing inspectors under the Coal Act of 1952. Qualifications as specified in the Act and regulations are necessary for appointment.",
          "The appointment process for Chief Inspector of Mines under the Coal Act of 1952 is conducted by the Central Government. Individuals eligible for this role must meet the prescribed qualifications.",
          "For the position of Chief Inspector of Mines under the Coal Act of 1952, individuals with prescribed qualifications are appointed by the Central Government. Similarly, the appointment of subordinate Inspectors of Mines follows the same criteria.",
          "Inspectors of Mines, including the Chief Inspector, are appointed by the Central Government under the Coal Act of 1952. Qualifications outlined in the Act must be met for appointment.",
          "The process of appointing inspectors under the Coal Act of 1952 involves the Central Government appointing a Chief Inspector of Mines with prescribed qualifications and appointing Inspectors of Mines with the same qualifications to serve under the Chief Inspector."
      ]
    },
    {
      "tag": "chief_inspector_restrictions_1952",
      "patterns": [
          "What are the eligibility criteria for Chief Inspector and Inspectors in mining?",
          "Explain the appointment restrictions for Chief Inspector and Inspectors in mining.",
          "Tell me about the qualifications required for Chief Inspector and Inspectors in mining.",
          "Can you clarify the conditions for appointing Chief Inspector and Inspectors in mining?",
          "Who is eligible for the positions of Chief Inspector and Inspectors in mining?",
          "What are the rules regarding direct or indirect interests in mines for Chief Inspector and Inspectors in mining?",
          "How does one become eligible for the role of Chief Inspector or Inspectors in mining?",
          "Are there any restrictions on holding the office of Chief Inspector or Inspectors in mining?",
          "How is someone eligible to be Cheif Inspector or Inspector of a mine?",
          "Who are eligible to be Cheif Inspector or Inspector of a mine?"
      ],
      "responses": [
          "Chief Inspector and Inspectors in mining must meet strict eligibility criteria. No person can be appointed or continue to hold such office if they have, or subsequently acquire, any direct or indirect interests in any mine or mining rights in India.",
          "The appointment of Chief Inspector and Inspectors in mining is subject to clear eligibility criteria. Individuals cannot have any direct or indirect interests in any mine or mining rights in India, both during the appointment process and while holding the office.",
          "To be eligible for the positions of Chief Inspector or Inspectors in mining, individuals must not have, either at the time of appointment or during their tenure, any direct or indirect interests in any mine or mining rights in India. This restriction is in place to ensure impartiality and prevent conflicts of interest.",
          "The eligibility criteria for Chief Inspector and Inspectors in mining are straightforward: individuals cannot have any direct or indirect interests in any mine or mining rights in India. This rule applies both during the appointment process and their tenure.",
          "Individuals who wish to become Chief Inspector or Inspectors in mining must meet specific qualifications and adhere to the regulation that prohibits any direct or indirect interests in any mine or mining rights in India.",
          "Chief Inspector and Inspectors in mining are subject to strict eligibility rules. These rules prevent individuals from having any direct or indirect interests in any mine or mining rights in India, both at the time of appointment and during their tenure.",
          "The appointment of Chief Inspector and Inspectors in mining is contingent on meeting certain qualifications and abiding by the rule that prohibits any direct or indirect interests in any mine or mining rights in India.",
          "Eligibility for the positions of Chief Inspector or Inspectors in mining is governed by a key rule: individuals cannot have any direct or indirect interests in any mine or mining rights in India. This rule applies throughout the appointment process and their time in office."
      ]
    },
    {
      "tag": "district_magistrate_powers_long_1952",
      "patterns": [
          "What are the powers of the district magistrate in relation to mining?",
          "Can you explain the role of the district magistrate as an Inspector in mining?",
          "Tell me about the duties and powers of the district magistrate in mining.",
          "How does the district magistrate exercise powers in mining?",
          "What is the authority of the district magistrate as an Inspector?",
          "Explain the role of the Central Government in overseeing the district magistrate's powers as an Inspector.",
          "Under what circumstances can the district magistrate perform the duties of an Inspector?",
          "Are there any limitations on the district magistrate's powers as an Inspector?"
      ],
      "responses": [
          "The district magistrate has the authority to exercise the powers and perform the duties of an Inspector in mining, subject to the general or special orders of the Central Government.",
          "In relation to mining, the district magistrate can act as an Inspector and has specific powers and duties. However, these powers are exercised under the general or special orders of the Central Government.",
          "The district magistrate plays a role as an Inspector in mining activities, with powers and duties defined by the Central Government. These powers are subject to general or special orders issued by the Central Government.",
          "The district magistrate's powers and duties as an Inspector in mining are granted under the authority of the Central Government. These powers can be exercised subject to general or special orders issued by the Central Government.",
          "As an Inspector in mining, the district magistrate holds certain powers and duties. These powers are exercised under the oversight of the Central Government, and any actions are subject to general or special orders.",
          "The Central Government has a role in overseeing the powers of the district magistrate when acting as an Inspector in mining. The district magistrate's actions are subject to general or special orders issued by the Central Government.",
          "The district magistrate can perform the duties of an Inspector in mining, but the exercise of these powers is subject to the general or special orders of the Central Government.",
          "While the district magistrate has powers as an Inspector in mining, these powers are not unlimited and are subject to the general or special orders of the Central Government."
      ]
    },
    {
      "tag": "district_magistrate_powers_sm_1952",
      "patterns": [
          "District magistrate powers in mining?",
          "Explain district magistrate's role as Inspector in mining.",
          "District magistrate's duties in mining?",
          "Central Government orders for district magistrate as Inspector?",
          "Limitations on district magistrate's Inspector powers?"
      ],
      "responses": [
          "District magistrates can act as Inspectors in mining with powers and duties as per Central Government orders.",
          "District magistrates serve as Inspectors in mining, following Central Government orders.",
          "District magistrates, as Inspectors in mining, have specific duties and powers under Central Government orders.",
          "District magistrates' Inspector powers in mining are subject to Central Government orders.",
          "District magistrate's powers as Inspector are defined by Central Government orders."
      ]
    },
    {
      "tag": "chief_inspector_public_servant_1952",
      "patterns": [
          "Who are considered public servants under the The Coal act 1952?",
          "Tell me about the legal status of the Chief Inspector and Inspectors.",
          "Are Chief Inspectors and Inspectors considered public servants?",
          "What is the definition of a public servant according to the Indian Penal Code?",
          "Explain the status of the Chief Inspector and Inspectors under the law.",
          "Do the Chief Inspector and Inspectors have the legal status of public servants?",
          "Are Chief Inspectors and Inspectors subject to the Indian Penal Code?",
          "Are Cheif Inspectors and Inspectors considered public servant?"
      ],
      "responses": [
          "The Chief Inspector and all Inspectors are considered public servants within the meaning of the Indian Penal Code.",
          "In accordance with the law, both the Chief Inspector and Inspectors hold the status of public servants as defined by the Indian Penal Code.",
          "Yes, the Chief Inspector and all Inspectors fall under the category of public servants under the Indian Penal Code.",
          "The Indian Penal Code recognizes the Chief Inspector and Inspectors as public servants.",
          "The legal status of the Chief Inspector and Inspectors is that they are deemed public servants under the Indian Penal Code.",
          "Under the law, the Chief Inspector and Inspectors are considered public servants as per the Indian Penal Code.",
          "Yes, the Chief Inspector and Inspectors are subject to the Indian Penal Code, and they hold the legal status of public servants.",
          "Being deemed a public servant under the Indian Penal Code carries certain legal implications and responsibilities."
      ]
    },
    {
      "tag": "chief_inspector_authorization_func_1952",
      "patterns": [
        "How can Chief Inspector grant powers to Inspectors?",
        "Tell me about Chief Inspector's authority to authorize Inspector powers.",
        "What are the conditions for Chief Inspector's authorization of powers?",
        "Who can Chief Inspector authorize to exercise powers?",
        "Explain the role of Central Government in Chief Inspector's authorizations.",
        "Can Chief Inspector specify restrictions when authorizing powers?",
        "What is the purpose of Chief Inspector's written orders for authorizing powers?",
        "Why are some powers excluded from Chief Inspector's authorization?",
        "Give examples of powers that Chief Inspector can delegate.",
        "How does Chief Inspector seek Central Government approval for authorizing powers?",
        "What is the significance of Inspector powers under this Act?",
        "What happens if Chief Inspector authorizes powers without approval?",
        "Are there any limitations to Chief Inspector's authorizations?",
        "Can Chief Inspector's authorization impede mining operations?",
        "Who ensures compliance with Chief Inspector's authorizations?",
        "What happens if someone refuses to comply with authorized Inspector powers?",
        "What is the legal basis for Chief Inspector's authorizations?",
        "Can Chief Inspector's authorizations be challenged or appealed?",
        "What safeguards exist to prevent misuse of Chief Inspector's authorizations?",
        "How often can Chief Inspector issue written orders for authorizing powers?",
        "Give examples of restrictions or conditions Chief Inspector may impose."
      ],
      "responses": [
        "The Chief Inspector, with Central Government approval, can issue written orders to authorize specific Inspectors or classes to exercise certain powers, excluding appeals.",
        "Chief Inspector can delegate various powers to Inspectors as specified in the written orders.",
        "Chief Inspector's authorization is subject to specific conditions and restrictions imposed as deemed fit.",
        "Chief Inspector can authorize named Inspectors or specified classes to exercise powers.",
        "Central Government plays a crucial role in approving Chief Inspector's authorizations.",
        "Yes, Chief Inspector can specify suitable restrictions or conditions when authorizing powers.",
        "Chief Inspector's written orders for authorizing powers ensure clarity and compliance with the specified powers.",
        "Some powers, such as those related to appeals, are excluded from Chief Inspector's authorizations.",
        "Examples of delegated powers include inspection, examination, and inquiry powers.",
        "Chief Inspector follows established procedures and submits necessary documentation to seek Central Government approval.",
        "Inspector powers are essential for enforcing and maintaining compliance with this Act.",
        "Unauthorized authorizations by Chief Inspector may have legal implications.",
        "There are limitations and legal checks on Chief Inspector's authorizations.",
        "Chief Inspector ensures that authorizations do not unreasonably impede mining operations.",
        "Compliance with Chief Inspector's authorizations is the responsibility of mine operators and workers.",
        "Refusal to comply with authorized Inspector powers can lead to legal consequences.",
        "Chief Inspector's authorizations are based on the provisions of this Act and relevant regulations.",
        "Certain aspects of Chief Inspector's authorizations may be subject to challenge or appeal.",
        "Safeguards are in place to prevent misuse of Chief Inspector's authorizations.",
        "Chief Inspector can issue written orders for authorizing powers as needed, following due process.",
        "Examples of restrictions or conditions may include time limitations, reporting requirements, or safety measures."
      ]
    },
    {
      "tag": "chief_inspector_restrict_powers_1952",
      "patterns": [
          "What authority does the Chief Inspector have to restrict powers of other Inspectors?",
          "Explain how the Chief Inspector can prohibit or restrict the exercise of powers by other Inspectors.",
          "Tell me about the process of Chief Inspector restricting powers of specified Inspectors.",
          "Can the Chief Inspector prohibit specific powers for named Inspectors or classes of Inspectors?",
          "What are the conditions or restrictions the Chief Inspector can impose when restricting powers of other Inspectors?",
          "How does the Chief Inspector issue orders to restrict powers of Inspectors?",
          "What powers can the Chief Inspector prohibit or restrict?",
          "What is the role of the Central Government in Chief Inspector's orders to restrict powers?"
      ],
      "responses": [
          "The Chief Inspector has the authority to issue written orders prohibiting or restricting the exercise of powers conferred on Inspectors under this Act for specific Inspectors or classes of Inspectors.",
          "Chief Inspector can prohibit or restrict the exercise of powers by other Inspectors through written orders, specifying the conditions and restrictions, if any.",
          "The process involves the Chief Inspector issuing written orders to prohibit or restrict the exercise of powers for named Inspectors or specified classes of Inspectors.",
          "Yes, the Chief Inspector can prohibit specific powers for either named Inspectors or specified classes of Inspectors, as mentioned in the written order.",
          "When restricting powers of other Inspectors, the Chief Inspector can impose suitable conditions or restrictions to ensure compliance.",
          "The Chief Inspector issues orders in writing to restrict the exercise of powers, providing clarity and specificity on the restrictions.",
          "The Chief Inspector can prohibit or restrict various powers conferred on Inspectors under this Act, as per the written order.",
          "The Central Government plays a role in overseeing the Chief Inspector's orders to restrict powers, ensuring alignment with established procedures and guidelines."
      ]
    },
    {
      "tag": "chief_inspector_area_declaration_1952",
      "patterns": [
          "What is the role of the Chief Inspector in declaring local areas for Inspector powers?",
          "Explain how the Chief Inspector designates areas for the exercise of Inspector powers.",
          "Tell me about the process of Chief Inspector declaring local areas for Inspector powers.",
          "Can the Chief Inspector specify the group or class of mines where Inspectors exercise powers?",
          "What provisions govern the Chief Inspector's declaration of areas for Inspector powers?",
          "How does the Chief Inspector issue orders for declaring areas for Inspector powers?",
          "What factors influence the Chief Inspector's decisions on area declaration?",
          "What is the significance of the Chief Inspector's role in designating areas for Inspector powers?",
          "How does the Chief Inspector declare areas for Inspector powers?",
          "What governs the Chief Inspector's area declarations?",
          "Can Chief Inspector specify mines for Inspector powers?",
          "Explain Chief Inspector's role in area designation.",
          "Explain the role of cheif inspector in area designation."
      ],
      "responses": [
          "The Chief Inspector has the responsibility to declare local areas or groups/classes of mines where Inspectors can exercise their respective powers, subject to other provisions in this section.",
          "Chief Inspector designates areas for the exercise of Inspector powers through a defined process and written orders.",
          "The process involves the Chief Inspector issuing written orders to specify local areas or groups/classes of mines where Inspectors exercise powers.",
          "Yes, the Chief Inspector can specify the group or class of mines with respect to which Inspectors exercise their powers.",
          "The Chief Inspector's area declaration is subject to the provisions outlined in this section, ensuring compliance with established rules.",
          "Chief Inspector issues orders in writing to declare areas for Inspector powers, ensuring clarity and specificity in the designation.",
          "Various factors, including safety, workload, and operational requirements, influence the Chief Inspector's decisions on area declaration.",
          "The Chief Inspector's role in designating areas for Inspector powers is essential for effective oversight and regulation of mining activities."
      ]
    },
    {
      "tag": "function_of_inspector_1952",
      "patterns": [
        "What is the function of an inspector?",
        "Can you specify the function of an inspector",
        "What does an inspector do?",
        "Explain the functions of a inspector?"
      ],
      "responses": [
        "Chief Inspector's Functions:\n1. Authorization of Powers: The Chief Inspector can authorize specific Inspectors or classes of Inspectors to exercise certain powers, excluding appeals, with Central Government approval and conditions as deemed fit.\n2.Prohibition or Restriction: The Chief Inspector can issue written orders to prohibit or restrict specific powers for named Inspectors or specified classes of Inspectors.\n3. Area Declaration: The Chief Inspector designates the local areas or groups/classes of mines where Inspectors can exercise their respective powers, following established rules."
      ]
    },
    {
      "tag": "inspector_powers",
      "patterns": [
          "What powers do Chief Inspectors and Inspectors have under this Act?",
          "Explain the roles of Chief Inspectors and Inspectors in mine inspections.",
          "Can Chief Inspectors and Inspectors enter and inspect mines at any time?",
          "What is the purpose of examining the state and condition of mines by Inspectors?",
          "What powers can Chief Inspectors and Inspectors exercise as per regulations?",
          "Are individuals compelled to answer questions during inspections?",
          "When can Chief Inspectors and Inspectors search places and take possession of materials or records?",
          "How do the provisions of the Code of Criminal Procedure apply to searches or seizures under this Act?"
      ],
      "responses": [
          "Chief Inspectors and Inspectors have various powers, including making examinations, inquiries, inspections, and inquiries to ensure compliance with the Act, regulations, rules, and bye-laws.",
          "They can enter, inspect, and examine mines, ensuring not to unreasonably impede or obstruct mining operations.",
          "Inspectors examine the state, ventilation, and safety of mines and take necessary statements to ensure the health and safety of mine workers.",
          "They can exercise additional powers as prescribed by regulations made by the Central Government.",
          "No person can be compelled to incriminate themselves during inspections.",
          "If an offence is suspected, Chief Inspectors and Inspectors can search places and seize relevant materials or records, subject to applicable legal procedures.",
          "The provisions of the Code of Criminal Procedure apply to searches and seizures under this Act as they do to warrant-based searches."
      ]
    },
    {
      "tag": "government_person_authorization_1952_sec8",
      "patterns": [
          "Who can enter a mine for surveying, leveling, or measuring purposes?",
          "What authorization is required to enter a mine for surveying?",
          "Explain the authority of Government personnel to enter a mine.",
          "What notice period is required before entering a mine for surveying?",
          "Can mine entry for surveying be done at any time?",
          "What is the purpose of surveying, leveling, or measuring a mine?",
          "What is the role of the Chief Inspector or Inspector in authorizing mine entry?",
          "What happens in case of an emergency in a mine?",
          "Is notice required when entering a mine in an emergency?",
          "How can Government personnel obtain authorization for mine entry?",
          "What are the conditions for Government personnel to enter a mine?",
          "What are the responsibilities of the mine manager in this context?",
          "What is the scope of surveying, leveling, or measuring in a mine?",
          "What are the rights of Government personnel while inside a mine?",
          "Are there any restrictions on mine entry for surveying?",
          "Can surveying, leveling, or measuring be done at night?",
          "What safeguards are in place for mine entry in emergencies?",
          "How does this provision ensure safety in mining operations?",
          "Are there any legal consequences for unauthorized mine entry?",
          "What is the process for obtaining special authorization in an emergency?",
          "Who can enter a mine for surveying",
          "Who can enter a mine for leveling",
          "Who can enter a mine for measuring",
          "who can enter mines?",
          "The Coal Act 1952 section-8"
      ],
      "responses": [
          "Any person in the service of the Government, duly authorized by written order of the Chief Inspector or an Inspector, may enter a mine for surveying, leveling, or measuring purposes.",
          "The authorization is granted through a special written order by the Chief Inspector or an Inspector.",
          "Government personnel have the authority to enter a mine after giving at least three days' notice to the mine manager.",
          "Mine entry for surveying can occur at any time, whether during the day or night.",
          "Surveying, leveling, or measuring is conducted to gather data and information about the mine's layout and conditions.",
          "The Chief Inspector or an Inspector plays a key role in authorizing and regulating mine entry for surveying purposes."
      ]
    },
    {
      "tag": "facilities_for_entry_inspection",
      "patterns": [
          "What are the obligations of mine owners, agents, and managers?",
          "Who should provide reasonable facilities for entry, inspection, and inquiry?",
          "Who has the authority to authorize entry under section 8?",
          "Why is it important to provide reasonable facilities for entry and inspection?",
          "Are there any exceptions to providing facilities for entry and inspection?",
          "What kind of facilities should be provided for inspection and inquiry?",
          "How does this provision ensure safety in mining operations?",
          "What rights do Chief Inspectors and Inspectors have during inspections?",
          "What are the consequences of non-compliance with this provision?",
          "What is the purpose of making entries and inspections?",
          "Can inspectors enter mines without prior notice?",
          "How can mine owners cooperate with inspections and inquiries?",
          "What is the scope of surveys and measurements in mines?",
          "How can inspectors ensure compliance with mining regulations?",
          "Is there a timeframe for providing reasonable facilities?",
          "The Coal Act 1952 section-9",
          "What is section-9 of The coal act of 1952"
      ],
      "responses": [
          "As per section 9 Every owner, agent, and manager of a mine is obligated to provide the Chief Inspector, every Inspector, and any person authorized under section 8 with all reasonable facilities for making entries, inspections, surveys, measurements, examinations, or inquiries under this Act.",
          "The responsibility falls on mine owners, agents, and managers to facilitate inspections and inquiries and must provide everything for inspection and inquiry.",
          "The Chief Inspector and Inspectors have the authority to carry out inspections and inquiries under this Act section 8 and must provide everything for entry.",
          "Section 8 authorizes specific individuals to conduct inspections and inquiries and must provide everything for entry.",
          "As per section 9 it is necessary Providing reasonable facilities ensures that mines are in compliance with safety and regulatory standards."
      ]
    },
    {
      "tag": "safety_inspection_1952_sec9a",
      "patterns": [
        "What is the purpose of a safety survey in a mine?",
        "Who is authorized to conduct safety surveys in mines?",
        "Can safety surveys be conducted at night?",
        "Tell me about the importance of safety in mines.",
        "When should a mine manager be notified of a safety survey?",
        "What facilities should the mine owner provide during a safety survey?",
        "How often should safety surveys be conducted in mines?",
        "Are safety surveys mandatory for all mines?",
        "What are the risks of not conducting safety surveys?",
        "What equipment is typically examined during a safety survey?",
        "Explain the role of the Chief Inspector in mine safety.",
        "What data is collected during a safety survey?",
        "What happens if a mine fails a safety survey?",
        "Can you provide statistics on mine accidents?",
        "How can miners contribute to safety in the workplace?",
        "Tell me about safety regulations in the mining industry.",
        "What are the common hazards in mines?",
        "What training is required for mine workers regarding safety?",
        "Are safety audits different from safety surveys?",
        "What is the legal framework for safety in mining?",
        "The Coal Act 1952 Section-9A Sub-section-1.",
        "Health survey in mines",
        "Safety survey in mines"
      ],
      "responses": [
        "The Chief Inspector, an Inspector, or an authorized officer can conduct safety and occupational health surveys in a mine at any time, whether during regular working hours or day and night as necessary. Before doing so, they must provide written notice to the mine manager. The mine's owner, agent, or manager is obligated to provide all essential facilities, which encompass machinery examination, sample collection, data gathering related to the survey, and transportation and examination of any employed mine personnel selected for the survey."
      ]
    },
    {
      "tag": "examination_in_mine_1952_sec9a",
      "patterns": [
        "What is the purpose of the examination in a mine survey?",
        "Who is chosen for examination during a safety and occupational health survey?",
        "Where should a person employed in a mine go for examination during the survey?",
        "What information should a mine worker provide during the examination?",
        "Why is health information important in mine surveys?",
        "Tell me about the responsibilities of mine workers during safety surveys.",
        "Are mine workers required to participate in safety surveys?",
        "What happens if a mine worker refuses to participate in the examination?",
        "Explain the process of examination during a mine survey.",
        "Can a mine worker choose not to provide information during the examination?",
        "Who conducts the examination during safety surveys?",
        "What are the consequences of not participating in the examination?",
        "How often are mine workers chosen for examination in surveys?",
        "Tell me about safety measures in mines.",
        "What are the objectives of occupational health surveys in mines?",
        "What rights do mine workers have during the examination?",
        "What type of information is collected during a mine survey?",
        "Are there any legal regulations for mine worker examinations?",
        "Can you explain the significance of health data in mine surveys?",
        "What is the role of the Chief Inspector in mine examinations?",
        "The Coal Act 1952 Section-9A Sub-section-2."
      ],
      "responses": [
        "Every person employed in a mine who is chosen for examination in any safety and occupational health survey must present themselves for examination at the necessary place and provide all information regarding their work and health for the survey."
      ]
    },
    {
      "tag": "working_time_in_mine_survey_1952_sec9a",
      "patterns": [
        "How is the time spent by mine workers during safety surveys counted?",
        "Is the time spent in a safety and occupational health survey considered working hours?",
        "Do mine workers receive overtime pay for survey participation?",
        "What happens to the working time of mine employees during a survey?",
        "Can you explain the compensation for overtime during surveys?",
        "Is survey participation included in the regular working hours of mine workers?",
        "Are there any exceptions for overtime pay during surveys?",
        "Tell me about the policies regarding working hours during mine surveys.",
        "Who determines the rate of wages for overtime during surveys?",
        "What are the implications of counting survey time as working time?",
        "Are there any regulations governing overtime pay in mines?",
        "What is the standard rate of wages for overtime in mine surveys?",
        "Can mine workers refuse to participate in surveys if they don't want overtime?",
        "How does counting survey time affect mine worker schedules?",
        "Are there any restrictions on the use of survey time for overtime?",
        "What rights do mine workers have regarding overtime during surveys?",
        "Can mine workers negotiate the rate of overtime pay for surveys?",
        "Are there any benefits to mine workers for participating in surveys?",
        "What are the legal provisions for compensating mine workers during surveys?",
        "Can mine workers choose to receive compensatory time off instead of overtime pay?",
        "The Coal Act 1952 Section-9A Sub-section-3."
      ],
      "responses": [
        "The time spent by any person employed in a mine who is chosen for examination in the safety and occupational health survey shall be counted towards their working time. However, any overtime shall be paid at the ordinary rate of wages."
      ]
    },
    {
      "tag": "ordinary_rate_of_wages_1952_sec9a",
      "patterns": [
        "What is the definition of the 'ordinary rate of wages' in mines?",
        "How is the 'ordinary rate of wages' calculated for mine workers?",
        "Can you explain the components of the 'ordinary rate of wages'?",
        "Does the 'ordinary rate of wages' include bonuses?",
        "Are amenities like free housing included in the 'ordinary rate of wages'?",
        "What is the significance of 'dearness allowance' in the 'ordinary rate of wages'?",
        "Is compensation for medical facilities considered in the 'ordinary rate of wages'?",
        "Are all types of allowances included in the 'ordinary rate of wages'?",
        "What is the purpose of the 'underground allowance' in the 'ordinary rate of wages'?",
        "Can you clarify what 'compensation in cash' means in this context?",
        "Are there any exceptions to including allowances in the 'ordinary rate of wages'?",
        "Can you provide examples of allowances that are not included in the 'ordinary rate of wages'?",
        "What is the difference between a bonus and compensation for amenities?",
        "How do mine workers benefit from the 'ordinary rate of wages' definition?",
        "Are there any legal requirements for defining the 'ordinary rate of wages'?",
        "Can mine workers negotiate their 'ordinary rate of wages'?",
        "Do changes in entitlements affect the 'ordinary rate of wages'?",
        "How often is the 'ordinary rate of wages' updated for mine workers?",
        "Can mine workers opt for non-cash benefits instead of the 'ordinary rate of wages'?",
        "Are there any regulations regarding the 'ordinary rate of wages' in mines?"
      ],
      "responses": [
        "For the purposes of sub-section-3 of section 9A The Coal Act 1952, 'ordinary rate of wages' means the basic wages plus any dearness allowance and underground allowance, and compensation in cash, including such compensation accruing through the free issue of foodgrains and edible oils as persons employed in a mine may, for the time being, be entitled to. However, it does not include a bonus (other than a bonus given as an incentive for production) or any compensation accruing through the provision of amenities such as free housing, free supply of coal, medical and educational facilities, sickness allowance, supply of kerosene oil, baskets, tools, and uniforms."
      ]
    },
    {
      "tag": "medical_treatment_for_unfit_workers_1952_sec9a",
      "patterns": [
        "What happens if a mine worker is found medically unfit during an examination?",
        "Can you explain the procedure for a mine worker found medically unfit?",
        "Who bears the cost of medical treatment for unfit mine workers?",
        "Do unfit mine workers receive full wages during their treatment?",
        "How is the entitlement to medical treatment determined for unfit mine workers?",
        "What kind of medical treatment is provided to unfit mine workers?",
        "Are there any conditions or criteria for providing medical treatment to unfit workers?",
        "What is the duration of medical treatment for unfit mine workers?",
        "Can unfit mine workers choose their healthcare providers for treatment?",
        "Is there a waiting period for unfit mine workers to receive medical treatment?",
        "Are there any limitations on the types of medical conditions covered by this policy?",
        "Is there a process for assessing the medical fitness of mine workers?",
        "What documentation is required for unfit mine workers to access medical treatment?",
        "Is there any legal framework governing medical treatment for unfit mine workers?",
        "Can unfit mine workers return to their duties after receiving medical treatment?",
        "How does this policy impact mine worker morale and job security?",
        "What support services are available to unfit mine workers during treatment?",
        "Are there any additional benefits provided to unfit mine workers during treatment?",
        "What are the responsibilities of the owner, agent, and manager in this context?",
        "Is there any dispute resolution mechanism for unfit mine workers and employers?",
        "Tell me about medical treatment of workers?",
        "The Coal Act 1952 Section-9A Sub-section-4."
      ],
      "responses": [
        "Any person who, on examination under sub-section (2), is found medically unfit to do his or her duty must be discharged and will be entitled to undergo medical treatment at the cost of the owner, agent, and manager with full wages during the period of such treatment."
      ]
    },
    {
      "tag": "alternative_employment_for_medically_unfit_workers_1952_sec9a",
      "patterns": [
        "What happens if a mine worker remains medically unfit after treatment?",
        "Can you explain the provisions for medically unfit mine workers?",
        "Who is responsible for providing alternative employment to medically unfit mine workers?",
        "Are there specific criteria for determining if a mine worker is medically unfit?",
        "How is the fitness for alternative employment assessed?",
        "What are the options for medically unfit mine workers if alternative employment is not available?",
        "What is a disability allowance for medically unfit mine workers?",
        "How is the disability allowance rate determined?",
        "Can a medically unfit mine worker choose to leave their employment?",
        "What is disability compensation for mine workers who decide to leave their job?",
        "Are there specific rates prescribed for disability compensation?",
        "Is there a waiting period for alternative employment or compensation?",
        "Are there any legal regulations regarding alternative employment and compensation?",
        "What documentation is required for a medically unfit mine worker to access benefits?",
        "Are there any time limits for seeking alternative employment or compensation?",
        "Can medically unfit mine workers return to their previous jobs after recovery?",
        "How does this policy affect the rights and welfare of medically unfit mine workers?",
        "Are there support services available to assist medically unfit mine workers?",
        "What are the responsibilities of the owner, agent, and manager in this context?",
        "Is there a dispute resolution process for medically unfit mine workers and employers?",
        "The Coal Act 1952 Section-9A Sub-section-5."
      ],
      "responses": [
        "If, after medical treatment, a person referred to in sub-section (4) is declared medically unfit to discharge the duty which he was discharging in a mine before presenting himself for the examination, and such unfitness is directly ascribable to his employment in the mine before such presentation, the owner, agent, and manager shall provide such person with alternative employment in the mine for which he is medically fit. If no such alternative employment is immediately available, the person shall be paid a disability allowance or lump sum disability compensation determined in accordance with the prescribed rates."
      ]
    },
    {
      "tag": "determination_of_rates_for_disabilities_1952_sec9a",
      "patterns": [
        "How are the rates determined under the provisos to sub-section (5)?",
        "Can you explain the factors considered in determining the rates for disabilities?",
        "What is the significance of monthly wages in rate determination?",
        "How does the nature of disabilities affect the rate determination?",
        "Are there specific factors related to rate determination?",
        "Who is responsible for determining the rates for disabilities?",
        "Is there a formula or methodology for rate determination?",
        "Are there any guidelines or criteria for rate determination?",
        "Can you provide examples of how rates vary based on different factors?",
        "Are there different rates for different types of disabilities?",
        "What data or information is used in the rate determination process?",
        "How often are the rates for disabilities reviewed or updated?",
        "Are there any legal regulations governing the rate determination process?",
        "Is there a transparent process for mine workers to understand rate determination?",
        "Are there any industry standards for rates related to disabilities?",
        "Can mine workers provide input or feedback on rate determination?",
        "How do the rates for disabilities impact the financial support provided to mine workers?",
        "Are there support services available to assist mine workers in understanding rates?",
        "What are the responsibilities of the owner, agent, and manager in this context?",
        "Is there a dispute resolution process for rate-related matters?",
        "The Coal Act 1952 Section-9A Sub-section-6."
      ],
      "responses": [
        "The rates under the provisos to sub-section (5) shall be determined having regard to the monthly wages of the employees, the nature of disabilities, and other related factors."
      ]
    },
    {
      "tag": "confidentiality_of_mine_records_1952_sec9a",
      "patterns": [
        "What is the confidentiality policy regarding mine records?",
        "Can you explain the handling of records and information from mine inspections?",
        "Who is responsible for maintaining the confidentiality of mine records?",
        "Under what circumstances can mine inspection records be disclosed?",
        "Are there any exceptions to the confidentiality rule?",
        "What types of information are included in mine records?",
        "Is there a process for determining when disclosure is necessary?",
        "How is the health, safety, and welfare of mine workers ensured?",
        "Can mine workers access their own inspection records?",
        "Are there legal regulations governing the confidentiality of mine records?",
        "What are the consequences of unauthorized disclosure of mine records?",
        "Is there any oversight or monitoring of record confidentiality?",
        "Are there penalties for violating the confidentiality policy?",
        "How long are mine records typically retained?",
        "Are there specific procedures for requesting access to mine records?",
        "Are there any industry standards for mine record confidentiality?",
        "What are the responsibilities of the Chief Inspector and Inspectors in this context?",
        "Is there a mechanism for reporting concerns related to record confidentiality?",
        "Can mine owners or managers request access to inspection records?",
        "Are there any safeguards in place to protect the confidentiality of records?",
        "Disclosure of mine records?",
        "The Coal Act 1952 section-10 sub-section-1"
      ],
      "responses": [
        "All copies of, and extracts from, registers or other records pertaining to any mine and all other information acquired by the Chief Inspector, an Inspector, or any person assisting them during mine inspection or survey shall be regarded as confidential. Such information shall not be disclosed to any person or authority unless the Chief Inspector or the Inspector deems disclosure necessary to ensure the health, safety, or welfare of any person employed in the mine or in any other mine adjacent thereto."
      ]
    },
    {
      "tag": "exceptions_to_mine_information_disclosure_1952_sec9a",
      "patterns": [
        "Are there any exceptions to the confidentiality rule in the Coal Act Section 10, Sub-section (1)?",
        "Can you specify situations where mine information can be disclosed?",
        "Who has the authority to request disclosure of mine information?",
        "Is there a process for disclosing mine information to specific entities?",
        "What entities or individuals can receive mine information under exceptions?",
        "Are there any specific criteria for disclosing mine information?",
        "How does disclosing mine information to a Committee or court of inquiry work?",
        "Can mine owners, agents, or managers access confidential mine information?",
        "Who is a Commissioner for workmen's compensation under the Workmen's Compensation Act?",
        "Under what circumstances can mine information be shared with the Indian Bureau of Mines?",
        "Are there any limitations on disclosing mine information to trade unions?",
        "Can other officers, authorities, or organizations be specified by the Central Government for information disclosure?",
        "Is there a process for requesting the disclosure of mine information?",
        "Are there legal regulations regarding exceptions to mine information disclosure?",
        "What are the responsibilities of the Chief Inspector and Inspectors in relation to information disclosure?",
        "Is there any oversight or monitoring of the information disclosure process?",
        "What are the consequences of unauthorized disclosure of mine information?",
        "Is there a mechanism for reporting concerns related to information disclosure?",
        "Can individuals or organizations appeal for the disclosure of mine information?",
        "How does information disclosure affect the rights and privacy of mine workers?",
        "When is disclosure of information not applicable?",
        "The Coal Act 1952 section-10 sub-section-2"
      ],
      "responses": [
        "Nothing in the Coal Act Section 10, Sub-section (1), shall apply to the disclosure of any such information (if so required) to various entities including courts, Committees or courts of inquiry, official superiors, mine owners, Commissioners for workmen's compensation, the Controller of the Indian Bureau of Mines, registered or recognized trade unions, and other specified officers, authorities, or organizations as may be designated by the Central Government."
      ]
    },
    {
      "tag": "punishment_for_information_disclosure_1952_sec9a",
      "patterns": [
        "What are the consequences of disclosing mine information without consent?",
        "Is there a penalty for unauthorized disclosure of mine information?",
        "Can you explain the punishment for violating the information disclosure provisions?",
        "Who can be held responsible for unauthorized disclosure?",
        "What is the role of the Chief Inspector and Inspectors in this context?",
        "Are there any exceptions to the punishment for unauthorized disclosure?",
        "Is imprisonment the only form of punishment for unauthorized disclosure?",
        "Can fines be imposed for unauthorized disclosure?",
        "What factors determine the severity of the punishment for unauthorized disclosure?",
        "How is consent from the Central Government obtained for disclosure?",
        "Are there any legal safeguards for individuals accused of unauthorized disclosure?",
        "Can individuals or organizations report unauthorized disclosures?",
        "Is there a mechanism for appealing against the punishment for unauthorized disclosure?",
        "What steps can be taken to prevent unauthorized disclosure of mine information?",
        "How does unauthorized disclosure impact mine workers and mine safety?",
        "Are there any legal regulations governing the punishment for unauthorized disclosure?",
        "Is there a statute of limitations for prosecuting unauthorized disclosure cases?",
        "What are the responsibilities of the Chief Inspector and Inspectors in relation to information disclosure?",
        "Is there a mechanism for reporting concerns related to information disclosure?",
        "What rights and protections are provided to individuals accused of unauthorized disclosure?",
        "Is the disclosure of information without Central governments consent Punishable?",
        "The Coal Act 1952 section-10 sub-section-3"
      ],
      "responses": [
        "If the Chief Inspector, an Inspector, or any other person referred to in Sub-section (1) discloses, contrary to the provisions of this section, any such information as mentioned without the consent of the Central Government, they shall be punishable with imprisonment for a term that may extend to one year, or with a fine, or with both."
      ]
    },
    {
      "tag": "sanction_for_trial_under_coal_act_1952_sec9a",
      "patterns": [
        "What is the procedure for initiating a trial under the Coal Act 1952, Section 10?",
        "Is there a requirement for seeking approval before proceeding to trial?",
        "Who has the authority to grant sanction for trial under the Coal Act?",
        "Can you explain the role of the Central Government in granting sanction?",
        "Are there any exceptions to the requirement for sanction?",
        "How is the necessity for trial determined?",
        "What criteria are considered before granting sanction for trial?",
        "Is there a specific process for applying for sanction?",
        "What happens if a court proceeds to trial without obtaining sanction?",
        "What are the consequences of proceeding without Central Government sanction?",
        "Is there a timeline for obtaining sanction for trial?",
        "Are there legal regulations governing the requirement for sanction?",
        "Is there a mechanism for appealing if sanction is denied?",
        "What rights and protections are provided to individuals facing trial under the Coal Act?",
        "Can individuals or organizations report cases that require trial?",
        "Is there a statute of limitations for initiating trials under the Coal Act?",
        "What role do the Chief Inspector and Inspectors play in this context?",
        "Are there any support services for individuals involved in trials?",
        "How does the requirement for sanction impact the efficiency of trials?",
        "Is there a process for requesting expedited sanction for urgent cases?",
        "Can a court proceed with a trial of ant offence under the coal act 1952?",
        "The Coal Act 1952 section-10 sub-section-4"
      ],
      "responses": [
        "No court shall proceed to the trial of any offence under the Coal Act 1952, Section 10, except with the previous sanction of the Central Government."
      ]
    },
    {
      "tag": "appointment_of_certifying_surgeons_1952_sec9a",
      "patterns": [
        "How are certifying surgeons appointed under The Coal Act 1952?",
        "Who has the authority to appoint certifying surgeons for the Act's purposes?",
        "What qualifications are required for medical practitioners to become certifying surgeons?",
        "Can you explain the responsibilities of certifying surgeons?",
        "How are local limits or specific mines assigned to certifying surgeons?",
        "Are there any limitations on the number of certifying surgeons that can be appointed?",
        "Are there specific qualifications or expertise required for certifying surgeons?",
        "What is the role of certifying surgeons in ensuring mine safety?",
        "What happens if a mine does not have an appointed certifying surgeon?",
        "How often are certifying surgeons appointed or reassigned?",
        "Are there any legal regulations governing the appointment of certifying surgeons?",
        "Is there a mechanism for appealing certifying surgeon appointments?",
        "Are certifying surgeons compensated for their services?",
        "Are there any ethical guidelines or standards for certifying surgeons?",
        "How do certifying surgeons contribute to the health and safety of mine workers?",
        "Is there a process for reporting concerns or grievances related to certifying surgeons?",
        "What role do the Chief Inspector and Inspectors play in relation to certifying surgeons?",
        "Can mine workers choose their certifying surgeons?",
        "Are there any support services available to mine workers in relation to certifying surgeons?",
        "What is the significance of certifying surgeons in The Coal Act 1952?",
        "The Coal Act 1952 section-11 sub-section-1"
      ],
      "responses": [
        "The Central Government may appoint qualified medical practitioners to be certifying surgeons for the purposes of The Coal Act 1952, within such local limits or for such mine or class or description of mines as it may assign to them respectively."
      ]
    },
    {
      "tag": "authorization_of_medical_practitioners_by_certifying_surgeon_1952_sec9a",
      "patterns": [
        "Under what conditions can a certifying surgeon authorize another medical practitioner?",
        "What is the process for a certifying surgeon to authorize another medical practitioner?",
        "Who has the authority to grant approval for the authorization of medical practitioners?",
        "What are the powers that a certifying surgeon can delegate to another medical practitioner?",
        "Can you explain the role and responsibilities of an authorized medical practitioner?",
        "Is there a specific duration for which an authorized medical practitioner can exercise powers?",
        "How does the authorization of medical practitioners impact the implementation of the Act?",
        "Are there any limitations or restrictions on the authorization process?",
        "Is there a mechanism for appealing authorization decisions?",
        "Can authorized medical practitioners receive compensation for their services?",
        "Are there any ethical guidelines or standards for authorized medical practitioners?",
        "What is the significance of authorizing medical practitioners in this Act?",
        "Is there a process for reporting concerns or grievances related to authorized medical practitioners?",
        "How do authorized medical practitioners contribute to the health and safety of mine workers?",
        "What role do the Chief Inspector and Inspectors play in relation to authorized medical practitioners?",
        "Can mine workers request specific authorized medical practitioners?",
        "Are there any support services available to mine workers related to authorized medical practitioners?",
        "What is the Central Government's role in imposing conditions on authorizations?",
        "How does the authorization process impact the efficiency of Act implementation?",
        "Are there any legal regulations governing the authorization of medical practitioners?",
        "The Coal Act 1952 section-11 sub-section-2"
      ],
      "responses": [
        "Subject to such conditions as the Central Government may think fit to impose, a certifying surgeon may, with the approval of the Central Government, authorize any qualified medical practitioner to exercise all or any of his powers under this Act for such period as the certifying surgeon may specify. References to a certifying surgeon shall be deemed to include references to any qualified medical practitioner when so authorized."
      ]
    },
    {
      "tag": "qualification_for_certifying_surgeons_1952_sec9a",
      "patterns": [
        "What are the qualifications required to be a certifying surgeon?",
        "Can you explain who can be appointed or authorized as a certifying surgeon?",
        "Are there any restrictions on the appointment of certifying surgeons?",
        "Who is eligible to exercise the powers of a certifying surgeon?",
        "What happens if someone is the owner, agent, or manager of a mine?",
        "Can individuals directly or indirectly interested in a mine become certifying surgeons?",
        "Are there any exceptions to the eligibility criteria for certifying surgeons?",
        "How does employment in a mine affect eligibility for certifying surgeons?",
        "What is the significance of ensuring no conflict of interest for certifying surgeons?",
        "Is there a process for verifying the qualifications of certifying surgeons?",
        "Are there any legal regulations governing the appointment and eligibility of certifying surgeons?",
        "Can individuals appeal if they are denied the position of certifying surgeon?",
        "Is there a mechanism for reporting concerns related to certifying surgeons?",
        "How does the eligibility criteria impact mine safety and worker health?",
        "Are there any support services for individuals interested in becoming certifying surgeons?",
        "What are the responsibilities and duties of certifying surgeons?",
        "Can mine workers request specific certifying surgeons for examinations?",
        "Is there a process for removing certifying surgeons from their positions?",
        "What is the role of the Central Government in overseeing certifying surgeon appointments?",
        "Are there any exceptions or special cases regarding certifying surgeon qualifications?",
        "The Coal Act 1952 section-11 sub-section-2"
      ],
      "responses": [
        "No person shall be appointed to be or authorized to exercise the powers of a certifying surgeon, or having been so appointed or authorized, continue to exercise such powers, who is or becomes the owner, agent, or manager of a mine, or is or becomes directly or indirectly interested therein, or in any process or business carried on therein or in any patent or machinery connected therewith, or is otherwise in the employment of the mine."
      ]
    },
    {
      "tag": "duties_of_certifying_surgeon_1952_sec9a",
      "patterns": [
        "What are the duties of a certifying surgeon in a mine?",
        "Can you explain the responsibilities of certifying surgeons in connection with dangerous occupations?",
        "How does a certifying surgeon carry out medical supervision in a mine?",
        "Are there specific duties related to examining persons engaged in dangerous processes?",
        "What is the role of a certifying surgeon in preventing illnesses in mines?",
        "Can you provide examples of dangerous occupations in a mine?",
        "Are there guidelines or regulations prescribing the duties of certifying surgeons?",
        "Is there a process for reporting concerns or issues related to a certifying surgeon's duties?",
        "How do certifying surgeons contribute to the safety and health of mine workers?",
        "What happens in cases of illness believed to be due to the nature of a mine's processes?",
        "Are there qualifications or training requirements for certifying surgeons?",
        "Can certifying surgeons request additional resources or support for their duties?",
        "Is there a mechanism for certifying surgeons to communicate with mine management?",
        "Are there any industry standards for the duties of certifying surgeons?",
        "What is the significance of medical supervision in mines?",
        "How are dangerous processes identified in a mine?",
        "What is the role of the Central Government in overseeing certifying surgeons' duties?",
        "Is there a process for evaluating the performance of certifying surgeons?",
        "Can mine workers provide feedback on the performance of certifying surgeons?",
        "Are there any exceptions or special cases regarding certifying surgeons' duties?",
        "The Coal Act 1952 section-11 sub-section-2"
      ],
      "responses": [
        "The certifying surgeon shall carry out such duties as may be prescribed in connection with the examination of persons engaged in a mine in dangerous occupations or processes as may be prescribed, and the exercise of medical supervision as may be prescribed for any mine or class of mines where cases of illness have occurred that are reasonable to believe are due to the nature of any process carried on or other conditions of work prevailing in the mine."
      ]
    },
    {
      "tag": "constitution_of_committee_under_coal_act_1952",
      "patterns": [
        "How is the Committee under the Coal Act 1952 constituted?",
        "Can you explain the composition of the Committee appointed under this Act?",
        "Who serves as the Chairman of the Committee?",
        "What is the role of the Chief Inspector of Mines in the Committee?",
        "How are the interests of miners represented in the Committee?",
        "How are the interests of mine owners represented in the Committee?",
        "Who appoints the qualified mining engineers in the Committee?",
        "Are there any specific criteria for the appointment of mining engineers to the Committee?",
        "What is the significance of representing workers' interests in the Committee?",
        "What is the significance of representing owners' interests in the Committee?",
        "Is there a notification process for constituting the Committee?",
        "Is there a set date specified for the constitution of the Committee?",
        "Is the Committee responsible for specific tasks or functions?",
        "What is the Committee's role in relation to the Coal Act 1952?",
        "Are there any regulations governing the functioning of the Committee?",
        "How often is the Committee constituted or reconstituted?",
        "Is there a mechanism for reporting concerns or issues related to the Committee?",
        "What is the Central Government's role in appointing Committee members?",
        "Can individuals or organizations propose candidates for the Committee?",
        "Are there any exceptions or special cases regarding Committee composition?",
        "The Coal Act 1952 section-12 sub-section-1"
      ],
      "responses": [
        "The Central Government shall, with effect from such date as that Government may specify by notification in the Official Gazette, constitute a Committee for the purposes of the Coal Act 1952. The Committee consists of a Chairman appointed by the Central Government, the Chief Inspector of Mines, two persons representing the interests of miners, two persons representing the interests of owners of mines, and two qualified mining engineers not directly employed in the mining industry. At least one of the persons representing miners' interests should be for coal mine workers, and at least one of the persons representing owners' interests should be for owners of coal mines."
      ]
    },
    {
      "tag": "constitution_of_specific_committees_under_coal_act_1952",
      "patterns": [
        "What is the purpose of constituting specific Committees under the Coal Act 1952?",
        "Can you explain the authority of the Central Government to form specific Committees?",
        "How are specific Committees different from the main Committee under the Act?",
        "What matters do these specific Committees deal with?",
        "Who appoints the members of these specific Committees?",
        "Is there a limit on the number of specific Committees that can be constituted?",
        "Are there specific criteria for appointing members to these Committees?",
        "What is the role of these specific Committees in the territories covered by the Act?",
        "How often are specific Committees formed or reformed?",
        "Is there a notification process for constituting specific Committees?",
        "Is there a set date specified for the constitution of specific Committees?",
        "What are the provisions of sub-section (1) regarding the constitution of Committees?",
        "How do these specific Committees contribute to the implementation of the Act?",
        "Is there a mechanism for reporting concerns or issues related to specific Committees?",
        "Are there any legal regulations governing the constitution of specific Committees?",
        "Can individuals or organizations propose candidates for specific Committees?",
        "Is there a process for dissolving specific Committees when they are no longer needed?",
        "What is the Central Government's role in overseeing specific Committees?",
        "Are there any exceptions or special cases regarding specific Committee constitution?",
        "What is the significance of these specific Committees in relation to the Coal Act 1952?",
        "The Coal Act 1952 section-12 sub-section-2"
      ],
      "responses": [
        "Without prejudice to the generality of sub-section (1), the Central Government may constitute one or more Committees to deal with specific matters relating to any part of the territories to which the Coal Act 1952 extends, or to a mine or a group of mines. The Central Government may appoint members for these Committees, and the provisions of sub-section (1) (except the proviso thereto) shall apply for the constitution of any Committee under this sub-section as they apply for the constitution of a Committee under that sub-section."
      ]
    },
    {
      "tag": "validity_of_committee_act_or_proceedings_coal_act_1952_sec12",
      "patterns": [
        "What happens if there is a vacancy among the members of a Committee?",
        "Does the existence of vacancies affect the validity of a Committee's act or proceeding?",
        "Is there a process for filling vacancies in a Committee?",
        "How are defects in the constitution of a Committee addressed?",
        "Can a Committee continue its work if there are vacant positions?",
        "Are there any exceptions to the validity of Committee acts or proceedings?",
        "What rights and protections are provided to Committees in this regard?",
        "How does the presence of vacancies impact the decision-making process of a Committee?",
        "Is there a mechanism for reporting concerns related to vacancies or defects in Committee constitution?",
        "Are there any legal regulations governing the validity of Committee acts or proceedings?",
        "What role does the Central Government play in addressing vacancies in Committees?",
        "Can individuals or organizations propose candidates to fill Committee vacancies?",
        "Is there a time limit for filling vacancies in a Committee?",
        "What is the significance of ensuring the validity of Committee acts and proceedings?",
        "How do vacancies or defects impact the effectiveness of a Committee?",
        "What rights and protections are provided to individuals affected by Committee decisions?",
        "Are there any exceptions or special cases regarding the validity of Committee acts or proceedings?",
        "How often are vacancies or defects addressed in Committee constitution?",
        "Can Committees continue their work during the process of filling vacancies?",
        "What is the role of the Chairman in addressing vacancies or defects in a Committee?",
        "The Coal Act 1952 section-12 sub-section-3"
      ],
      "responses": [
        "No act or proceeding of a Committee shall be invalid by reason only of the existence of any vacancy among its members or any defect in the constitution thereof."
      ]
    },
    {
      "tag": "duties_and_functions_of_committee_under_coal_act_1952_sec13",
      "patterns": [
        "What are the duties and functions of the Committee under Section 13 of the Coal Act 1952?",
        "Can you explain the role of the Committee in making rules and regulations under this Act?",
        "How does the Committee make recommendations to the Central Government?",
        "What is the Committee's responsibility in enquiring into accidents and other matters?",
        "How does the Committee report on accidents and referred matters?",
        "Is there a process for referring accidents or matters to the Committee?",
        "What appeals or objections does the Committee hear and decide?",
        "Are there any limitations on the appeals or objections that the Committee can address?",
        "Is there a mechanism for reporting concerns or issues to the Committee?",
        "How often does the Committee meet to perform its functions?",
        "Is there a timeline for the Committee to complete its tasks?",
        "What is the role of the Central Government in relation to the Committee's recommendations?",
        "Can individuals or organizations propose matters for the Committee to consider?",
        "Are there any legal regulations governing the Committee's duties and functions?",
        "How does the Committee contribute to the implementation of the Coal Act 1952?",
        "What is the significance of the Committee's role in hearing appeals and objections?",
        "What happens if there is a conflict between notices or orders under this Act and the Committee's decisions?",
        "Are Committee decisions binding, or can they be challenged?",
        "What is the process for appealing the decisions made by the Committee?",
        "Are there any exceptions or special cases regarding the Committee's functions?",
        "The Coal Act 1952 section-13 sub-section-1"
      ],
      "responses": [
        "As per sub-section 1, section 13 of the Coal Act 1952, the Committee constituted under sub-section (1) of section 12 shall consider proposals for making rules and regulations under this Act and make appropriate recommendations to the Central Government. It also enquires into accidents or other matters referred to it by the Central Government and makes reports. The Committee, subject to the provisions of sub-section (2), hears and decides appeals or objections against notices or orders under this Act or the regulations, rules, or bye-laws thereunder, as required by this Act or as may be prescribed."
      ]
    },
    {
      "tag": "chief_inspector_role_in_committee_proceedings_coal_act_1952_sec13",
      "patterns": [
        "What is the role of the Chief Inspector in the proceedings of the Committee?",
        "Can the Chief Inspector participate in Committee proceedings?",
        "Is the Chief Inspector allowed to make decisions in the Committee?",
        "How does the Chief Inspector's role differ in appeals or objections?",
        "Is there a specific prohibition on the Chief Inspector's involvement?",
        "What happens if the Chief Inspector is part of an appeal or objection case?",
        "Are there any exceptions to the Chief Inspector's role in the Committee?",
        "What is the significance of this provision in Section 13 of the Coal Act 1952?",
        "How are conflicts of interest addressed when the Chief Inspector is involved?",
        "Is there a mechanism for reporting concerns related to the Chief Inspector's role?",
        "How does this provision ensure impartiality in the Committee's proceedings?",
        "What role does the Chief Inspector play in the mining industry?",
        "Can individuals or organizations appeal to the Chief Inspector?",
        "Are there any legal regulations governing the Chief Inspector's involvement in the Committee?",
        "How does this provision impact the functioning of the Committee?",
        "What rights and protections are provided to parties involved in appeals or objections?",
        "Can the Chief Inspector be called as a witness in Committee proceedings?",
        "Are there any exceptions or special cases regarding the Chief Inspector's role?",
        "What is the role of the Chairman in the Committee when the Chief Inspector is involved?",
        "How does this provision ensure transparency and fairness in the Committee?",
        "The Coal Act 1952 section-13 sub-section-2"
      ],
      "responses": [
        "As per sub-section 2, section 13 of the Coal Act 1952, the Chief Inspector shall not take part in the proceedings of the Committee with respect to any appeal or objection against an order or notice made or issued by him or act in relation to any matter pertaining to such appeal or objection as a member of the Committee."
      ]
    },
    {
      "tag": "committee_powers_under_section_12_coal_act_1952_sec14",
      "patterns": [
        "What powers can a Committee constituted under Section 12 exercise?",
        "Can a Committee exercise the powers of an Inspector under this Act?",
        "What is the purpose of a Committee exercising Inspector powers?",
        "How does a Committee decide which powers to exercise?",
        "Is there a process for a Committee to request Inspector powers?",
        "Are there limitations on the powers a Committee can exercise?",
        "What are the functions of a Committee under the Coal Act of 1952?",
        "How does a Committee contribute to the implementation of this Act?",
        "Is there a mechanism for reporting concerns related to a Committee's exercise of powers?",
        "What is the role of the Central Government in overseeing a Committee's powers?",
        "Can individuals or organizations request specific actions from a Committee?",
        "Are there any legal regulations governing a Committee's exercise of powers?",
        "How does this provision impact the effectiveness of a Committee?",
        "What rights and protections are provided to individuals affected by a Committee's actions?",
        "Can a Committee delegate its powers to other entities or individuals?",
        "Are there any exceptions or special cases regarding a Committee's exercise of powers?",
        "What is the significance of this provision in Section 12 of the Coal Act of 1952?",
        "What happens if there is a conflict between a Committee's actions and Inspector actions?",
        "Is there a process for appealing or challenging a Committee's exercise of powers?",
        "How does this provision ensure the Committee can fulfill its functions?",
        "The Coal Act 1952 section-14 sub-section-1"
      ],
      "responses": [
        "A Committee constituted under Section 12 may exercise such of the powers of an Inspector under this Act as it thinks necessary or expedient for the purposes of discharging its functions under the Coal Act of 1952."
      ]
    },
    {
      "tag": "committee_powers_under_section_14_coal_act_1952",
      "patterns": [
        "What powers does a Committee constituted under Section 12 have according to Section 14 of the Coal Act 1952?",
        "Can you explain the powers granted to a Committee under Section 14?",
        "What is the significance of Section 14 in relation to a Committee's powers?",
        "How does Section 14 empower a Committee to discharge its functions?",
        "What are the specific matters covered by Section 14 in terms of powers?",
        "Is there a legal basis for a Committee to exercise these powers?",
        "How does a Committee use its powers related to discovery and inspection?",
        "Can a Committee enforce the attendance of individuals and examine them on oath?",
        "What authority does a Committee have in compelling the production of documents?",
        "Are there any limitations or restrictions on these powers?",
        "Is there a process for invoking these powers by a Committee?",
        "What is the Code of Civil Procedure, 1908 (5 of 1908), mentioned in Section 14?",
        "How does Section 14 contribute to the Committee's effectiveness?",
        "Is there a mechanism for reporting concerns related to a Committee's exercise of these powers?",
        "What role does the Central Government play in overseeing the Committee's powers?",
        "Can individuals or organizations request specific actions from a Committee based on these powers?",
        "Are there any exceptions or special cases regarding the powers granted by Section 14?",
        "How often are these powers invoked by Committees?",
        "What is the purpose of granting these legal powers to Committees?",
        "How does Section 14 ensure fairness and justice in the Committee's proceedings?",
        "The Coal Act 1952 section-14 sub-section-2"
      ],
      "responses": [
        "As per sub-section 2, Section 14 of the Coal Act 1952, a Committee constituted under Section 12 shall, for the purposes of discharging its functions, have the same powers as are vested in a court under the Code of Civil Procedure, 1908 (5 of 1908), when trying a suit in respect of the following matters: (a) discovery and inspection; (b) enforcing the attendance of any person and examining him on oath; (c) compelling the production of documents; and (d) such other matters as may be prescribed."
      ]
    },
    {
      "tag": "expense_recovery_for_committee_inquiry_under_section_15",
      "patterns": [
        "How are the expenses of an inquiry conducted by a Committee under Section 12 handled?",
        "Can the Central Government direct the owner or agent to bear the expenses of the inquiry?",
        "What factors determine whether the expenses are borne in whole or in part by the owner or agent?",
        "Is there a process for calculating the expenses to be paid?",
        "What happens if the owner or agent does not pay the directed amount?",
        "How is the amount directed to be paid by the owner or agent recovered?",
        "Is there a time limit for the owner or agent to make the payment?",
        "What is the role of the Chief Inspector or an Inspector in this process?",
        "Can the owner or agent dispute the expenses directed to be paid?",
        "Is there a legal framework for this expense recovery process?",
        "What is the purpose of the notice from the Central Government or the Chief Inspector?",
        "Are there any exceptions or special cases regarding expense recovery?",
        "How often does the Central Government direct expense recovery for Committee inquiries?",
        "What rights and protections are provided to the owner or agent in this process?",
        "What is the significance of Section 15 in relation to expense recovery?",
        "What if the owner or agent cannot pay the directed amount within six weeks?",
        "Is there an appeals process for the owner or agent?",
        "What measures are taken to ensure a fair and transparent expense recovery process?",
        "Can individuals or organizations request an inquiry by a Committee?",
        "How does Section 15 contribute to accountability in mine operations?",
        "The Coal Act 1952 section-15"
      ],
      "responses": [
        "As per Section 15 of The Coal Act 1952, the Central Government may direct that the expenses of any inquiry conducted by a Committee constituted under Section 12 shall be borne in whole or in part by the owner or agent of the mine concerned. The amount directed to be paid may be recovered by the distress and sale of any movable property within the limits of the magistrate's jurisdiction belonging to such owner or agent. This is applicable if the owner or agent has not paid the amount within six weeks from the date of receiving the notice from the Central Government or the Chief Inspector of Mines."
      ]
    },
    {
      "tag": "notice_before_commencement_of_mining_operation_under_section_16",
      "patterns": [
        "What are the requirements for giving notice before the commencement of mining operations?",
        "Who is responsible for providing notice before starting mining operations?",
        "To whom should the notice be given before the mining operation commences?",
        "Is there a specific form for the written notice, and what information should it contain?",
        "What is the purpose of notifying the Chief Inspector, the Controller, Indian Bureau of Mines, and the district magistrate?",
        "When should the notice be given in relation to the commencement of mining operations?",
        "What happens if the notice is not provided before commencing mining operations?",
        "Are there any exceptions to this notice requirement?",
        "Is there a specific process or channel for submitting the written notice?",
        "Is there a legal framework or regulations governing this notice requirement?",
        "How does this notice requirement contribute to safety and compliance in mining?",
        "Can individuals or organizations request guidance on the notice format and content?",
        "What role does the Chief Inspector play in relation to this notice?",
        "What is the significance of Section 16 in the Coal Act 1952?",
        "Is there a time frame for providing the notice before commencing mining operations?",
        "Are there penalties for failing to provide the required notice?",
        "Is there a mechanism for follow-up or verification after the notice is provided?",
        "Can the notice be modified or updated if there are changes in the mining operation?",
        "Are there any rights or protections for the owner, agent, or manager related to this notice requirement?",
        "How often is this notice requirement enforced in mining operations?",
        "The Coal Act 1952 section-16 sub-section-1",
        "To whom is the notice supposed to be given? ",
        "Who Should give the notice?"
        
      ],
      "responses": [
        "As per sub-section 1, Section 16 of the Coal Act 1952, the owner, agent, or manager of a mine shall, before the commencement of any mining operation, give notice in writing to the Chief Inspector, the Controller, Indian Bureau of Mines, and the district magistrate of the district in which the mine is situated. The notice should be in such form and contain such particulars relating to the mine as may be prescribed."
      ]
    },
    {
      "tag": "notice_timing_under_section_16",
      "patterns": [
        "What is the timing requirement for giving notice before the commencement of mining operations?",
        "How much advance notice is required before starting mining operations?",
        "Is there a specific timeline for providing the notice?",
        "When should the notice be given to reach the concerned persons?",
        "What happens if the notice is given less than one month before mining operations begin?",
        "Are there any exceptions to the one-month notice requirement?",
        "Can the notice be provided earlier than one month before mining operations?",
        "Is there a specific date from which the one-month notice period is calculated?",
        "What is the purpose of the one-month notice requirement?",
        "Is there a process for verifying that the notice has reached the concerned persons?",
        "How does this notice timing contribute to safety and preparedness in mining operations?",
        "Can individuals or organizations request an extension of the notice period?",
        "What rights or protections are provided to the persons concerned regarding the notice?",
        "Is there a legal framework or regulations specifying the notice timing?",
        "How often is this notice timing requirement enforced in mining operations?",
        "What is the significance of Section 16, sub-section 2, in the Coal Act 1952?",
        "How does this provision ensure adequate planning and coordination for mining operations?",
        "Are there any penalties for failing to provide timely notice?",
        "Can the one-month notice period be modified or shortened under certain circumstances?",
        "Is there a mechanism for addressing disputes or concerns related to the notice timing?",
        "When Should the notice be given?",
        "By When Should the notice reach the reciever?",
        "The Coal Act 1952 section-16 sub-section-2"
      ],
      "responses": [
        "As per sub-section 2, Section 16 of the Coal Act 1952, any notice given under sub-section (1) of section 16 shall be given in such a way that it reaches the persons concerned at least one month before the commencement of any mining operation."
      ]
    },
    {
      "tag": "manager_qualification_and_appointment_under_section_17",
      "patterns": [
        "What are the qualifications required for a manager of a mine under Section 17?",
        "Who is responsible for appointing the manager of a mine?",
        "Is there a specific process for appointing a manager with the required qualifications?",
        "Can the owner or agent of the mine appoint themselves as the manager?",
        "What are the prescribed qualifications for a mine manager?",
        "Are there exceptions to the requirement for a sole manager?",
        "How does this provision ensure the safety and competence of mine managers?",
        "Is there a legal framework or regulations governing the appointment of mine managers?",
        "Can individuals or organizations request guidance on manager qualifications?",
        "What is the significance of Section 17 in relation to mine management?",
        "Are there any rights or protections for individuals appointed as mine managers?",
        "Is there a process for verifying the qualifications of appointed mine managers?",
        "How often are mine managers appointed or replaced?",
        "What happens if a mine does not have a qualified manager?",
        "Is there a mechanism for reporting concerns related to manager qualifications?",
        "How does this provision contribute to the efficient operation of mines?",
        "Can a manager be appointed temporarily while a qualified manager is sought?",
        "Is there a time frame for appointing a qualified manager after mine operations commence?",
        "Can the owner or agent appoint someone else to manage the mine on their behalf?",
        "What qualifications are typically prescribed for mine managers?",
        "The Coal Act 1952 section-17 sub-section-1"
      ],
      "responses": [
        "As per sub-section 1, Section 17 of the Coal Act 1952, every mine shall be under a sole manager who shall have the prescribed qualification. The owner or agent of every mine shall appoint a person having such qualification to be the manager. However, the owner or agent may appoint themselves as the manager if they possess the prescribed qualifications."
      ]
    },
    {
      "tag": "manager_responsibilities_under_section_17_subsection_2",
      "patterns": [
        "What are the responsibilities of a mine manager under Section 17, sub-section 2?",
        "How does the manager's role differ from the owner or agent's role in mine management?",
        "Is the manager solely responsible for the overall management of the mine?",
        "Are there any specific duties or tasks that the manager must perform?",
        "Can the owner or agent provide instructions to the manager?",
        "Is there a requirement for written confirmation of instructions from the owner or agent?",
        "What happens if the manager receives conflicting instructions?",
        "Is there a mechanism for resolving disputes between the manager and the owner or agent?",
        "How does this provision ensure effective management and control of the mine?",
        "Is there a legal framework or regulations governing the manager's responsibilities?",
        "What rights or protections are provided to the manager in performing their duties?",
        "Can individuals or organizations request clarification on the manager's role?",
        "What is the significance of Section 17, sub-section 2, in mine management?",
        "Is the manager accountable for the safety and operation of the mine?",
        "How often are instructions from the owner or agent provided to the manager?",
        "Is there a process for documenting instructions and decisions in mine management?",
        "Can the manager delegate responsibilities to other individuals in the mine?",
        "What happens if the manager believes that certain instructions are unsafe or against regulations?",
        "Can the manager request additional resources or support for mine management?",
        "Are there any limitations on the manager's authority in mine management?",
        "The Coal Act 1952 section-17 sub-section-2"
      ],
      "responses": [
        "As per sub-section 2, Section 17 of the Coal Act 1952, subject to any instructions given to him by or on behalf of the owner or agent of the mine, the manager shall be responsible for the overall management, control, supervision, and direction of the mine. All instructions when given by the owner or agent shall be confirmed in writing forthwith."
      ]
    },
    {
      "tag": "instructions_to_mine_employees_under_section_17_subsection_3",
      "patterns": [
        "How are instructions given to mine employees according to Section 17, sub-section 3?",
        "Are there any restrictions on who can give instructions to mine employees?",
        "Is it permissible for the owner or agent to give instructions directly to mine employees?",
        "Under what circumstances can the owner or agent give instructions to mine employees?",
        "What constitutes an emergency that allows direct instructions to mine employees?",
        "Is there a process for defining and handling emergencies in mining operations?",
        "What are the statutory duties of mine employees mentioned in this sub-section?",
        "Can instructions affecting statutory duties be given through the manager?",
        "How does this provision contribute to the safety and efficiency of mining operations?",
        "Is there a legal framework or regulations governing the giving of instructions to mine employees?",
        "What rights or protections are provided to mine employees in this context?",
        "Can individuals or organizations request clarification on the process of giving instructions?",
        "What is the significance of Section 17, sub-section 3, in mine operations?",
        "Is there a mechanism for reporting concerns related to instructions given to mine employees?",
        "How often do situations arise where the owner or agent needs to give direct instructions?",
        "Is there a process for documenting and tracking instructions given to mine employees?",
        "What happens if an owner or agent violates this sub-section?",
        "Can the manager refuse to relay certain instructions to mine employees?",
        "Is there a time frame for confirming instructions through the manager?",
        "Can mine employees seek clarification or guidance if they receive conflicting instructions?",
        "The Coal Act 1952 section-17 sub-section-3"
      ],
      "responses": [
        "As per sub-section 3, Section 17 of the Coal Act 1952, except in case of an emergency, the owner or agent of a mine or anyone on his behalf shall not give, otherwise than through the manager, instructions affecting the fulfillment of his statutory duties, to a person employed in a mine who is responsible to the manager."
      ]
    },
    {
      "tag": "responsibilities_for_compliance_under_section_17_subsection_3",
      "patterns": [
        "What are the responsibilities of the owner and agent in relation to compliance with Section 17, sub-section 3?",
        "Is compliance with sub-section 3, Section 17, the sole responsibility of the owner and agent?",
        "What financial provisions are required for compliance with the sub-section 3 of Section 17?",
        "Are there any specific steps or actions that the owner and agent must take for compliance?",
        "Is there a process for ensuring compliance with regulations, rules, bye-laws, and orders?",
        "How does this provision contribute to safety and accountability in mine operations?",
        "Is there a legal framework or regulations specifying the responsibilities for compliance?",
        "What rights or protections are provided to the owner and agent in fulfilling these responsibilities?",
        "Can individuals or organizations request guidance on compliance requirements?",
        "What is the significance of Section 17, sub-section 3, in mine management and compliance?",
        "Is there a mechanism for reporting concerns or issues related to compliance?",
        "How often are these responsibilities for compliance enforced in mine operations?",
        "Is there a process for documenting and reporting on compliance efforts?",
        "What happens if the owner and agent fail to fulfill these responsibilities?",
        "Is there a time frame for taking the necessary steps for compliance?",
        "Can the owner and agent delegate compliance responsibilities to others?",
        "Are there penalties for non-compliance with sub-section 3, Section 17?",
        "Can the owner and agent seek assistance or resources for compliance?",
        "What role does compliance play in ensuring the safety and well-being of mine employees?",
        "Is there a process for addressing disputes or challenges related to compliance?",
        "What are the responsibilities of the owner and agent regarding compliance with the Coal Act 1952?",
        "Are there specific financial provisions that the owner and agent must make?",
        "What other steps are necessary for compliance with the Coal Act 1952 and related regulations?",
        "Can you provide examples of financial provisions and other necessary steps for compliance?",
        "Is there a process for ensuring compliance with regulations, rules, bye-laws, and orders?",
        "How does this provision contribute to safety and accountability in mine operations?",
        "Is there a legal framework or specific regulations that outline these responsibilities?",
        "Are there any rights or protections provided to the owner and agent in fulfilling these responsibilities?",
        "Can individuals or organizations request guidance on compliance requirements?",
        "What is the significance of this provision in the Coal Act 1952?",
        "Is there a mechanism for reporting concerns or issues related to compliance and provisions?",
        "How often are these responsibilities for compliance enforced in mine operations?",
        "Is there a process for documenting and reporting on compliance efforts?",
        "What happens if the owner and agent fail to fulfill these responsibilities?",
        "Is there a time frame for taking the necessary steps and making financial provisions?",
        "Can the owner and agent delegate these responsibilities to others?",
        "Are there penalties for non-compliance with the Coal Act 1952 and related regulations?",
        "Can the owner and agent seek assistance or resources for compliance?",
        "What role does compliance play in ensuring the safety and well-being of mine employees?",
        "Is there a process for addressing disputes or challenges related to compliance?",
        "The Coal Act 1952 section-18 sub-section-1"
      ],
      "responses": [
        "As per the provisions of sub-section 3, Section 17 of the Coal Act 1952, the owner and agent of every mine shall each be responsible for making financial and other provisions and for taking such other steps as may be necessary for compliance with the provisions of the sub-section 3, Section 17, and the regulations, rules, bye-laws, and orders made thereunder."
      ]
    },
    {
      "tag": "responsibility_for_matters_under_rules_in_coal_act_1952_subsection_2_section_18",
      "patterns": [
        "What responsibilities are outlined in sub-section 2, Section 18 of the Coal Act 1952?",
        "Can you specify the matters provided for in the rules under clauses (d), (e), and (p) of section 58?",
        "Who is exclusively responsible for carrying out these responsibilities according to this sub-section?",
        "Is there any delegation of responsibilities mentioned in this provision?",
        "What is the role of the owner and agent in securing compliance with these provisions?",
        "Are there specific rules or regulations referenced in this sub-section?",
        "How does this provision contribute to safety and compliance in mining operations?",
        "Is there a legal framework or specific regulations governing these responsibilities?",
        "What rights or protections are provided to individuals appointed for securing compliance?",
        "Can individuals or organizations request clarification on these responsibilities?",
        "What is the significance of this provision in the Coal Act 1952?",
        "Is there a mechanism for reporting concerns or issues related to these responsibilities?",
        "Are these responsibilities regularly monitored and enforced?",
        "Is there a process for documenting compliance efforts related to these responsibilities?",
        "What happens if the owner or agent fails to fulfill these responsibilities?",
        "Is there a time frame for carrying out these responsibilities?",
        "Can the owner or agent appoint multiple individuals for securing compliance?",
        "Are there penalties for non-compliance with the provisions outlined in this sub-section?",
        "Is there a mechanism for addressing disputes or challenges related to these responsibilities?",
        "Can individuals appointed for securing compliance request additional resources or support?",
        "The Coal Act 1952 section-18 sub-section-2"
      ],
      "responses": [
        "According to sub-section 2, Section 18 of the Coal Act 1952, the responsibility in respect of matters provided for in the rules made under clauses (d), (e), and (p) of section 58 shall be exclusively carried out by the owner and agent of the mine and by such person (other than the manager) whom the owner or agent may appoint for securing compliance with the aforesaid provisions."
      ]
    },
    {
      "tag": "liability_for_instructions_under_coal_act_1952_subsection_3_section_18",
      "patterns": [
        "What does sub-section 3, Section 18 of the Coal Act 1952 state regarding liability for instructions?",
        "Can you explain the consequences of instructions given under this sub-section?",
        "What are the conditions under which instructions may result in contravention of the provisions?",
        "Who is held liable if instructions given under sub-section 2 or otherwise contravene the Act or regulations?",
        "Is there a process for determining whether instructions have led to contravention?",
        "Are there any exceptions or defenses for individuals giving instructions?",
        "How does this provision contribute to accountability in mine operations?",
        "Is there a legal framework or specific regulations referenced in this sub-section?",
        "What rights or protections are provided to individuals giving instructions?",
        "Can individuals or organizations request clarification on liability in this context?",
        "What is the significance of this liability provision in the Coal Act 1952?",
        "Is there a mechanism for reporting concerns or issues related to instructions and liability?",
        "Is liability for contravention regularly enforced?",
        "Is there a process for documenting and investigating instances of contravention?",
        "What are the potential penalties for individuals held liable for contravention?",
        "Is there a time frame for determining liability in such cases?",
        "Can the manager be held liable for instructions given otherwise than through him?",
        "Are there opportunities for individuals giving instructions to dispute allegations of contravention?",
        "Can individuals seek legal counsel or assistance in cases of liability?",
        "What role does this provision play in ensuring compliance with the Coal Act 1952 and related regulations?",
        "The Coal Act 1952 section-18 sub-section-3"
      ],
      "responses": [
        "According to sub-section 3, Section 18 of the Coal Act 1952, if the carrying out of any instructions given under sub-section (2) or given otherwise than through the manager under sub-section (3) of section 17 results in the contravention of the provisions of this Act or of the regulations, rules, bye-laws, or orders made thereunder, every person giving such instructions shall also be liable for the contravention of the provisions concerned."
      ]
    },
    {
      "tag": "responsibility_for_operations_under_coal_act_1952_subsection_4_section_18",
      "patterns": [
        "What are the responsibilities outlined in sub-section 4, Section 18 of the Coal Act 1952?",
        "Can you explain the duties of the owner, agent, and manager with regard to mine operations?",
        "Are there specific provisions in this sub-section regarding compliance?",
        "How do sub-sections (1), (2), and (3) affect these responsibilities?",
        "Is there a process for ensuring that operations are conducted in accordance with the Act and regulations?",
        "What role does this provision play in ensuring safety and compliance in mining operations?",
        "Are there any specific legal requirements or regulations referenced in this sub-section?",
        "Are there rights or protections provided to the owner, agent, and manager in fulfilling these responsibilities?",
        "Can individuals or organizations seek guidance on how to fulfill these duties?",
        "What is the significance of this responsibility provision in the Coal Act 1952?",
        "Is there a mechanism for reporting concerns or issues related to mine operations and compliance?",
        "Is the enforcement of these responsibilities regular and consistent?",
        "Is there a process for documenting and reporting on compliance efforts related to operations?",
        "What happens if the owner, agent, or manager fails to fulfill these responsibilities?",
        "Is there a specified time frame for carrying out these responsibilities?",
        "Can the owner, agent, or manager delegate these responsibilities to others?",
        "Are there penalties for non-compliance with the provisions outlined in this sub-section?",
        "Is there a mechanism for addressing disputes or challenges related to these responsibilities?",
        "Can individuals appointed to oversee operations request additional resources or support?",
        "How does this provision contribute to the overall safety and well-being of mine employees?",
        "The Coal Act 1952 section-18 sub-section-4"
      ],
      "responses": [
        "As per sub-section 4, Section 18 of the Coal Act 1952, subject to the provisions of sub-sections (1), (2), and (3), the owner, agent, and manager of every mine shall each be responsible to see that all operations carried on in connection with the mine are conducted in accordance with the provisions of this Act and of the regulations, rules, bye-laws, and orders made thereunder."
      ]
    },
    {
      "tag": "liability_for_contravention_under_coal_act_1952_subsection_5_section_18",
      "patterns": [
        "What does sub-section 5, Section 18 of the Coal Act 1952 state regarding liability for contravention?",
        "Who may be deemed guilty of contravention under this provision?",
        "Are there specific conditions or exceptions outlined in this sub-section?",
        "What is the role of due diligence and reasonable means in preventing contraventions?",
        "Is there a legal framework or specific regulations referenced in this sub-section?",
        "How does this provision contribute to accountability for contraventions?",
        "What rights or protections are provided to individuals against whom contravention is alleged?",
        "Can individuals or organizations request clarification on liability in this context?",
        "What is the significance of this liability provision in the Coal Act 1952?",
        "Is there a mechanism for reporting concerns or issues related to contraventions?",
        "Is the enforcement of liability for contravention regular and consistent?",
        "Is there a process for documenting and investigating instances of contravention?",
        "What are the potential penalties for individuals deemed guilty of contravention?",
        "Is there a specified time frame for determining liability in such cases?",
        "Can individuals held liable for contravention dispute allegations?",
        "Can individuals seek legal counsel or assistance in cases of liability?",
        "How does this provision balance accountability and fairness?",
        "What role do officials appointed for supervision play in this liability?",
        "Is there a process for determining prima facie liability in inquiries and investigations?",
        "Can individuals or organizations challenge the determination of prima facie liability?",
        "The Coal Act 1952 section-18 sub-section-5"
      ],
      "responses": [
        "As per sub-section 5, Section 18 of the Coal Act 1952, in the event of any contravention by any person whosoever of any of the provisions of this Act or of the regulations, rules, bye-laws, or orders made thereunder, except those which specifically require any person to do any act or thing or prohibit any person from doing an act or thing, besides the person who contravenes, each of the following persons shall also be deemed to be guilty of such contravention unless he proves that he had used due diligence to secure compliance with the provisions and had taken reasonable means to prevent such contravention:\n(i) the official or officials appointed to perform duties of supervision in respect of the provisions contravened;\n(ii) the manager of the mine;\n(iii) the owner and agent of the mine;\n(iv) the person appointed, if any, to carry out the responsibility under sub-section (2):\nProvided that any of the persons aforesaid may not be proceeded against if it appears on inquiry and investigation that he is not prima facie liable."
      ]
    },
    {
      "tag": "no_defence_for_owner_agent_in_coal_act_1952_subsection_6_section_18",
      "patterns": [
        "What does sub-section 6, Section 18 of the Coal Act 1952 state regarding a defence for the owner or agent?",
        "Is there a provision that can be used as a defence in proceedings against the owner or agent?",
        "What factors are considered in proceedings related to the owner or agent?",
        "Are there exceptions or conditions under which a defence may be valid?",
        "Is the appointment of a manager or other officials relevant to this provision?",
        "How does this provision affect the liability of the owner or agent?",
        "Is there a legal framework or specific regulations referenced in this sub-section?",
        "What rights or protections are provided to the owner or agent in such proceedings?",
        "Can individuals or organizations challenge the applicability of this provision?",
        "What is the significance of this no-defence provision in the Coal Act 1952?",
        "Is there a mechanism for addressing disputes or challenges related to this provision?",
        "Can individuals seek legal counsel or assistance in cases where no defence is allowed?",
        "How does this provision balance accountability and responsibility?",
        "What role does the appointment of officials play in proceedings against the owner or agent?",
        "Are there penalties or consequences outlined in this sub-section?",
        "Is there a specified process for conducting proceedings against the owner or agent?",
        "Can individuals or organizations appeal decisions made under this provision?",
        "Is there a timeframe for initiating proceedings under this sub-section?",
        "What considerations are taken into account in determining liability in such proceedings?",
        "Can the owner or agent dispute the allegations made in proceedings?",
        "The Coal Act 1952 section-18 sub-section-6"
      ],
      "responses": [
        "As per sub-section 6, Section 18 of the Coal Act 1952, it shall not be a defence in any proceedings brought against the owner or agent of a mine under this section that the manager and other officials have been appointed in accordance with the provisions of this Act or that a person to carry the responsibility under sub-section (2) has been appointed."
      ]
    },
    {
      "tag": "provision_of_drinking_water_in_mines",
      "patterns": [
        "What are the requirements for providing drinking water in mines?",
        "Is there a specific provision for ensuring access to drinking water in mines?",
        "Who is responsible for making arrangements for drinking water in mines?",
        "Are there guidelines for the placement of drinking water points in mines?",
        "What is the Chief Inspector's role in regulating drinking water provisions?",
        "Can you explain the importance of providing cool and wholesome drinking water in mines?",
        "Is there a minimum standard for the sufficiency of drinking water supply?",
        "What constitutes 'effective arrangements' for providing drinking water?",
        "Are there exceptions or special provisions for persons employed below ground?",
        "What types of 'effective arrangements' may be permitted for those below ground?",
        "Is there a process for monitoring and enforcing the provision of drinking water in mines?",
        "Are there penalties or consequences for non-compliance with this provision?",
        "Is there a timeframe for ensuring the availability of drinking water in mines?",
        "Can individuals or organizations request assistance in implementing these arrangements?",
        "How does this provision contribute to the well-being of mine employees?",
        "Are there regulations or additional guidelines related to drinking water provisions?",
        "Is there a mechanism for reporting concerns or issues related to drinking water supply in mines?",
        "Is the compliance with this provision regularly monitored by authorities?",
        "What are the potential health and safety risks associated with inadequate drinking water in mines?",
        "Are there any provisions for testing the quality of drinking water in mines?",
        "Can individuals or organizations seek guidance on how to comply with this provision?",
        "The Coal Act 1952 section-19 sub-section-1",
        "The Coal Act 1952 section 19 sub-section 1"
      ],
      "responses": [
        "In every mine, effective arrangements shall be made to provide and maintain at suitable points conveniently situated a sufficient supply of cool and wholesome drinking water for all persons employed therein. Provided that in the case of persons employed below ground, the Chief Inspector may, in lieu of drinking water being provided and maintained at suitable points, permit any other effective arrangements to be made for such supply."
      ]
    },
    {
      "tag": "marking_and_distance_requirements_for_drinking_water_points_in_mines",
      "patterns": [
        "What are the marking requirements for drinking water points in mines?",
        "Is there a specific language requirement for marking such points?",
        "Who determines the language to be used for marking?",
        "Are there restrictions on the proximity of drinking water points to certain facilities?",
        "What is the acceptable distance between drinking water points and washing places, urinals, or latrines?",
        "Is there a process for obtaining approval from the Chief Inspector for a shorter distance?",
        "How is compliance with the marking and distance requirements enforced?",
        "Can individuals or organizations request guidance on marking and distance compliance?",
        "What is the significance of legibly marked drinking water points in mines?",
        "Are there penalties for non-compliance with these requirements?",
        "Is there a specified timeframe for implementing these marking and distance provisions?",
        "What are the potential consequences of not adhering to the approved distances?",
        "How does this provision contribute to the well-being and safety of mine employees?",
        "Are there any exceptions or special circumstances where these requirements may be waived?",
        "Is there a mechanism for reporting concerns or issues related to compliance with these provisions?",
        "Is the compliance with marking and distance requirements regularly monitored by authorities?",
        "Are there any recommended practices for maintaining and inspecting drinking water points?",
        "Can individuals or organizations seek assistance in meeting these marking and distance requirements?",
        "Is there a process for translating the marking into languages understood by the majority of employees?",
        "What is the role of the Chief Inspector in overseeing these requirements?",
        "The Coal Act 1952 section-19 sub-section-2",
        "The Coal Act 1952 section 19 sub-section 2"
      ],
      "responses": [
        "All such points shall be legibly marked 'DRINKING WATER' in a language understood by a majority of the persons employed in the mine, and no such point shall be situated within six meters of any washing place, urinal, or latrine unless a shorter distance is approved in writing by the Chief Inspector."
      ]
    },
    {
      "tag": "provision_of_latrines_and_urinals_in_mines",
      "patterns": [
        "How many latrines and urinals must be provided separately for males and females in mines?",
        "What types of latrines and urinals are prescribed for mines?",
        "Why is it important to have convenient and accessible latrines and urinals in mines?",
        "Is there a specific authority responsible for ensuring compliance with latrine and urinal provisions?",
        "Are there exceptions for different types of mines regarding latrines and urinals?",
        "Is there a process for reporting concerns or issues related to these facilities in mines?",
        "How does providing such facilities contribute to the well-being of mine employees?",
        "Are there penalties for not providing the required number of latrines and urinals?",
        "Can individuals or organizations seek guidance on complying with these provisions?",
        "What is the historical context behind these provisions in mine safety?",
        "The Coal Act 1952 section-20 sub-section-1",
        "The Coal Act 1952 section 20 sub-section 1"
      ],
      "responses": [
        "There shall be provided, separately for males and females in every mine, a sufficient number of latrines and urinals of prescribed types so situated as to be convenient and accessible to persons employed in the mine at all times."
      ]
    },
    {
      "tag": "maintenance_of_latrines_and_urinals_in_mines",
      "patterns": [
        "How should the latrines and urinals provided in mines be maintained?",
        "What are the requirements for adequate lighting and ventilation in these facilities?",
        "Who is responsible for ensuring that latrines and urinals are clean and sanitary?",
        "Are there penalties for not maintaining latrines and urinals in a clean and sanitary condition?",
        "Is there a process for reporting unsanitary conditions in these facilities?",
        "What measures are in place to monitor the cleanliness of these facilities?",
        "Can individuals or organizations seek assistance in maintaining these facilities?",
        "What role does the maintenance of these facilities play in mine safety?",
        "Are there any additional regulations or guidelines related to the maintenance of these facilities?",
        "Why is it crucial to keep these facilities well-maintained in mines?",
        "The Coal Act 1952 section-20 sub-section-2",
        "The Coal Act 1952 section 20 sub-section 2"
      ],
      "responses": [
        "All latrines and urinals provided under sub-section (1) shall be adequately lighted, ventilated, and at all times maintained in a clean and sanitary condition."
      ]
    },
    {
      "tag": "central_government_specifications_for_latrines_and_urinals_in_mines",
      "patterns": [
        "How does the Central Government specify the number of latrines and urinals for mines?",
        "What factors are considered when determining the number of facilities required?",
        "Are there regulations that outline the Central Government's specifications for sanitation in mines?",
        "What obligations do mine employees have regarding sanitation?",
        "Can the Central Government make additional provisions for sanitation in mines?",
        "What is the purpose of these specifications in ensuring the health of mine employees?",
        "Is there a process for individuals or organizations to provide input on these specifications?",
        "Is there a historical background to these specifications in mine safety?",
        "How does the Central Government enforce compliance with these specifications?",
        "Are there penalties for non-compliance with the Central Government's specifications for sanitation in mines?",
        "The Coal Act 1952 section-20 sub-section-3",
        "The Coal Act 1952 section 20 sub-section 3"
      ],
      "responses": [
        "The Central Government may specify the number of latrines and urinals to be provided in any mine, in proportion to the number of males and females employed in the mine, and provide for such other matters in respect of sanitation in mines (including the obligations in this regard of persons employed in the mine) as it may consider necessary in the interests of the health of the persons so employed."
      ]
    },
    {
      "tag": "medical_appliances_in_mines_subsection1",
      "patterns": [
        "How many first-aid boxes are required in a mine?",
        "What should be included in the contents of a first-aid box?",
        "Is there a specific location where first-aid boxes should be placed in a mine?",
        "Who is responsible for ensuring the availability of first-aid boxes in mines?",
        "Are there any regulations regarding the maintenance of first-aid boxes?",
        "What is the purpose of having readily accessible first-aid boxes in mines?",
        "Can individuals or organizations request guidance on first-aid box requirements?",
        "What is the historical context of these provisions in mine safety?",
        "The Coal Act 1952 section-21 sub-section-1",
        "The Coal Act 1952 section 21 sub-section 1"
      ],
      "responses": [
        "In every mine, there shall be provided and maintained a specified number of first-aid boxes or cupboards equipped with prescribed contents, readily accessible during all working hours."
      ]
    },
    {
      "tag": "medical_appliances_in_mines_subsection2",
      "patterns": [
        "What items are allowed inside a first-aid box in mines?",
        "Are there any restrictions on what can be kept in a first-aid box?",
        "Can additional items be included in a first-aid box if necessary?",
        "Is it mandatory to follow the prescribed contents for first-aid boxes?",
        "Are there penalties for keeping unauthorized items in a first-aid box?",
        "How are the contents of first-aid boxes regulated?",
        "Is there a process for reporting issues with the contents of first-aid boxes?",
        "What is the significance of keeping first-aid boxes well-stocked and organized in mines?",
        "Are there historical examples of the importance of adhering to these regulations?",
        "Who ensures compliance with the contents of first-aid boxes in mines?",
        "The Coal Act 1952 section-21 sub-section-2",
        "The Coal Act 1952 section 21 sub-section 2"
      ],
      "responses": [
        "Nothing except the prescribed contents shall be kept in a first-aid box or cupboard or room."
      ]
    },
    {
      "tag": "medical_appliances_in_mines_subsection3",
      "patterns": [
        "Who is responsible for the first-aid boxes in mines?",
        "What qualifications or training does the person in charge of first-aid boxes need?",
        "Is the responsible person required to be available at all times during working hours?",
        "Are there any specific duties assigned to the person in charge of first-aid boxes?",
        "Can individuals or organizations seek guidance on appointing responsible persons?",
        "Is there a process for reporting concerns about the person in charge of first-aid boxes?",
        "Why is it important to have trained personnel responsible for first-aid boxes?",
        "Are there any historical incidents related to the role of responsible persons in mine safety?",
        "How does the responsible person contribute to mine safety?",
        "The Coal Act 1952 section-21 sub-section-3",
        "The Coal Act 1952 section 21 sub-section 3"
      ],
      "responses": [
        "Every first-aid box or cupboard shall be kept in the charge of a responsible person who is trained in such first-aid treatment as may be prescribed and who shall always be readily available during the working hours of the mine."
      ]
    },
    {
      "tag": "medical_appliances_in_mines_subsection4",
      "patterns": [
        "What arrangements are made for transporting injured or ill mine workers to hospitals?",
        "Who is responsible for organizing the conveyance of injured or ill workers to hospitals?",
        "Are there specific protocols for responding to injuries or illnesses in mines?",
        "Is there a process for requesting emergency medical assistance in mines?",
        "Are there penalties for not providing suitable arrangements for medical transport?",
        "What is the significance of having quick access to medical facilities in mines?",
        "Are there historical examples of the importance of timely medical transport in mines?",
        "How does the availability of medical transport contribute to mine safety?",
        "What measures are in place to ensure the efficiency of medical transport in mines?",
        "Can individuals or organizations seek assistance in implementing medical transport arrangements?",
        "The Coal Act 1952 section-21 sub-section-4",
        "The Coal Act 1952 section 21 sub-section 4"
      ],
      "responses": [
        "In every mine, there shall be made so as to be readily available such arrangements as may be prescribed for the conveyance to hospitals or dispensaries of persons who, while employed in the mine, suffer bodily injury or become ill."
      ]
    },
    {
      "tag": "medical_appliances_in_mines_subsection5",
      "patterns": [
        "What are the requirements for a first-aid room in larger mines?",
        "How is the size and equipment of a first-aid room determined?",
        "Who is responsible for staffing the first-aid room in larger mines?",
        "Is there a specific medical and nursing staff requirement for first-aid rooms?",
        "Are there penalties for not providing a first-aid room in larger mines?",
        "Can individuals or organizations seek guidance on setting up a first-aid room?",
        "What is the historical context behind the establishment of first-aid rooms in mines?",
        "How does having a first-aid room benefit the safety of mine workers?",
        "What are the prescribed equipment and staff qualifications for a first-aid room?",
        "Is there a minimum number of employees that triggers the requirement for a first-aid room in a mine?",
        "The Coal Act 1952 section-21 sub-section-5",
        "The Coal Act 1952 section 21 sub-section 5"
      ],
      "responses": [
        "In every mine wherein more than one hundred and fifty persons are employed, there shall be provided and maintained a first-aid room of such size with such equipment and in the charge of such medical and nursing staff as may be prescribed."
      ]
    },
    {
      "tag": "mines_safety_subsection1",
      "patterns": [
        "What should be done if a mine or its practices are considered dangerous?",
        "Who can issue a notice regarding dangerous practices in a mine?",
        "What happens if a mine is deemed to be unsafe?",
        "How are the particulars of a dangerous mine communicated to the owner?",
        "What is the purpose of specifying the time and manner for remedy?",
        "Can the owner, agent, or manager appeal such notices?",
        "Are there historical examples of mines being labeled as dangerous?",
        "Who oversees the safety of mines in general?",
        "What is the significance of safety notices in mining?",
        "How does this provision contribute to mine safety?",
        "The Coal Act 1952 section-22 sub-section-1",
        "The Coal Act 1952 section 22 sub-section 1"
      ],
      "responses": [
        "If a mine or any matter related to it is considered dangerous or defective, the Chief Inspector or an Inspector may issue a notice to the owner, agent, or manager to remedy the situation within a specified time."
      ]
    },
    {
      "tag": "mines_safety_subsection1A",
      "patterns": [
        "What happens if the owner fails to comply with a notice?",
        "Who can prohibit the employment of certain individuals in a mine?",
        "What is the purpose of prohibiting employment in a mine?",
        "Is there a process for lifting such prohibitions?",
        "Are there penalties for non-compliance with safety notices?",
        "Who determines whether an employee's work is necessary for safety?",
        "How does this provision safeguard mine workers?",
        "Can individuals or organizations seek guidance in these matters?",
        "Are there historical examples of safety-related work prohibitions?",
        "What role does the Chief Inspector or Inspector play in this?",
        "The Coal Act 1952 section-22 sub-section-1A",
        "The Coal Act 1952 section 22 sub-section 1A"
      ],
      "responses": [
        "If the owner, agent, or manager fails to comply with a notice issued under sub-section (1), the Chief Inspector or Inspector can prohibit the employment of individuals not reasonably necessary for safety."
      ]
    },
    {
      "tag": "mines_safety_subsection2",
      "patterns": [
        "Under what circumstances can the extraction of minerals be prohibited?",
        "Who can issue an order to prohibit mineral extraction?",
        "What is the objective of prohibiting mineral extraction?",
        "Are there conditions under which extraction can resume?",
        "How does this provision ensure mine safety?",
        "Is there historical data illustrating the importance of this provision?",
        "Can individuals or organizations seek guidance on mineral extraction safety?",
        "What does 'adequate provision' for fire or flooding entail?",
        "What is the role of the Chief Inspector or Inspector in this context?",
        "How does this provision contribute to mine safety?",
        "The Coal Act 1952 section-22 sub-section-2",
        "The Coal Act 1952 section 22 sub-section 2"
      ],
      "responses": [
        "The Chief Inspector or Inspector can prohibit the extraction of minerals in a mine if it poses risks like pillar collapse or endangering workers' lives or safety."
      ]
    },
    {
      "tag": "mines_safety_subsection3",
      "patterns": [
        "When can the Chief Inspector or Inspector urgently prohibit employment in a mine?",
        "What is the basis for an urgent and immediate danger assessment?",
        "How is 'urgent and immediate danger' defined?",
        "Is there a process to lift such prohibitions?",
        "How does this provision ensure worker safety?",
        "Can individuals or organizations seek assistance in urgent danger situations?",
        "Are there historical instances illustrating the urgency of this provision?",
        "What is the role of the Chief Inspector or Inspector in this?",
        "How does this provision contribute to mine safety?",
        "The Coal Act 1952 section-22 sub-section-3",
        "The Coal Act 1952 section 22 sub-section 3"
      ],
      "responses": [
        "If there is urgent and immediate danger to mine workers' lives or safety, the Chief Inspector or Inspector can prohibit employment of individuals not deemed necessary to mitigate the danger."
      ]
    },
    {
      "tag": "mines_safety_subsection3A",
      "patterns": [
        "What happens if an individual's employment is prohibited?",
        "Are there consequences for not paying full wages during prohibitions?",
        "Is there an option to provide alternative employment?",
        "How can an employer resolve prohibitions and wage payments?",
        "Can individuals or organizations seek guidance on these matters?",
        "What role does the owner, agent, or manager play in these situations?",
        "Are there historical examples illustrating the implications of this provision?",
        "How does this provision safeguard mine workers' livelihoods?",
        "What is the process for determining alternative employment?",
        "The Coal Act 1952 section-22 sub-section-3A",
        "The Coal Act 1952 section 22 sub-section 3A"
      ],
      "responses": [
        "If an individual's employment is prohibited, the employer must pay full wages for the period of prohibition, or provide alternative employment at the same wages."
      ]
    },
    {
      "tag": "mines_safety_subsection4",
      "patterns": [
        "Can the owner, agent, or manager appeal safety notices or orders?",
        "Who has the authority to confirm, modify, or cancel safety notices or orders?",
        "What happens after an appeal is made?",
        "Is there a time frame for making appeals?",
        "How does the appeal process work?",
        "Are there historical cases where safety notices or orders were appealed?",
        "What is the role of the Chief Inspector in the appeal process?",
        "How does this provision ensure fairness in safety measures?",
        "What are the typical outcomes of appeals?",
        "Can individuals or organizations seek assistance in the appeal process?",
        "The Coal Act 1952 section-22 sub-section-4",
        "The Coal Act 1952 section 22 sub-section 4"
      ],
      "responses": [
        "The owner, agent, or manager can appeal safety notices or orders within ten days. The Chief Inspector can confirm, modify, or cancel these notices or orders."
      ]
    },
    {
      "tag": "mines_safety_subsection5",
      "patterns": [
        "Who should report safety notices and orders to the Central Government?",
        "What information needs to be included in the reports?",
        "Is there a time frame for reporting?",
        "How is the Central Government informed?",
        "Are there historical examples of reported safety matters?",
        "What role does the Central Government play in mine safety?",
        "Can individuals or organizations contact the Central Government regarding safety concerns?",
        "How do these reports contribute to overall mine safety?",
        "Are there any common issues or trends identified through these reports?",
        "Is there a public record of reported safety matters?",
        "The Coal Act 1952 section-22 sub-section-5",
        "The Coal Act 1952 section 22 sub-section 5"
      ],
      "responses": [
        "The Chief Inspector or Inspector must report safety notices and orders to the Central Government. The reports include details of the safety matters, and the Central Government is informed immediately."
      ]
    },
    {
      "tag": "mines_safety_subsection6",
      "patterns": [
        "What should the owner, agent, or manager do if they object to safety notices or orders?",
        "Is there a formal process for objecting to safety notices or orders?",
        "What is the timeline for raising objections?",
        "How is the objection process initiated?",
        "What happens after objections are submitted?",
        "Are there historical cases of objections to safety notices or orders?",
        "What is the role of the Central Government in the objection process?",
        "How does this provision ensure fairness in addressing safety concerns?",
        "Can individuals or organizations get guidance on objecting to safety matters?",
        "Are objections typically resolved in favor of mine owners?",
        "The Coal Act 1952 section-22 sub-section-6",
        "The Coal Act 1952 section 22 sub-section 6"
      ],
      "responses": [
        "If the owner, agent, or manager objects to a safety notice or order, they can submit their objections in writing to the Central Government within twenty days. The Central Government refers the objections to a Committee for resolution."
      ]
    },
    {
      "tag": "mines_safety_subsection7",
      "patterns": [
        "What should happen while objections to safety notices or orders are being resolved?",
        "Can safety measures be put on hold during the objection process?",
        "What is the significance of the Central Government's decision?",
        "Can mine owners request a suspension of safety notices?",
        "What is the role of the Committee during this period?",
        "Are there historical instances of safety measures being suspended?",
        "How does this provision balance safety and operational considerations?",
        "Can individuals or organizations seek guidance on suspension requests?",
        "What factors influence the Committee's decision to suspend safety measures?",
        "What is the typical duration of suspensions?",
        "The Coal Act 1952 section-22 sub-section-7",
        "The Coal Act 1952 section 22 sub-section 7"
      ],
      "responses": [
        "Safety notices or orders must be complied with while objections are being resolved. However, the Committee can suspend the operation of a notice under certain circumstances upon request from the owner, agent, or manager."
      ]
    },
    {
      "tag": "mines_safety_subsection8",
      "patterns": [
        "How does this section relate to the powers of a magistrate?",
        "Under what circumstances can a magistrate's powers be invoked?",
        "What is the connection between this section and the Code of Criminal Procedure?",
        "Are there historical examples where magistrates' powers were invoked?",
        "How does this provision ensure the swift implementation of safety measures?",
        "Can individuals or organizations engage with magistrates on safety matters?",
        "What actions can a magistrate take under the Code of Criminal Procedure?",
        "Is there a role for magistrates in enforcing mine safety?",
        "The Coal Act 1952 section-22 sub-section-8",
        "The Coal Act 1952 section 22 sub-section 8"
      ],
      "responses": [
        "This section doesn't affect the powers of a magistrate under the Code of Criminal Procedure, 1898. Magistrates can take actions under their authority to enforce safety when necessary."
      ]
    },
    {
      "tag": "mines_safety_section22a_subsection1",
      "patterns": [
        "What happens if the owner, agent, or manager doesn't comply with safety provisions?",
        "Can the Chief Inspector take action if safety provisions are not followed?",
        "How does the Chief Inspector enforce safety compliance?",
        "Is there a timeframe for complying with safety provisions?",
        "What is the purpose of the notice given by the Chief Inspector?",
        "Are there penalties for non-compliance with safety provisions?",
        "What happens if the specified time for compliance is not met?",
        "Can the compliance timeframe be extended?",
        "The Coal Act 1952 section-22A sub-section-1",
        "The Coal Act 1952 section 22A sub-section 1"
      ],
      "responses": [
        "If the owner, agent, or manager fails to comply with safety provisions, the Chief Inspector can issue a notice requiring compliance within a specified time."
      ]
    },
    {
      "tag": "mines_safety_section22a_subsection2",
      "patterns": [
        "What happens if safety provisions are not followed within the specified time?",
        "Can the Chief Inspector prohibit employment if safety provisions are not complied with?",
        "Is there a penalty for failing to comply with the notice?",
        "How does the Chief Inspector ensure safety measures are enforced?",
        "What is the purpose of prohibiting employment?",
        "Can anyone be employed in or around the mine?",
        "Can the prohibition of employment be extended?",
        "What is considered 'reasonably necessary' for securing compliance?",
        "The Coal Act 1952 section-22A sub-section-2",
        "The Coal Act 1952 section 22A sub-section 2"
      ],
      "responses": [
        "If safety provisions are not complied with within the specified time, the Chief Inspector can prohibit the employment of anyone whose employment is not reasonably necessary for compliance."
      ]
    },
    {
      "tag": "mines_safety_section22a_subsection3",
      "patterns": [
        "What rights do employees have if their employment is prohibited?",
        "Are employees entitled to wages if their employment is prohibited?",
        "Who is responsible for paying the wages?",
        "Can alternative employment be provided instead of wages?",
        "How does this provision protect employees' livelihoods?",
        "Can employees refuse alternative employment?",
        "What determines the wages for alternative employment?",
        "Can employees appeal the prohibition of their employment?",
        "The Coal Act 1952 section-22A sub-section-3",
        "The Coal Act 1952 section 22A sub-section 3"
      ],
      "responses": [
        "Employees whose employment is prohibited are entitled to full wages for the period of prohibition. The owner, agent, or manager is liable to pay these wages. Alternatively, they may provide alternative employment at the same wages."
      ]
    },
    {
      "tag": "mines_safety_section22a_subsection4",
      "patterns": [
        "How do the provisions of section 22A relate to Section 22?",
        "Are there similarities between the sections 22 and 22A?",
        "What happens if the Chief Inspector issues a notice or order under section 22A?",
        "Can objections be raised against notices or orders issued under this section 22A?",
        "Is there a committee involved in this section 22A as well?",
        "Are there any historical cases related to this section 22A?",
        "The Coal Act 1952 section-22A sub-section-4",
        "The Coal Act 1952 section 22A sub-section 4"
      ],
      "responses": [
        "The provisions of sub-sections (5), (6), and (7) of Section 22 also apply to notices issued under this section or orders made under this section."
      ]
    },
    {
      "tag": "mines_safety_section23_subsection1",
      "patterns": [
        "What should the owner, agent, or manager do in case of a mine accident?",
        "Are there specific types of accidents they need to report?",
        "How should they notify the authorities?",
        "Is there a prescribed time frame for reporting accidents?",
        "What is the purpose of posting a notice on a special notice board?",
        "Who should be able to inspect the notice?",
        "How long should the notice be kept on the board?",
        "The Coal Act 1952 section-23 sub-section-1",
        "The Coal Act 1952 section 23 sub-section 1"
      ],
      "responses": [
        "In case of a mine accident, the owner, agent, or manager must notify the relevant authority in the prescribed form within the specified time. They should also post one copy of the notice on a special notice board for inspection by trade union officials, keeping it there for at least fourteen days."
      ]
    },
    {
      "tag": "mines_safety_section23_subsection1A",
      "patterns": [
        "What should be done in case of an accident causing reportable injury?",
        "Is there a specific form for reporting such accidents?",
        "How often should copies of entries be furnished to the Chief Inspector?",
        "What qualifies as a 'reportable injury'?",
        "Are there any quarterly reporting requirements?",
        "What is the purpose of maintaining such a register?",
        "The Coal Act 1952 section-23 sub-section-1A",
        "The Coal Act 1952 section 23 sub-section 1A"
      ],
      "responses": [
        "In case of an accident causing reportable injury, the owner, agent, or manager should enter the occurrence in a register in the prescribed form. Copies of these entries should be provided to the Chief Inspector once every quarter."
      ]
    },
    {
      "tag": "mines_safety_section23_subsection2",
      "patterns": [
        "What happens if an accident causes loss of life?",
        "How is an inquiry into such accidents conducted?",
        "Is there a timeframe for conducting the inquiry?",
        "Who conducts the inquiry if the authority is not the Inspector?",
        "What is the role of the Inspector in such inquiries?",
        "The Coal Act 1952 section-23 sub-section-2",
        "The Coal Act 1952 section 23 sub-section 2"
      ],
      "responses": [
        "If an accident causes loss of life, the authority shall conduct an inquiry within two months of receiving the notice. If the authority is not the Inspector, they will involve the Inspector in the inquiry."
      ]
    },
    {
      "tag": "mines_safety_section23_subsection3",
      "patterns": [
        "Are all accidents required to be reported?",
        "What types of accidents fall under this section?",
        "Who determines which accidents need to be registered?",
        "What is the purpose of registering accidents?",
        "The Coal Act 1952 section-23 sub-section-3",
        "The Coal Act 1952 section 23 sub-section 3"
      ],
      "responses": [
        "The Central Government may direct that accidents, causing bodily injury resulting in enforced absence from work for more than twenty-four hours, should be registered or subject to the provisions of sub-section (1) or sub-section (1A), as specified."
      ]
    },
    {
      "tag": "mines_safety_section23_subsection4",
      "patterns": [
        "What should be done with entries in the register?",
        "How often should copies of entries be sent to the Chief Inspector?",
        "Is there a specific deadline for sending copies of entries?",
        "Why is it important to send copies to the Chief Inspector?",
        "The Coal Act 1952 section-23 sub-section-4",
        "The Coal Act 1952 section 23 sub-section 4"
      ],
      "responses": [
        "Entries in the register should be sent to the Chief Inspector on or before the 20th day of January in the following year. This ensures that records are maintained and accessible for inspection."
      ]
    },
    {
      "tag": "mines_safety_section23_subsection5",
      "patterns": [
        "What precautions are taken in case of an accident causing loss of life or serious bodily injury?",
        "Who decides whether the place of accident can be disturbed or altered?",
        "Under what circumstances can the place of accident be altered?",
        "What happens if the Chief Inspector fails to inspect the place of accident within a specific time frame?",
        "Why is it important not to disturb the place of accident?",
        "The Coal Act 1952 section-23 sub-section-5",
        "The Coal Act 1952 section 23 sub-section 5"
      ],
      "responses": [
        "In case of an accident causing loss of life or serious bodily injury, the place of accident should not be disturbed or altered without the consent of the Chief Inspector or Inspector. Disturbance or alteration may only occur if it is necessary to prevent further accidents, remove bodies, rescue persons, or if work discontinuation would severely impact mine operations."
      ]
    },
    {
      "tag": "mines_safety_section24_subsection1",
      "patterns": [
        "What happens when a serious accident occurs in or around a mine?",
        "Who decides whether a formal inquiry is needed for an accident?",
        "What is the role of the Central Government in such cases?",
        "Can assessors be appointed for the inquiry?",
        "What is the purpose of a formal inquiry?",
        "Who conducts the inquiry?",
        "The Coal Act 1952 section-24 sub-section-1",
        "The Coal Act 1952 section 24 sub-section 1"
      ],
      "responses": [
        "When a serious accident occurs in or around a mine, the Central Government may appoint a competent person to conduct a formal inquiry into the causes and circumstances of the accident. They may also appoint assessors with legal or special knowledge to assist in the inquiry."
      ]
    },
    {
      "tag": "mines_safety_section24_subsection2",
      "patterns": [
        "What powers does the person conducting the inquiry have?",
        "Can witnesses be compelled to attend the inquiry?",
        "Can documents and material objects be requested during the inquiry?",
        "Is there a specific legal framework for the inquiry process?",
        "The Coal Act 1952 section-24 sub-section-2",
        "The Coal Act 1952 section 24 sub-section 2"
      ],
      "responses": [
        "The person conducting the inquiry has all the powers of a civil court under the Code of Civil Procedure, 1908, to enforce the attendance of witnesses and compel the production of documents and material objects for the purpose of the inquiry."
      ]
    },
    {
      "tag": "mines_safety_section24_subsection3",
      "patterns": [
        "What powers can the person conducting the inquiry exercise?",
        "Are there any restrictions on the powers during the inquiry?",
        "How can the Inspector's powers be used during the inquiry?",
        "The Coal Act 1952 section-24 sub-section-3",
        "The Coal Act 1952 section 24 sub-section 3"
      ],
      "responses": [
        "The person conducting the inquiry can exercise any of the powers of an Inspector under this Act that they find necessary or expedient for the purpose of the inquiry."
      ]
    },
    {
      "tag": "mines_safety_section24_subsection4",
      "patterns": [
        "What should the person conducting the inquiry include in the report?",
        "What information should be in the report?",
        "Can the assessors provide observations in the report?",
        "What is the purpose of the report?",
        "The Coal Act 1952 section-24 sub-section-4",
        "The Coal Act 1952 section 24 sub-section 4"
      ],
      "responses": [
        "The person conducting the inquiry should prepare a report for the Central Government. This report should state the causes of the accident, its circumstances, and any observations that the person or assessors consider relevant."
      ]
    },
    {
      "tag": "mines_safety_section25_subsection1",
      "patterns": [
        "What should the owner, agent, or manager of a mine do if a person employed in the mine contracts a disease related to mining operations?",
        "Is there a requirement to report such diseases?",
        "Who should receive notice of the disease?",
        "What is the procedure for reporting mining-related diseases?",
        "The Coal Act 1952 section-25 sub-section-1",
        "The Coal Act 1952 section 25 sub-section 1"
      ],
      "responses": [
        "If a person employed in a mine contracts a disease notified by the Central Government as connected with mining operations, the owner, agent, or manager of the mine must send notice of the disease to the Chief Inspector and other prescribed authorities in the specified form and within the prescribed time."
      ]
    },
    {
      "tag": "mines_safety_section25_subsection2",
      "patterns": [
        "What should a medical practitioner do if they treat a person believed to have a mining-related disease?",
        "Is there a reporting requirement for medical practitioners treating mine workers?",
        "What information should be included in the report?",
        "The Coal Act 1952 section-25 sub-section-2",
        "The Coal Act 1952 section 25 sub-section 2"
      ],
      "responses": [
        "If a medical practitioner attends to a person who is or has been employed in a mine and is suffering from or believed to be suffering from a disease notified under sub-section (1), they must promptly send a written report to the Chief Inspector. The report should include the patient's name and address, the disease, and the name and address of the mine where the patient worked."
      ]
    },
    {
      "tag": "mines_safety_section25_subsection3",
      "patterns": [
        "What happens when the Chief Inspector receives a report of a mining-related disease?",
        "How is the report confirmed?",
        "Is there a fee involved?",
        "Who pays the fee?",
        "The Coal Act 1952 section-25 sub-section-3",
        "The Coal Act 1952 section 25 sub-section 3"
      ],
      "responses": [
        "When the Chief Inspector receives a report under sub-section (2) and it is confirmed to their satisfaction that the person is suffering from a disease notified under sub-section (1), the Chief Inspector shall pay a prescribed fee to the medical practitioner. This fee is recoverable as an arrear of land revenue from the owner, agent, or manager of the mine where the person contracted the disease."
      ]
    },
    {
      "tag": "mines_safety_section25_subsection4",
      "patterns": [
        "What happens if a medical practitioner fails to comply with the reporting requirements?",
        "Is there a penalty for non-compliance?",
        "The Coal Act 1952 section-25 sub-section-4",
        "The Coal Act 1952 section 25 sub-section 4"
      ],
      "responses": [
        "If a medical practitioner fails to comply with the reporting requirements under sub-section (2), they may be punishable with a fine that can extend to fifty rupees."
      ]
    },
    {
      "tag": "mines_safety_section26_subsection1",
      "patterns": [
        "Can the Central Government appoint someone to inquire into cases of diseases related to mining operations?",
        "What is the purpose of appointing a competent person in such cases?",
        "Who are the assessors in this inquiry?",
        "The Coal Act 1952 section-26 sub-section-1",
        "The Coal Act 1952 section 26 sub-section 1"
      ],
      "responses": [
        "Yes, the Central Government can appoint a competent person to inquire into and report on cases where a disease notified under sub-section (1) of section 25 has been or is suspected to have been contracted in a mine. The Central Government may also appoint one or more persons possessing legal or special knowledge to act as assessors in this inquiry."
      ]
    },
    {
      "tag": "mines_safety_section26_subsection2",
      "patterns": [
        "What are the provisions regarding inquiries under this section?",
        "Are there any specific rules for conducting these inquiries?",
        "The Coal Act 1952 section-26 sub-section-2",
        "The Coal Act 1952 section 26 sub-section 2"
      ],
      "responses": [
        "The provisions of sub-sections (2) and (3) of section 24 apply to an inquiry under this section in the same manner as they apply to any inquiry under that section."
      ]
    },
    {
      "tag": "mines_safety_section26_general",
      "patterns": [
        "Tell me more about Section 26 of the Coal Mines Safety Act, 1952.",
        "What happens in cases of diseases related to mining operations?",
        "Who conducts inquiries in such cases?",
        "What does section 26 deal with?",
        "What is section 26 of the coal act of 1952",
        "The Coal Act 1952 section-26",
        "The Coal Act 1952 section 26"
      ],
      "responses": [
        "Section 26 of the Coal Mines Safety Act, 1952 allows the Central Government to appoint a competent person to inquire into cases where diseases related to mining operations have been contracted in a mine or are suspected to have been contracted. The Central Government may also appoint assessors with legal or special knowledge for such inquiries."
      ]
    },
    {
      "tag": "mines_safety_section27",
      "patterns": [
        "What does Section 27 of the Coal Mines Safety Act, 1952 state?",
        "Can you explain Section 27?",
        "What happens with reports submitted by Committees or Courts of inquiry?",
        "The Coal Act 1952 section-27",
        "The Coal Act 1952 section 27"
      ],
      "responses": [
        "Section 27 of the Coal Mines Safety Act, 1952 empowers the Central Government to publish any report submitted by a Committee under section 12, any report or extracts from a report submitted under section 26, and every report submitted by a Court of inquiry under section 24. The Central Government determines the time and manner of publication."
      ]
    },
    {
      "tag": "work_days_regulation_section_28",
      "patterns": [
        "How many days can a person work in a mine in a week?",
        "What's the limit on work days in mines?",
        "Tell me about the regulation for working days in mines.",
        "The Coal Act 1952 section-28",
        "The Coal Act 1952 section 28"
      ],
      "responses": [
        "According to the regulation, no person is allowed to work in a mine for more than six days in any one week."
      ]
    },
    {
      "tag": "sub_section_1_compensatory_rest_days_regulation_section 29",
      "patterns": [
        "What happens if a person is deprived of weekly days of rest in a mine?",
        "Tell me about compensatory days of rest in mines.",
        "How are compensatory days of rest determined in mines?",
        "What's the process for granting compensatory days of rest?",
        "Tell me more about the manner in which compensatory days of rest are allowed.",
        "The Coal Act 1952 section-29 sub-section-1",
        "The Coal Act 1952 section 29 sub section 1"
      ],
      "responses": [
        "If a person is deprived of any of the weekly days of rest due to actions under section 38 or exemptions, they shall be allowed compensatory days of rest within the month they were due or within the two months immediately following that month."
      ]
    },
    {
      "tag": "sub_section_2_compensatory_rest_days_regulation",
      "patterns": [
        "The Coal Act 1952 section-29 sub-section-2",
        "The Coal Act 1952 section 29 sub section 2"
      ],
      "responses": [
        "The Central Government may prescribe the manner in which the compensatory days of rest, as provided in sub-section (1), shall be allowed."
      ]
    },
    {
      "tag": "Coal Mines Act - Section 31 sub-section 1",
      "patterns": [
        "What are the maximum weekly working hours for adults below ground in a mine according to Section 31 sub-section 1?",
        "Explain the maximum daily working hours for adults below ground as per Section 31 sub-section 1.",
        "Tell me about the working hour restrictions in Section 31 sub-section 1 for adults below ground.",
        "What does Section 31 sub-section 1 say about daily and weekly working hours for adults below ground?",
        "What is the daily weekly working hours of an adult in mines?",
        "The Coal Act 1952 section-31 sub-section-1",
        "The Coal Act 1952 section 31 sub section 1"

      ],
      "responses": [
        "Section 31 sub-section 1 of the Coal Mines Act states that no adult employed below ground in a mine shall be allowed to work for more than forty-eight hours in any week or for more than eight hours in any day. However, the daily maximum hours may be exceeded with the Chief Inspector's approval to facilitate shift changes."
      ]
    },
    {
      "tag": "Coal Mines Act - Section 31 sub-section 2",
      "patterns": [
        "Explain the requirement for shifts below ground in a mine according to Section 31 sub-section 2.",
        "What does Section 31 sub-section 2 say about work shifts in mines below ground?",
        "Tell me about the system of shifts required in mines below ground as per Section 31 sub-section 2.",
        "The Coal Act 1952 section-31 sub-section-2",
        "The Coal Act 1952 section 31 sub section 2"
      ],
      "responses": [
        "Section 31 sub-section 2 of the Coal Mines Act mandates that no work shall be carried on below ground in any mine except by a system of shifts. These shifts should be arranged in a way that the period of work for each shift does not spread over more than the daily maximum hours specified in Section 31 sub-section 1."
      ]
    },
    {
      "tag": "Coal Mines Act - Section 31 sub-section 3",
      "patterns": [
        "What restrictions does Section 31 sub-section 3 impose on persons employed below ground in a mine?",
        "Explain the presence restrictions under Section 31 sub-section 3 for persons below ground in mines.",
        "Tell me about the provisions of Section 31 sub-section 3 regarding the presence of employees below ground in mines.",
        "The Coal Act 1952 section-31 sub-section-3",
        "The Coal Act 1952 section 31 sub section 3"
      ],
      "responses": [
        "Section 31 sub-section 3 of the Coal Mines Act states that no person employed in a mine shall be allowed to be present in any part of a mine below ground except during the periods of work specified for them in the register maintained under sub-section (4) of section 48."
      ]
    },
    {
      "tag": "Coal Mines Act - Section 30 Sub-section 1",
      "patterns": [
        "What are the maximum weekly working hours for adults above ground in a mine according to Section 30 Sub-section 1?",
        "Explain the maximum daily working hours for adults above ground as per Section 30 Sub-section 1.",
        "Tell me about the working hour restrictions in Section 30 Sub-section 1 for adults above ground.",
        "What does Section 30 Sub-section 1 say about daily and weekly working hours for adults above ground?",
        "The Coal Act 1952 section-30 sub-section-1",
        "The Coal Act 1952 section 30 sub section 1"
      ],
      "responses": [
        "Section 30 Sub-section 1 of the Coal Mines Act states that no adult employed above ground in a mine shall be required or allowed to work for more than forty-eight hours in any week or for more than nine hours in any day. However, the daily maximum hours may be exceeded with the Chief Inspector's approval to facilitate shift changes."
      ]
    },
    {
      "tag": "Coal Mines Act - Section 30 Sub-section 2",
      "patterns": [
        "Explain the arrangement of work periods and intervals for rest according to Section 30 Sub-section 2.",
        "What does Section 30 Sub-section 2 say about work schedules and rest intervals for adults above ground?",
        "Tell me about the provisions of Section 30 Sub-section 2 regarding work hours and rest intervals for adults above ground.",
        "The Coal Act 1952 section-30 sub-section-2",
        "The Coal Act 1952 section 30 sub section 2"
      ],
      "responses": [
        "Section 30 Sub-section 2 of the Coal Mines Act requires that the periods of work for adults above ground, along with their intervals for rest, should not spread over more than twelve hours in any day. Additionally, they should not work for more than five hours continuously before having an interval for rest of at least half an hour. The Chief Inspector may, for specified reasons and with written approval, permit the spread-over to extend over a period not exceeding fourteen hours in any day."
      ]
    },
    {
      "tag": "Coal Mines Act - Section 30 Sub-section 3",
      "patterns": [
        "What restrictions does Section 30 Sub-section 3 impose on persons working in shifts above ground?",
        "Explain the provisions of Section 30 Sub-section 3 regarding work assignments in shifts above ground.",
        "Tell me about the limitations outlined in Section 30 Sub-section 3 for persons working in shifts above ground.",
        "The Coal Act 1952 section-30 sub-section-3",
        "The Coal Act 1952 section 30 sub section 3"
      ],
      "responses": [
        "Section 30 Sub-section 3 of the Coal Mines Act prohibits persons belonging to two or more shifts above ground from doing work of the same kind at the same time. However, it is important to note that persons are not considered to belong to separate shifts solely based on receiving their intervals for rest at different times."
      ]
    },
    {
      "tag": "Coal Mines Act - Section 32",
      "patterns": [
        "Can you explain Section 32 of the Coal Mines Act?",
        "What are the provisions of Section 32 regarding night shifts in mines?",
        "Tell me about the rules in Section 32 related to shifts that extend beyond midnight.",
        "How does Section 32 of the Coal Mines Act define a weekly day of rest for night shift workers?",
        "The Coal Act 1952 section-32",
        "The Coal Act 1952 section 32"
      ],
      "responses": [
        "Section 32 of the Coal Mines Act deals with night shifts in mines. When a person employed in a mine works on a shift that extends beyond midnight, the following rules apply:\n(a) For the purposes of sections 28 and 29, a weekly day of rest for this person shall mean a period of twenty-four consecutive hours beginning when their shift ends.\n(b) The following day for this person shall be deemed to be the period of twenty-four hours beginning when such shift ends, and the hours worked after midnight shall be counted in the previous day."
      ]
    },
    {
      "tag": "overtime_calculation_section_33_subsection_1",
      "patterns": [
        "How is overtime calculated in mines?",
        "What is the overtime rate for mine workers?",
        "Tell me about overtime wages in mines.",
        "The Coal Act 1952 section-33 sub-section-1",
        "The Coal Act 1952 section 33 sub-section 1"
      ],
      "responses": [
        "In a mine, overtime is calculated based on specific criteria. If a person works above ground for more than nine hours in a day or works below ground for more than eight hours in a day or works for more than forty-eight hours in a week, they are entitled to wages at twice their ordinary rate of wages. The period of overtime work is calculated on a daily or weekly basis, whichever is more favorable to the worker."
      ]
    },
    {
      "tag": "piece_rate_basis_section_33_subsection_2",
      "patterns": [
        "What happens if a mine worker is paid on a piece-rate basis?",
        "Explain the time-rate for mine workers on a piece-rate basis.",
        "How is the ordinary rate of wages determined for piece-rate workers in mines?",
        "The Coal Act 1952 section-33 sub-section-2",
        "The Coal Act 1952 section 33 sub-section 2"
      ],
      "responses": [
        "If a person employed in a mine is paid on a piece-rate basis, the time-rate is determined as the daily average of their full-time earnings for the days they actually worked during the week immediately preceding the week in which overtime work has been done, excluding any overtime. This time-rate is considered their ordinary rate of wages. If they haven't worked on the same job in the preceding week, the time-rate is based on the average for the days they worked in the same week, excluding overtime, or on the daily average of their earnings in any preceding week, whichever is higher."
      ]
    },
    {
      "tag": "registers_in_mines_section_33_subsection_4",
      "patterns": [
        "What registers need to be maintained in mines?",
        "Tell me about the registers required for compliance in mines.",
        "What are the prescribed registers for mine compliance?",
        "The Coal Act 1952 section-33 sub-section-4",
        "The Coal Act 1952 section 33 sub-section 4"
      ],
      "responses": [
        "The Central Government may prescribe the registers to be maintained in a mine for the purpose of ensuring compliance with the provisions of this section. The specific details of these registers may vary and are determined by the government to ensure that mines adhere to the relevant regulations."
      ]
    },
    {
      "tag": "prohibition_of_employment_section_34",
      "patterns": [
        "What is the prohibition of employment in mines?",
        "Can a person work in multiple mines within a short time?",
        "Tell me about restrictions on working in different mines.",
        "Is it allowed to work in two different mines on the same day?",
        "Explain the rule about working in multiple mines.",
        "What are the consequences of working in two mines within twelve hours?",
        "How does the law regulate working in different mines?",
        "Tell me more about the time limit for working in mines.",
        "What happens if someone violates the rule of not working in two mines within twelve hours?",
        "Are there any exceptions to the rule of not working in multiple mines?",
        "The Coal Act 1952 section-34",
        "The Coal Act 1952 section 34"
      ],
      "responses": [
        "According to the regulations, no person shall be required or allowed to work in a mine if they have already been working in any other mine within the preceding twelve hours. This restriction is in place to ensure the safety and well-being of mine workers."
      ]
    },
    {
      "tag": "daily_hours_limit",
      "patterns": [
        "What are the limitations on daily hours of work in mines?",
        "How many hours can a person work in a mine in a day?",
        "Tell me about the maximum working hours in mines.",
        "Is there a restriction on overtime work in mines?",
        "Explain the rule regarding daily hours of work in mines.",
        "The Coal Act 1952 section-35",
        "The Coal Act 1952 section 35"
      ],
      "responses": [
        "According to the regulations, no person employed in a mine shall be required or allowed to work in the mine for more than ten hours in any day, inclusive of overtime. However, there are exceptions mentioned in clause (a) and clause (e) of section 39."
      ]
    },
    {
      "tag": "Section36_SubSection1",
      "patterns": [
        "What does Section 36 Sub-Section 1 of the Coal Mines Act, 1952, require regarding posting notices at mines?",
        "Tell me about the posting of notices in mines as per Section 36 Sub-Section 1 of the Coal Mines Act.",
        "What information should be included in the notice posted outside the mine's office according to Section 36 Sub-Section 1?",
        "What does Section 36(1) of the Coal Mines Safety Act, 1952, state?",
        "Explain the requirements of Section 36(1) regarding posting notices in mines.",
        "Tell me about the notice regarding work hours in mines.",
        "What is the purpose of posting a notice outside the mine office?",
        "Can you describe the contents of the notice mentioned in Section 36(1)?",
        "When should the notice about work hours be posted in a mine?",
        "Is there a specific form in which the notice must be posted?",
        "What does Section 36(1) say about working by a system of relays?",
        "What information should be included in the notice regarding relay work?",
        "Who is responsible for ensuring compliance with Section 36(1)?"
      ],
      "responses": [
        "Section 36 Sub-Section 1 of the Coal Mines Act, 1952, mandates that the manager of every mine must post a notice outside the mine's office in the prescribed form. This notice should specify the time when work at the mine commences and ends. Additionally, if the mine operates using a system of relays, the notice must also include the starting and ending times for each relay."
      ]
    },
    {
      "tag": "Section36_SubSection2",
      "patterns": [
        "What does Section 36 Sub-Section 2 of the Coal Mines Act, 1952, state about posting notices in mines?",
        "Explain the requirements for posting notices in mines as per Section 36 Sub-Section 2 of the Coal Mines Act."
      ],
      "responses": [
        "In the case of a mine at which mining operations commence after the commencement of this Act, Section 36 Sub-Section 2 requires that the notice mentioned in Sub-Section 1 should be posted not less than seven days before the commencement of work."
      ]
    },
    {
      "tag": "Section36_SubSection3",
      "patterns": [
        "What information should be included in the notice posted outside the mine's office according to Section 36 Sub-Section 3 of the Coal Mines Act?",
        "Explain the provisions related to rest intervals in the notice under Section 36 Sub-Section 3."
      ],
      "responses": [
        "Section 36 Sub-Section 3 of the Coal Mines Act, 1952, mandates that the notice posted outside the mine's office, as mentioned in Sub-Section 1, should also state the time of the commencement and of the intervals for rest for persons employed above ground. A copy of this notice should be sent to the Chief Inspector if he requests it."
      ]
    },
    {
      "tag": "Section36_SubSection4",
      "patterns": [
        "What does Section 36 Sub-Section 4 of the Coal Mines Act, 1952, require regarding changes to work schedules?",
        "Explain the provisions for making alterations in work schedules under Section 36 Sub-Section 4."
      ],
      "responses": [
        "Section 36 Sub-Section 4 specifies that if there is a proposal to make any alteration in the time fixed for the commencement or for the end of work in the mine generally, for any relay, or in the rest intervals fixed for persons employed above ground, an amended notice in the prescribed form should be posted outside the mine's office not less than seven days before the change is made. Additionally, a copy of such notice should be sent to the Chief Inspector not less than seven days before the change."
      ]
    },
    {
      "tag": "Section36_SubSection5",
      "patterns": [
        "What does Section 36 Sub-Section 5 of the Coal Mines Act, 1952, state regarding work in mines?",
        "Explain the significance of Section 36 Sub-Section 5 in relation to mine work schedules."
      ],
      "responses": [
        "Section 36 Sub-Section 5 of the Coal Mines Act, 1952, prohibits any person from being allowed to work in a mine unless it is in accordance with the notice required by Sub-Section 1, which specifies the work schedules and timings."
      ]
    },
    {
      "tag": "ExemptionFromCertainSectionsSection37",
      "patterns": [
        "Which sections of the Coal Mines Act, 1952, provide exemptions for persons in supervisory or managerial roles?",
        "Explain the exemptions from certain sections of the Coal Mines Act for individuals in confidential positions.",
        "Who is exempt from compliance with sections 28, 30, 31, 34, and Sub-Section 5 of Section 36 under the Coal Mines Act, 1952?",
        "What does Section 37 of the Coal Mines Act, 1952, state?",
        "Tell me about the exemptions in Section 37 of the Coal Mines Act, 1952.",
        "Who is exempt from compliance with sections 28, 30, 31, 34, and Sub-Section 5 of Section 36 according to Section 37 of the Coal Mines Act, 1952?",
        "Explain the provisions of Section 37 in the Coal Mines Act, 1952.",
        "Which sections of the Coal Mines Act, 1952, do not apply on persons in supervisory or managerial roles?",
        "The Coal Act 1952 section-37",
        "The Coal Act 1952 section 37"
      ],
      "responses": [
        "The Coal Mines Act, 1952, stipulates that sections 28, 30, 31, 34, and Sub-Section 5 of Section 36 shall not apply to individuals who are defined by rules to hold positions of supervision or management or are employed in a confidential capacity."
      ]
    },
    {
      "tag": "EmergencyInMine_section-38",
      "patterns": [
        "What actions can the manager take in case of an emergency in a mine?",
        "Explain the provisions related to emergencies in mines.",
        "When can the manager permit employment in contravention of mine safety rules?",
        "Tell me about emergency situations in mines.",
        "In what circumstances can the manager allow employment contrary to mine safety rules?",
        "How does the manager handle emergencies in a mine?",
        "Are there any exceptions to mine safety rules during emergencies?",
        "Describe the manager's authority in emergency situations in mines.",
        "When might employment be permitted in violation of mine safety regulations?",
        "What are the rules regarding work during emergencies in mines?",
        "The Coal Act 1952 section-38",
        "The Coal Act 1952 section 38"
      ],
      "responses": [
        "In case of an emergency involving serious risk to the safety of the mine or persons employed therein, or in case of an accident, whether actual or apprehended, or in case of any act of God or in case of any urgent work to be done to machinery, plant, or equipment of the mine as a result of breakdown, the manager may permit persons to be employed in contravention of mine safety rules, as necessary to protect the safety of the mine or persons employed therein. This action can be taken subject to the provisions of section 22 and section 22A, and in accordance with the rules under section 39. However, such actions should not exceed the limits necessary to avoid serious interference with the ordinary working of the mine."
      ]
    },
    {
      "tag": "ExemptingRules_section-39",
      "patterns": [
        "What are exempting rules under Section 39 of the Coal Mines Safety Act?",
        "Explain the provisions related to exempting rules in coal mines.",
        "When can persons be exempted from certain mine safety provisions?",
        "Tell me about exemptions in case of emergencies in mines.",
        "What are the circumstances under which exemptions can be granted in coal mines?",
        "Who has the authority to make exempting rules for coal mines?",
        "Describe the conditions for exemptions from mine safety regulations.",
        "Are there any exemptions for preparatory work in coal mines?",
        "Explain the technical reasons for continuous work exemptions in mines.",
        "How are exemptions granted for urgent repairs in coal mines?",
        "The Coal Act 1952 section-39",
        "The Coal Act 1952 section 39"
      ],
      "responses": [
        "The Central Government has the authority to make exempting rules under Section 39 of the Coal Mines Safety Act, 1952. These rules provide for exemptions from the provisions of sections 28, 30, 31, 34, or sub-section (5) of section 36 in specific circumstances. Exemptions can be granted for persons employed in a mine in the case of emergencies, accidents, preparatory work, urgent repairs, and continuous work, subject to specified conditions and circumstances."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool."
      ]
    }
  ]
}
