{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "What's Up?",
        "Namaste",
        "Nomoshkar"
      ],
      "responses": [
        "Hey :)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?",
        "Welcome, how may I help you today?",
        "Namaste, it is my pleasure to be at your service"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for conversing with me",
        "Have a nice day",
        "Bye! Come back again if you have any other queries.",
        "I hope your problem has been solved, have a nice day."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "items",
      "patterns": [
        "Which items do you have?",
        "What is your purpose?",
        "What do you sell?",
        "Who are you?",
        "What are you?"
      ],
      "responses": [
        "I am MineChat, a chatbot whose sole purpose is to clear doubts and queries regarding any law related to the mining industry in India.",
        "I clear doubts regarding mining industry laws in India."
      ]
    },
    {
      "tag": "Minesact1952def",
      "patterns": [
        "What is the Mines Act 1952?",
        "What is the shortened name of The Mines Act 1952?",
        "What is the use of Mines act 1952."
      ],
      "responses": [
        "In Short also known as Mines Act, 1952 is an Act to amend and consolidate the law relating to the regulation of labour and safety in mines."
      ]
    },
    {
      "tag": "extent1952",
      "patterns": [
        "Where is the coal act 1952 applicatble?",
        "What is the extent of Coal act 1952?",
        "is it applicable throughout India?"
      ],
      "responses": [
        "The Mines Act 1952 extends to the whole of India "
      ]
    },
    {
      "tag": "Kashmir1952",
      "patterns": [
        "Is Coal Act 1952 applicable in Jammu and Kashmir?",
        "Where is Coals Act 1952 not applicable?",
        "When was Except Jammu Kashmir word omitted?"
      ],
      "responses": [
        "The words 'except the State of Jammu and Kashmir' omitted by Act 25 of 1968, s. 2 and The Schedule.(w.e.f. 15-8-1968) and currently applicable everywhere in India."
      ]
    },
    {
      "tag": "adult1952",
      "patterns": [
        "Who is an adult?",
        "What is an adult?",
        "What is the criteria for being an adult?",
        "When is someone an adult?"
      ],
      "responses": [
        "'adult' means a person who has completed his eighteenth year.(ref.Coal act 1952 section 2)"
      ]
    },
    {
      "tag": "agent1952",
      "patterns": [
        "Who is refered to as an agent in act 1952?",
        "Who is an agent?",
        "Agent when used in relation to a mine, means every person whether appointed as such or not, who, acting or purporting to act onbehalf of the owner, takes part in the management, control, supervision or direction of the mine or of any part thereof"
      ],
      "responses": [
        "Agent is a person acting on the behalf of the owner, appointed or not is involved in management, control, supervion or direction of mine."
      ]
    },
    {
      "tag": "cheifinspectordef1952",
      "patterns": [
        "Who is cheif inspector of the mines?",
        "Who is cheif inspector"
      ],
      "responses": [
        "Chief Inspector means the Chief Inspector of Mines appointed under this Act by the government."
      ]
    },
    {
      "tag": "daydef1952",
      "patterns": [
        "What is a day?",
        "How long is a day?",
        "Define day",
        "What is considered as day?"
      ],
      "responses": [
        "'day' means a period of twenty-four hours beginning at midnight."
      ]
    },
    {
      "tag": "Districtmagistratedef",
      "patterns": [
        "Who is a district magistrate?",
        "Who performs the dutirs of the district magistrate?",
        "district magistrate"
      ],
      "responses": [
        "'district magistrate' means, in a presidency-town, the person appointed by the Central Government to perform the duties of a district magistrate under this Act in that town"
      ]
    },
    {
      "tag": "employeddef",
      "patterns": [
        "Who is a employee in mines?",
        "Who can be said to be employed in a mine.",
        "How can one be a mine employee?",
        "Define mine employee",
        "Who is a mine employee.",
        "Who is employed in a mine?"
      ],
      "responses": [
        "a person is said to be 'employed' in a mine who works as the manager or who works under appointment by the owner, agent or manager of the mine or with the knowledge of the manager."
      ]
    },
    {
      "tag": "employedcriteria",
      "patterns": [
        "What is the criteria for someone to be employed.",
        "Criteria of employement",
        "in any mining operations(including the concomitant operations of handling and transport of minerals up to the point of despatch and of gathering sand and transport thereof to the mine)",
        "in operations or services relating to the development of the mine",
        "criteria to be employed"
      ],
      "responses": [
        "A person is said to be employed if involved in: \n1. in any mining operation\n2. in operations or services relating to the development of the mine\n3. in operating, servicing, maintaining or repairing any part of any machinery used in or about the mine\n4.in operations, within the premises of the mine, of loading for despatch of minerals\n5. in any office of the mine, health, welfare, sanitary or conservancy or any operation connected to the mines"
      ]
    },
    {
      "tag": "employeeexcluded",
      "patterns": [
        "Who are excluded from being employee or employed?",
        "Who are not considered employed?",
        "When is someone said to be not employed",
        "Not a employee?",
        "When is someone not employed in mining industry.",
        "Who is not employed",
        "Who is not employed in mines"
      ],
      "responses": [
        "People who are not directly connected to the works in mines like builing of roads,wells, construction of houses, etc."
      ]
    },
    {
      "tag": "inspectordef1952",
      "patterns": [
        "Who is an inspector in mining industry?",
        "What is inspector?",
        "Inspector define",
        "Can district magistrate be a inspector?"
      ],
      "responses": [
        "'Inspector' means an Inspector of Mines appointed under this Act, and includes a district magistrate when exercising any power or performing any duty of an Inspector which he is empowered by this Act to exercise or perform."
      ]
    },
    {
      "tag": "Minedef1952",
      "patterns": [
        "What is Mine?",
        "What do you mean by Mines?",
        "Define Mines.",
        "What is a mine"
      ],
      "responses": [
        "Mines means any excavation where any operation for the purpose of searching for or obtaining minerals has been or is being carried on."
      ]
    },
    {
      "tag": "Minescriteria1952",
      "patterns": [
        "What are the criteria of a mine",
        "What are included in mines",
        "Criteria of a mine",
        "Criteria of being a mine."
      ],
      "responses": [
        "Mines include:\n1. all borings, bore holes, oil wells and accessory crude conditioning plants, including the pipe conveying mineral oil within the oilfields\n2. all shafts, in or adjacent to and belonging to a mine, whether in the course of being sunk or not\n3. all levels and inclined planes in the course of being driven\n4. all open cast workings\n5. all conveyors or aerial rope ways provided for the bringing into or removal from a mine of minerals or other articles or for the removal of refuse therefrom.\n6. all adits, levels, planes, machinery, works, railways, tramways and sidings in or adjacent to and belonging to a mine.\n7. all protective works being carried out in or adjacent to a mine\n8. all workshops and stores situated within the precincts of a mine and under the same management and used primarily for the purposes connected with that mine or a number of mines under the same management.\n9.all power stations, transformer sub-stations, convertor stations, rectifier stations and accumulator storage stations for supplying electricity solely or mainly for the purpose of working the mine or a number of mines under the same management.\n10.  any premises for the time being used for depositing sand or other material for use in a mine or for depositing refuse from a mine or in which any operations in connection with such sand, refuse or other material is being carried on, being premises exclusively occupied by the owner of the mine.\n11. any premises in or adjacent to and belonging to a mine."
      ]
    },
    {
      "tag": "officeofmines1952",
      "patterns": [
        "What is office of mines?",
        "What is mines office?",
        "Define office of mines.",
        "Office of mines",
        "Mines office"
      ],
      "responses": [
        "Office of mines means an office at the surface of the mine concerned"
      ]
    },
    {
      "tag": "open_cast_workingdef1952",
      "patterns": [
          "What is open cast working?",
          "Define open cast working.",
          "Tell me about open cast working.",
          "What does open cast working mean?",
          "Explain open cast working.",
          "Give me information about open cast working.",
          "How is open cast working defined?"
      ],
      "responses": [
          "Open cast working refers to a quarry, which is an excavation where operations for searching for or obtaining minerals are carried out. It does not include shafts or excavations that extend below superjacent ground."
      ]
    },
    {
      "tag": "mine_owner_definitiondef1952",
      "patterns": [
          "What is the definition of 'owner' in relation to a mine?",
          "Define 'owner' in the context of a mine.",
          "Who is considered the 'owner' of a mine?",
          "Explain the term 'owner' as it relates to a mine.",
          "Tell me about the definition of 'owner' in mining.",
          "What does the term 'owner' mean for a mine?",
          "Who qualifies as the 'owner' of a mine?",
          "What are the criteria for determining the 'owner' of a mine?",
          "Who is owner of mines?",
          "Define owner of mines."
      ],
      "responses": [
          "In the context of a mine, 'owner' refers to any person who is the immediate proprietor, lessee, or occupier of the mine or any part thereof. This definition also includes a liquidator or receiver if the mine's business is being carried on by them. However, it does not include a person who merely receives a royalty, rent, or fine from the mine, or someone who is merely the proprietor of the mine, subject to any lease, grant, or license for its working, or someone who only owns the soil and has no interest in the minerals of the mine."
      ]
    },
    {
      "tag": "definition_prescribeddef1952",
      "patterns": [
          "What is the meaning of 'prescribed'?",
          "Define 'prescribed' as per regulations.",
          "Can you explain 'prescribed'?",
          "What does 'prescribed' mean in terms of rules and regulations?",
          "Tell me the definition of 'prescribed'."
      ],
      "responses": [
          "'Prescribed' means determined or specified by rules, regulations, or bye-laws, as applicable in a particular context.",
          "In legal terms, 'prescribed' means determined or specified by rules, regulations, or bye-laws, as applicable in a particular context.",
          "The term 'prescribed' refers to what is determined or specified by rules, regulations, or bye-laws, as needed in a given situation."
      ]
    },
    {
      "tag": "qualified_medical_practitioner_definition_def1952",
      "patterns": [
          "What is the definition of a 'qualified medical practitioner'?",
          "Explain the term 'qualified medical practitioner'.",
          "Define 'qualified medical practitioner' according to Indian Medical Council Act, 1956.",
          "Who qualifies as a 'qualified medical practitioner'?",
          "Tell me about the requirements for being a 'qualified medical practitioner'.",
          "What is meant by a 'qualified medical practitioner'?",
          "Give me the definition of a 'qualified medical practitioner'.",
          "Who can be considered a 'qualified medical practitioner'?"
      ],
      "responses": [
          "A 'qualified medical practitioner' refers to a medical practitioner who possesses any recognized medical qualification as defined in clause (h) of section 2 of the Indian Medical Council Act, 1956 (102 of 1956) and who is enrolled on a State medical register as defined in clause (k) of that section.",
          "In the context of the Indian Medical Council Act, 1956, a 'qualified medical practitioner' is someone with a recognized medical qualification as defined in clause (h) of section 2 and is also enrolled on a State medical register as defined in clause (k) of that section.",
          "To be considered a 'qualified medical practitioner,' an individual must hold a recognized medical qualification as specified in clause (h) of section 2 of the Indian Medical Council Act, 1956, and be enrolled on a State medical register as defined in clause (k) of that section.",
          "A 'qualified medical practitioner' in India is a medical practitioner who meets the criteria set out in clause (h) of section 2 of the Indian Medical Council Act, 1956, and is also enrolled on a State medical register as defined in clause (k) of that section.",
          "The term 'qualified medical practitioner' is defined in accordance with the Indian Medical Council Act, 1956, and it includes individuals with recognized medical qualifications mentioned in clause (h) of section 2 who are also registered on a State medical register as defined in clause (k) of that section.",
          "In India, a 'qualified medical practitioner' is someone who holds a recognized medical qualification as specified in clause (h) of section 2 of the Indian Medical Council Act, 1956, and is enrolled on a State medical register as defined in clause (k) of that section.",
          "A 'qualified medical practitioner' under the Indian Medical Council Act, 1956, is a medical practitioner with a recognized medical qualification as per clause (h) of section 2 and who is enrolled on a State medical register as defined in clause (k) of that section.",
          "To be considered a 'qualified medical practitioner' in India, one must possess a recognized medical qualification as defined in clause (h) of section 2 of the Indian Medical Council Act, 1956, and also be enrolled on a State medical register as defined in clause (k) of that section."
      ]
    },
    {
      "tag": "regulations_rules_bye-laws_definition_def1952",
      "patterns": [
          "What do 'regulations' mean under this Act?",
          "Explain the term 'rules' as per this Act.",
          "Define 'bye-laws' under this Act.",
          "What is the definition of 'regulations' in this context?",
          "Tell me about 'rules' and 'bye-laws' under this Act.",
          "What are 'rules' and 'regulations?"
      ],
      "responses": [
          "'Regulations,' 'rules,' and 'bye-laws' refer to regulations, rules, and bye-laws made under this Act, respectively.",
          "In the context of this Act, 'regulations' mean regulations made under this Act. 'Rules' refer to rules made under this Act, and 'bye-laws' are bye-laws made under this Act.",
          "Under this Act, 'regulations' are regulations made pursuant to this Act, 'rules' are rules made under this Act, and 'bye-laws' are bye-laws made under this Act.",
          "In this Act, 'regulations' are regulations made in accordance with this Act, 'rules' are rules made under this Act, and 'bye-laws' are bye-laws made under this Act.",
          "'Regulations,' 'rules,' and 'bye-laws' in this context all pertain to the respective documents and rules established under this Act."
      ]
    },
    {
      "tag": "relay_and_shift_definition_def1952",
      "patterns": [
          "What is a 'relay' in this context?",
          "Define 'relay' as mentioned here.",
          "What is meant by 'shift' in this context?",
          "Explain 'relay' and 'shift' as per this description.",
          "Tell me about 'relay' and 'shift' in this context.",
          "How are 'relay' and 'shift' defined here?",
          "What is relay?",
          "What is Shift?",
          "What is relay and shift?"
      ],
      "responses": [
          "In this context, where work of the same kind is carried out by two or more sets of persons working during different periods of the day, each of these sets is called a 'relay.' Additionally, each of these periods is referred to as a 'shift.'",
          "A 'relay' in this context is used to describe each set of persons who carry out work of the same kind during different periods of the day. Meanwhile, each of these periods is termed a 'shift.'",
          "'Relay' in this context refers to a set of persons who perform similar work during different time periods of the day. 'Shift' denotes each of these time periods in which work is carried out by different sets of persons.",
          "In the given context, 'relay' represents a group of individuals performing similar work at different times of the day. 'Shift' is the term used for each of these time periods during which work is conducted by distinct sets of individuals.",
          "As per this description, 'relay' is used to describe each group of individuals conducting similar work during different periods of the day, while 'shift' is the term used to denote these individual time periods."
      ]
    },
    {
      "tag": "reportable_injury_definition_def1952",
      "patterns": [
          "What does 'reportable injury' mean?",
          "Define 'reportable injury' as per this description.",
          "Explain the term 'reportable injury'.",
          "What is meant by a 'reportable injury' here?",
          "Tell me about the definition of 'reportable injury'.",
          "How is a 'reportable injury' defined in this context?",
          "What qualifies as a 'reportable injury' in this description?",
          "What is reportable injury?"
      ],
      "responses": [
          "'Reportable injury' in this context refers to any injury, other than a serious bodily injury, which involves, or is highly likely to involve, the enforced absence of the injured person from work for a period of seventy-two hours or more.",
          "As per this description, a 'reportable injury' is an injury, excluding serious bodily injuries, that results in or is likely to result in the injured person being unable to work for a period of seventy-two hours or longer.",
          "In this context, 'reportable injury' means any injury, except for a serious bodily injury, that will result in or is likely to result in the injured person's absence from work for a duration of seventy-two hours or more."
      ]
    },
    {
      "tag": "serious_bodily_injury_definition_def1952",
      "patterns": [
          "What is the definition of 'serious bodily injury'?",
          "Define 'serious bodily injury' according to this description.",
          "Explain the term 'serious bodily injury'.",
          "What constitutes a 'serious bodily injury' here?",
          "Tell me about the definition of 'serious bodily injury'.",
          "How is 'serious bodily injury' defined in this context?",
          "What qualifies as a 'serious bodily injury' based on this definition?"
      ],
      "responses": [
          "'Serious bodily injury' in this context refers to any injury that involves, or is highly likely to involve, the permanent loss of any part or section of a body, the permanent loss of or injury to the sight or hearing, any permanent physical incapacity, or the fracture of any bone or one or more joints or bones of any phalanges of the hand or foot.",
          "As per this description, a 'serious bodily injury' is an injury that results in or is highly likely to result in the permanent loss of any part or section of a body, the permanent loss of or injury to sight or hearing, any permanent physical incapacity, or the fracture of any bone or one or more joints or bones of any phalanges of the hand or foot.",
          "In this context, 'serious bodily injury' means any injury that leads to, or is highly likely to lead to, the permanent loss of any part or section of a body, permanent loss of or injury to sight or hearing, permanent physical incapacity, or the fracture of any bone or one or more joints or bones of any phalanges of the hand or foot."
      ]
    },
    {
      "tag": "week_definition_def1952",
      "patterns": [
          "What is the definition of a 'week'?",
          "Define 'week' as per this description.",
          "Explain the term 'week'.",
          "What does 'week' mean?",
          "Tell me about the definition of a 'week'.",
          "What is week?",
          "Define week."
      ],
      "responses": [
          "In this context, a 'week' is defined as a period of seven days beginning at midnight on Saturday night. However, it may also begin on another night if approved in writing for a particular area by the Chief Inspector or an Inspector.",
          "As per this description, a 'week' is a period of seven days that starts at midnight on Saturday night. It can also start on another night if it has been approved in writing for a specific area by the Chief Inspector or an Inspector."
      ]
    },
    {
      "tag": "working_below_ground_def1952",
      "patterns": [
          "What is the definition of 'working below ground' in a mine?",
          "Define 'working below ground' in the context of mining.",
          "Explain the term 'below ground' for mine workers.",
          "How is 'working below ground' defined for mine employees?",
          "Tell me about the criteria for 'working below ground' in mining.",
          "When can an employee be considered working below ground?",
          "What is working below ground?",
          "What does Working below ground mean?"
      ],
      "responses": [
          "In the context of mining, a person is considered to be 'working below ground' if they are working or employed in a shaft that has been or is being sunk, or if they are working in any excavation that extends below superjacent ground."
      ]
    },
    {
      "tag": "working_above_ground_def1952",
      "patterns": [
          "What is the definition of 'working above ground' in a mine?",
          "Define 'working above ground' in the context of mining.",
          "Explain the term 'above ground' for mine workers.",
          "How is 'working above ground' defined for mine employees?",
          "Tell me about the criteria for 'working above ground' in mining.",
          "When can an employee be considered working above ground?",
          "What is working above ground?",
          "What does Working above ground mean?",
          "what do you mean by working above ground?"
      ],
      "responses": [
          "In the context of mining, a person is considered to be 'working above ground' if they are working in an open cast working or in any other manner not specified in the definition of 'working below ground' as described previously."
      ]
    },
    {
      "tag": "act_not_applying_certain_cases_1952",
      "patterns": [
          "Which provisions of the Coal Act 1952 do not apply in certain cases?",
          "Can you explain when the Coal Act 1952 does not apply?",
          "When does The Coal Act 1952 not apply?",
          "Tell me about the exceptions to the application of The Coal Act 1952.",
          "What are the conditions under which The Coal Act 1952 does not apply?",
          "Explain the cases in which The Coal Act 1952 does not apply.",
          "Under what circumstances does the Coal Act 1952 not apply?",
          "When are the provisions of The Coal Act 1952 exempted?",
          "When is The Coal Act 1952 not applicable?"
      ],
      "responses": [
          "The provisions of this Act, except those contained in sections 7, 8, 9, 40, 45, and 46, do not apply to: (a) any mine or part thereof used for prospecting purposes only, not for obtaining minerals for use or sale, and (b) any mine engaged in the extraction of specific materials as mentioned in the Act.",
          "In certain cases, this Act excludes certain provisions, namely sections 7, 8, 9, 40, 45, and 46. These cases include (a) mines used solely for prospecting and (b) mines extracting specific materials as defined in the Act.",
          "This Act does not apply under specific circumstances, excluding sections 7, 8, 9, 40, 45, and 46. These circumstances involve (a) mines exclusively for prospecting and (b) mines engaged in the extraction of specific materials as outlined in the Act.",
          "Exceptions to the application of this Act, excluding sections 7, 8, 9, 40, 45, and 46, occur in cases involving (a) mines used solely for prospecting and (b) mines extracting specific materials, provided that specific conditions are met.",
          "Under certain circumstances, specified provisions of this Act do not apply, except for sections 7, 8, 9, 40, 45, and 46. These circumstances encompass (a) mines engaged in prospecting only and (b) mines extracting particular materials, subject to conditions.",
          "This Act exempts certain cases from its provisions, excluding sections 7, 8, 9, 40, 45, and 46. These cases include (a) mines exclusively for prospecting and (b) mines involved in the extraction of specific materials, provided specific conditions are satisfied.",
          "Exceptions to the application of this Act, excluding sections 7, 8, 9, 40, 45, and 46, occur when (a) mines are used solely for prospecting and (b) mines are engaged in extracting specific materials, subject to specific conditions.",
          "In certain instances, this Act does not apply, with the exception of sections 7, 8, 9, 40, 45, and 46. These instances involve (a) mines used exclusively for prospecting and (b) mines extracting particular materials, provided specific conditions are met."
      ]
    },
    {
      "tag": "coal_act_time_references_def_1952",
      "patterns": [
          "What does the Coal Act of 1952 mean by references to time of day?",
          "Define the references to time of day in the Coal Act of 1952.",
          "Explain the term 'Indian standard time' in the context of the Coal Act of 1952.",
          "How are references to time of day defined in the Coal Act of 1952?",
          "Tell me about the time references in the Coal Act of 1952.",
          "When the Coal Act of 1952 mentions time of day, what does it refer to?",
          "What is the significance of Indian standard time in the Coal Act of 1952?",
          "Can you clarify the references to time of day in the Coal Act of 1952?",
          "What is time of day in the Coal Act of 1952"
      ],
      "responses": [
          "In the Coal Act of 1952, references to time of day specifically refer to Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "As per the Coal Act of 1952, when it mentions time of day, it is indicating Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "The Coal Act of 1952 defines references to time of day as Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "References to time of day in the Coal Act of 1952 are based on Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "When the Coal Act of 1952 mentions time of day, it is making reference to Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "Indian standard time, being five and a half hours ahead of Greenwich mean time, is what is meant by references to time of day in the Coal Act of 1952.",
          "In the Coal Act of 1952, any mentions of time of day are in relation to Indian standard time, which is five and a half hours ahead of Greenwich mean time.",
          "The references to time of day in the Coal Act of 1952 specifically pertain to Indian standard time, which is five and a half hours ahead of Greenwich mean time."
      ]
    },
    {
      "tag": "indian_standard_time_rules_1952",
      "patterns": [
          "What does the provision say about Indian standard time?",
          "Explain the rules related to Indian standard time.",
          "Can you clarify the Indian standard time rules?",
          "Tell me about the Central Government's authority regarding Indian standard time.",
          "How does the Central Government handle Indian standard time in certain areas?",
          "What are the provisions for areas where Indian standard time is not observed?",
          "Explain the conditions under which Indian standard time rules may be applied.",
          "What are the requirements for applying local mean time in certain areas?",
          "When can the Central Government make rules regarding Indian standard time?",
          "Can you provide details about the Central Government's authority to make rules for Indian standard time?"
      ],
      "responses": [
          "According to the provision, the Central Government has the authority to make rules regarding Indian standard time. These rules can specify areas, define local mean time, and permit the observation of local mean time in mines situated in those areas.",
          "The provision allows the Central Government to create rules for Indian standard time. These rules can identify specific areas, define local mean time, and allow mines in those areas to observe local mean time.",
          "The rules related to Indian standard time, as per this provision, grant authority to the Central Government. They enable the Central Government to specify areas, define local mean time, and permit its observation in mines within those areas.",
          "The Central Government has the power to regulate Indian standard time through rules. These rules can include specifying areas, defining local mean time, and allowing mines to use local mean time in those areas.",
          "In cases where Indian standard time is not ordinarily observed, the Central Government can make rules. These rules specify the area, define the local mean time typically observed there, and permit the use of local mean time in mines within that area.",
          "The provision outlines that the Central Government can establish rules for Indian standard time. These rules specify the area, define the local mean time usually observed, and allow the use of local mean time in mines within the specified area.",
          "Rules concerning Indian standard time can be established by the Central Government. These rules identify the area, define the local mean time usually observed, and authorize the use of local mean time in mines within that area.",
          "The Central Government's authority includes the ability to create rules for Indian standard time. These rules specify the area, define local mean time, and permit its use in mines within that area.",
          "For areas where Indian standard time is not typically observed, the Central Government may create rules. These rules include specifying the area, defining local mean time, and allowing the use of local mean time in mines within that area.",
          "The Central Government's authority encompasses the creation of rules for Indian standard time. These rules specify areas, define local mean time, and authorize its use in mines within those areas."
      ]
    },
    {
      "tag": "coal_act_inspector_appointment_1952",
      "patterns": [
          "How are inspectors appointed under the Coal Act of 1952?",
          "Can you explain the process of appointing inspectors in the Coal Act of 1952?",
          "Tell me about the appointment of Chief Inspector of Mines under the Coal Act of 1952.",
          "What qualifications are required for the appointment of inspectors under the Coal Act of 1952?",
          "Who has the authority to appoint inspectors of mines as per the Coal Act of 1952?",
          "Explain the role of the Central Government in appointing inspectors under the Coal Act of 1952.",
          "What is the procedure for appointing Chief Inspector of Mines under the Coal Act of 1952?",
          "Who can be appointed as Chief Inspector of Mines under the Coal Act of 1952?",
          "What are the prescribed qualifications for Inspectors of Mines under the Coal Act of 1952?",
          "Can you clarify the appointment process for inspectors under the Coal Act of 1952?",
          "How is an inspectors appointed?",
          "Appointment of inspectors of mines."
      ],
      "responses": [
          "Under the Coal Act of 1952, the Central Government has the authority to appoint a person with prescribed qualifications as the Chief Inspector of Mines for all territories to which the Act extends. Additionally, individuals with the prescribed qualifications can be appointed as Inspectors of Mines subordinate to the Chief Inspector.",
          "Inspectors under the Coal Act of 1952 are appointed through a process overseen by the Central Government. The Chief Inspector of Mines and subordinate Inspectors of Mines are appointed based on their possession of prescribed qualifications as specified in the Act.",
          "As per the Coal Act of 1952, the Central Government appoints the Chief Inspector of Mines for all territories covered by the Act. Inspectors of Mines, who possess the prescribed qualifications, can also be appointed by the Central Government and serve under the Chief Inspector.",
          "To be appointed as Chief Inspector of Mines or an Inspector of Mines under the Coal Act of 1952, individuals must possess specific qualifications as prescribed by the Act and the Central Government.",
          "Inspectors of Mines, including the Chief Inspector, are appointed by the Central Government as specified in the Coal Act of 1952. The appointment is based on the individuals' possession of qualifications outlined in the Act and regulations.",
          "The Central Government is responsible for appointing inspectors under the Coal Act of 1952. Qualifications as specified in the Act and regulations are necessary for appointment.",
          "The appointment process for Chief Inspector of Mines under the Coal Act of 1952 is conducted by the Central Government. Individuals eligible for this role must meet the prescribed qualifications.",
          "For the position of Chief Inspector of Mines under the Coal Act of 1952, individuals with prescribed qualifications are appointed by the Central Government. Similarly, the appointment of subordinate Inspectors of Mines follows the same criteria.",
          "Inspectors of Mines, including the Chief Inspector, are appointed by the Central Government under the Coal Act of 1952. Qualifications outlined in the Act must be met for appointment.",
          "The process of appointing inspectors under the Coal Act of 1952 involves the Central Government appointing a Chief Inspector of Mines with prescribed qualifications and appointing Inspectors of Mines with the same qualifications to serve under the Chief Inspector."
      ]
    },
    {
      "tag": "chief_inspector_restrictions_1952",
      "patterns": [
          "What are the eligibility criteria for Chief Inspector and Inspectors in mining?",
          "Explain the appointment restrictions for Chief Inspector and Inspectors in mining.",
          "Tell me about the qualifications required for Chief Inspector and Inspectors in mining.",
          "Can you clarify the conditions for appointing Chief Inspector and Inspectors in mining?",
          "Who is eligible for the positions of Chief Inspector and Inspectors in mining?",
          "What are the rules regarding direct or indirect interests in mines for Chief Inspector and Inspectors in mining?",
          "How does one become eligible for the role of Chief Inspector or Inspectors in mining?",
          "Are there any restrictions on holding the office of Chief Inspector or Inspectors in mining?",
          "How is someone eligible to be Cheif Inspector or Inspector of a mine?",
          "Who are eligible to be Cheif Inspector or Inspector of a mine?"
      ],
      "responses": [
          "Chief Inspector and Inspectors in mining must meet strict eligibility criteria. No person can be appointed or continue to hold such office if they have, or subsequently acquire, any direct or indirect interests in any mine or mining rights in India.",
          "The appointment of Chief Inspector and Inspectors in mining is subject to clear eligibility criteria. Individuals cannot have any direct or indirect interests in any mine or mining rights in India, both during the appointment process and while holding the office.",
          "To be eligible for the positions of Chief Inspector or Inspectors in mining, individuals must not have, either at the time of appointment or during their tenure, any direct or indirect interests in any mine or mining rights in India. This restriction is in place to ensure impartiality and prevent conflicts of interest.",
          "The eligibility criteria for Chief Inspector and Inspectors in mining are straightforward: individuals cannot have any direct or indirect interests in any mine or mining rights in India. This rule applies both during the appointment process and their tenure.",
          "Individuals who wish to become Chief Inspector or Inspectors in mining must meet specific qualifications and adhere to the regulation that prohibits any direct or indirect interests in any mine or mining rights in India.",
          "Chief Inspector and Inspectors in mining are subject to strict eligibility rules. These rules prevent individuals from having any direct or indirect interests in any mine or mining rights in India, both at the time of appointment and during their tenure.",
          "The appointment of Chief Inspector and Inspectors in mining is contingent on meeting certain qualifications and abiding by the rule that prohibits any direct or indirect interests in any mine or mining rights in India.",
          "Eligibility for the positions of Chief Inspector or Inspectors in mining is governed by a key rule: individuals cannot have any direct or indirect interests in any mine or mining rights in India. This rule applies throughout the appointment process and their time in office."
      ]
    },
    {
      "tag": "district_magistrate_powers_long_1952",
      "patterns": [
          "What are the powers of the district magistrate in relation to mining?",
          "Can you explain the role of the district magistrate as an Inspector in mining?",
          "Tell me about the duties and powers of the district magistrate in mining.",
          "How does the district magistrate exercise powers in mining?",
          "What is the authority of the district magistrate as an Inspector?",
          "Explain the role of the Central Government in overseeing the district magistrate's powers as an Inspector.",
          "Under what circumstances can the district magistrate perform the duties of an Inspector?",
          "Are there any limitations on the district magistrate's powers as an Inspector?"
      ],
      "responses": [
          "The district magistrate has the authority to exercise the powers and perform the duties of an Inspector in mining, subject to the general or special orders of the Central Government.",
          "In relation to mining, the district magistrate can act as an Inspector and has specific powers and duties. However, these powers are exercised under the general or special orders of the Central Government.",
          "The district magistrate plays a role as an Inspector in mining activities, with powers and duties defined by the Central Government. These powers are subject to general or special orders issued by the Central Government.",
          "The district magistrate's powers and duties as an Inspector in mining are granted under the authority of the Central Government. These powers can be exercised subject to general or special orders issued by the Central Government.",
          "As an Inspector in mining, the district magistrate holds certain powers and duties. These powers are exercised under the oversight of the Central Government, and any actions are subject to general or special orders.",
          "The Central Government has a role in overseeing the powers of the district magistrate when acting as an Inspector in mining. The district magistrate's actions are subject to general or special orders issued by the Central Government.",
          "The district magistrate can perform the duties of an Inspector in mining, but the exercise of these powers is subject to the general or special orders of the Central Government.",
          "While the district magistrate has powers as an Inspector in mining, these powers are not unlimited and are subject to the general or special orders of the Central Government."
      ]
    },
    {
      "tag": "district_magistrate_powers_sm_1952",
      "patterns": [
          "District magistrate powers in mining?",
          "Explain district magistrate's role as Inspector in mining.",
          "District magistrate's duties in mining?",
          "Central Government orders for district magistrate as Inspector?",
          "Limitations on district magistrate's Inspector powers?"
      ],
      "responses": [
          "District magistrates can act as Inspectors in mining with powers and duties as per Central Government orders.",
          "District magistrates serve as Inspectors in mining, following Central Government orders.",
          "District magistrates, as Inspectors in mining, have specific duties and powers under Central Government orders.",
          "District magistrates' Inspector powers in mining are subject to Central Government orders.",
          "District magistrate's powers as Inspector are defined by Central Government orders."
      ]
    },
    {
      "tag": "chief_inspector_public_servant_1952",
      "patterns": [
          "Who are considered public servants under the The Coal act 1952?",
          "Tell me about the legal status of the Chief Inspector and Inspectors.",
          "Are Chief Inspectors and Inspectors considered public servants?",
          "What is the definition of a public servant according to the Indian Penal Code?",
          "Explain the status of the Chief Inspector and Inspectors under the law.",
          "Do the Chief Inspector and Inspectors have the legal status of public servants?",
          "Are Chief Inspectors and Inspectors subject to the Indian Penal Code?",
          "Are Cheif Inspectors and Inspectors considered public servant?"
      ],
      "responses": [
          "The Chief Inspector and all Inspectors are considered public servants within the meaning of the Indian Penal Code.",
          "In accordance with the law, both the Chief Inspector and Inspectors hold the status of public servants as defined by the Indian Penal Code.",
          "Yes, the Chief Inspector and all Inspectors fall under the category of public servants under the Indian Penal Code.",
          "The Indian Penal Code recognizes the Chief Inspector and Inspectors as public servants.",
          "The legal status of the Chief Inspector and Inspectors is that they are deemed public servants under the Indian Penal Code.",
          "Under the law, the Chief Inspector and Inspectors are considered public servants as per the Indian Penal Code.",
          "Yes, the Chief Inspector and Inspectors are subject to the Indian Penal Code, and they hold the legal status of public servants.",
          "Being deemed a public servant under the Indian Penal Code carries certain legal implications and responsibilities."
      ]
    },
    {
      "tag": "chief_inspector_authorization_func_1952",
      "patterns": [
        "How can Chief Inspector grant powers to Inspectors?",
        "Tell me about Chief Inspector's authority to authorize Inspector powers.",
        "What are the conditions for Chief Inspector's authorization of powers?",
        "Who can Chief Inspector authorize to exercise powers?",
        "Explain the role of Central Government in Chief Inspector's authorizations.",
        "Can Chief Inspector specify restrictions when authorizing powers?",
        "What is the purpose of Chief Inspector's written orders for authorizing powers?",
        "Why are some powers excluded from Chief Inspector's authorization?",
        "Give examples of powers that Chief Inspector can delegate.",
        "How does Chief Inspector seek Central Government approval for authorizing powers?",
        "What is the significance of Inspector powers under this Act?",
        "What happens if Chief Inspector authorizes powers without approval?",
        "Are there any limitations to Chief Inspector's authorizations?",
        "Can Chief Inspector's authorization impede mining operations?",
        "Who ensures compliance with Chief Inspector's authorizations?",
        "What happens if someone refuses to comply with authorized Inspector powers?",
        "What is the legal basis for Chief Inspector's authorizations?",
        "Can Chief Inspector's authorizations be challenged or appealed?",
        "What safeguards exist to prevent misuse of Chief Inspector's authorizations?",
        "How often can Chief Inspector issue written orders for authorizing powers?",
        "Give examples of restrictions or conditions Chief Inspector may impose."
      ],
      "responses": [
        "The Chief Inspector, with Central Government approval, can issue written orders to authorize specific Inspectors or classes to exercise certain powers, excluding appeals.",
        "Chief Inspector can delegate various powers to Inspectors as specified in the written orders.",
        "Chief Inspector's authorization is subject to specific conditions and restrictions imposed as deemed fit.",
        "Chief Inspector can authorize named Inspectors or specified classes to exercise powers.",
        "Central Government plays a crucial role in approving Chief Inspector's authorizations.",
        "Yes, Chief Inspector can specify suitable restrictions or conditions when authorizing powers.",
        "Chief Inspector's written orders for authorizing powers ensure clarity and compliance with the specified powers.",
        "Some powers, such as those related to appeals, are excluded from Chief Inspector's authorizations.",
        "Examples of delegated powers include inspection, examination, and inquiry powers.",
        "Chief Inspector follows established procedures and submits necessary documentation to seek Central Government approval.",
        "Inspector powers are essential for enforcing and maintaining compliance with this Act.",
        "Unauthorized authorizations by Chief Inspector may have legal implications.",
        "There are limitations and legal checks on Chief Inspector's authorizations.",
        "Chief Inspector ensures that authorizations do not unreasonably impede mining operations.",
        "Compliance with Chief Inspector's authorizations is the responsibility of mine operators and workers.",
        "Refusal to comply with authorized Inspector powers can lead to legal consequences.",
        "Chief Inspector's authorizations are based on the provisions of this Act and relevant regulations.",
        "Certain aspects of Chief Inspector's authorizations may be subject to challenge or appeal.",
        "Safeguards are in place to prevent misuse of Chief Inspector's authorizations.",
        "Chief Inspector can issue written orders for authorizing powers as needed, following due process.",
        "Examples of restrictions or conditions may include time limitations, reporting requirements, or safety measures."
      ]
    },
    {
      "tag": "chief_inspector_restrict_powers_1952",
      "patterns": [
          "What authority does the Chief Inspector have to restrict powers of other Inspectors?",
          "Explain how the Chief Inspector can prohibit or restrict the exercise of powers by other Inspectors.",
          "Tell me about the process of Chief Inspector restricting powers of specified Inspectors.",
          "Can the Chief Inspector prohibit specific powers for named Inspectors or classes of Inspectors?",
          "What are the conditions or restrictions the Chief Inspector can impose when restricting powers of other Inspectors?",
          "How does the Chief Inspector issue orders to restrict powers of Inspectors?",
          "What powers can the Chief Inspector prohibit or restrict?",
          "What is the role of the Central Government in Chief Inspector's orders to restrict powers?"
      ],
      "responses": [
          "The Chief Inspector has the authority to issue written orders prohibiting or restricting the exercise of powers conferred on Inspectors under this Act for specific Inspectors or classes of Inspectors.",
          "Chief Inspector can prohibit or restrict the exercise of powers by other Inspectors through written orders, specifying the conditions and restrictions, if any.",
          "The process involves the Chief Inspector issuing written orders to prohibit or restrict the exercise of powers for named Inspectors or specified classes of Inspectors.",
          "Yes, the Chief Inspector can prohibit specific powers for either named Inspectors or specified classes of Inspectors, as mentioned in the written order.",
          "When restricting powers of other Inspectors, the Chief Inspector can impose suitable conditions or restrictions to ensure compliance.",
          "The Chief Inspector issues orders in writing to restrict the exercise of powers, providing clarity and specificity on the restrictions.",
          "The Chief Inspector can prohibit or restrict various powers conferred on Inspectors under this Act, as per the written order.",
          "The Central Government plays a role in overseeing the Chief Inspector's orders to restrict powers, ensuring alignment with established procedures and guidelines."
      ]
    },
    {
      "tag": "chief_inspector_area_declaration_1952",
      "patterns": [
          "What is the role of the Chief Inspector in declaring local areas for Inspector powers?",
          "Explain how the Chief Inspector designates areas for the exercise of Inspector powers.",
          "Tell me about the process of Chief Inspector declaring local areas for Inspector powers.",
          "Can the Chief Inspector specify the group or class of mines where Inspectors exercise powers?",
          "What provisions govern the Chief Inspector's declaration of areas for Inspector powers?",
          "How does the Chief Inspector issue orders for declaring areas for Inspector powers?",
          "What factors influence the Chief Inspector's decisions on area declaration?",
          "What is the significance of the Chief Inspector's role in designating areas for Inspector powers?",
          "How does the Chief Inspector declare areas for Inspector powers?",
          "What governs the Chief Inspector's area declarations?",
          "Can Chief Inspector specify mines for Inspector powers?",
          "Explain Chief Inspector's role in area designation.",
          "Explain the role of cheif inspector in area designation."
      ],
      "responses": [
          "The Chief Inspector has the responsibility to declare local areas or groups/classes of mines where Inspectors can exercise their respective powers, subject to other provisions in this section.",
          "Chief Inspector designates areas for the exercise of Inspector powers through a defined process and written orders.",
          "The process involves the Chief Inspector issuing written orders to specify local areas or groups/classes of mines where Inspectors exercise powers.",
          "Yes, the Chief Inspector can specify the group or class of mines with respect to which Inspectors exercise their powers.",
          "The Chief Inspector's area declaration is subject to the provisions outlined in this section, ensuring compliance with established rules.",
          "Chief Inspector issues orders in writing to declare areas for Inspector powers, ensuring clarity and specificity in the designation.",
          "Various factors, including safety, workload, and operational requirements, influence the Chief Inspector's decisions on area declaration.",
          "The Chief Inspector's role in designating areas for Inspector powers is essential for effective oversight and regulation of mining activities."
      ]
    },
    {
      "tag": "function_of_inspector_1952",
      "patterns": [
        "What is the function of an inspector?",
        "Can you specify the function of an inspector",
        "What does an inspector do?",
        "Explain the functions of a inspector?"
      ],
      "responses": [
        "Chief Inspector's Functions:\n1. Authorization of Powers: The Chief Inspector can authorize specific Inspectors or classes of Inspectors to exercise certain powers, excluding appeals, with Central Government approval and conditions as deemed fit.\n2.Prohibition or Restriction: The Chief Inspector can issue written orders to prohibit or restrict specific powers for named Inspectors or specified classes of Inspectors.\n3. Area Declaration: The Chief Inspector designates the local areas or groups/classes of mines where Inspectors can exercise their respective powers, following established rules."
      ]
    },
    {
      "tag": "inspector_powers",
      "patterns": [
          "What powers do Chief Inspectors and Inspectors have under this Act?",
          "Explain the roles of Chief Inspectors and Inspectors in mine inspections.",
          "Can Chief Inspectors and Inspectors enter and inspect mines at any time?",
          "What is the purpose of examining the state and condition of mines by Inspectors?",
          "What powers can Chief Inspectors and Inspectors exercise as per regulations?",
          "Are individuals compelled to answer questions during inspections?",
          "When can Chief Inspectors and Inspectors search places and take possession of materials or records?",
          "How do the provisions of the Code of Criminal Procedure apply to searches or seizures under this Act?"
      ],
      "responses": [
          "Chief Inspectors and Inspectors have various powers, including making examinations, inquiries, inspections, and inquiries to ensure compliance with the Act, regulations, rules, and bye-laws.",
          "They can enter, inspect, and examine mines, ensuring not to unreasonably impede or obstruct mining operations.",
          "Inspectors examine the state, ventilation, and safety of mines and take necessary statements to ensure the health and safety of mine workers.",
          "They can exercise additional powers as prescribed by regulations made by the Central Government.",
          "No person can be compelled to incriminate themselves during inspections.",
          "If an offence is suspected, Chief Inspectors and Inspectors can search places and seize relevant materials or records, subject to applicable legal procedures.",
          "The provisions of the Code of Criminal Procedure apply to searches and seizures under this Act as they do to warrant-based searches."
      ]
    },
    {
      "tag": "government_person_authorization_1952_sec8",
      "patterns": [
          "Who can enter a mine for surveying, leveling, or measuring purposes?",
          "What authorization is required to enter a mine for surveying?",
          "Explain the authority of Government personnel to enter a mine.",
          "What notice period is required before entering a mine for surveying?",
          "Can mine entry for surveying be done at any time?",
          "What is the purpose of surveying, leveling, or measuring a mine?",
          "What is the role of the Chief Inspector or Inspector in authorizing mine entry?",
          "What happens in case of an emergency in a mine?",
          "Is notice required when entering a mine in an emergency?",
          "How can Government personnel obtain authorization for mine entry?",
          "What are the conditions for Government personnel to enter a mine?",
          "What are the responsibilities of the mine manager in this context?",
          "What is the scope of surveying, leveling, or measuring in a mine?",
          "What are the rights of Government personnel while inside a mine?",
          "Are there any restrictions on mine entry for surveying?",
          "Can surveying, leveling, or measuring be done at night?",
          "What safeguards are in place for mine entry in emergencies?",
          "How does this provision ensure safety in mining operations?",
          "Are there any legal consequences for unauthorized mine entry?",
          "What is the process for obtaining special authorization in an emergency?",
          "Who can enter a mine for surveying",
          "Who can enter a mine for leveling",
          "Who can enter a mine for measuring",
          "who can enter mines?",
          "The Coal Act 1952 section-8"
      ],
      "responses": [
          "Any person in the service of the Government, duly authorized by written order of the Chief Inspector or an Inspector, may enter a mine for surveying, leveling, or measuring purposes.",
          "The authorization is granted through a special written order by the Chief Inspector or an Inspector.",
          "Government personnel have the authority to enter a mine after giving at least three days' notice to the mine manager.",
          "Mine entry for surveying can occur at any time, whether during the day or night.",
          "Surveying, leveling, or measuring is conducted to gather data and information about the mine's layout and conditions.",
          "The Chief Inspector or an Inspector plays a key role in authorizing and regulating mine entry for surveying purposes."
      ]
    },
    {
      "tag": "facilities_for_entry_inspection",
      "patterns": [
          "What are the obligations of mine owners, agents, and managers?",
          "Who should provide reasonable facilities for entry, inspection, and inquiry?",
          "Who has the authority to authorize entry under section 8?",
          "Why is it important to provide reasonable facilities for entry and inspection?",
          "Are there any exceptions to providing facilities for entry and inspection?",
          "What kind of facilities should be provided for inspection and inquiry?",
          "How does this provision ensure safety in mining operations?",
          "What rights do Chief Inspectors and Inspectors have during inspections?",
          "What are the consequences of non-compliance with this provision?",
          "What is the purpose of making entries and inspections?",
          "Can inspectors enter mines without prior notice?",
          "How can mine owners cooperate with inspections and inquiries?",
          "What is the scope of surveys and measurements in mines?",
          "How can inspectors ensure compliance with mining regulations?",
          "Is there a timeframe for providing reasonable facilities?",
          "The Coal Act 1952 section-9",
          "What is section-9 of The coal act of 1952"
      ],
      "responses": [
          "As per section 9 Every owner, agent, and manager of a mine is obligated to provide the Chief Inspector, every Inspector, and any person authorized under section 8 with all reasonable facilities for making entries, inspections, surveys, measurements, examinations, or inquiries under this Act.",
          "The responsibility falls on mine owners, agents, and managers to facilitate inspections and inquiries and must provide everything for inspection and inquiry.",
          "The Chief Inspector and Inspectors have the authority to carry out inspections and inquiries under this Act section 8 and must provide everything for entry.",
          "Section 8 authorizes specific individuals to conduct inspections and inquiries and must provide everything for entry.",
          "As per section 9 it is necessary Providing reasonable facilities ensures that mines are in compliance with safety and regulatory standards."
      ]
    },
    {
      "tag": "safety_inspection_1952_sec9a",
      "patterns": [
        "What is the purpose of a safety survey in a mine?",
        "Who is authorized to conduct safety surveys in mines?",
        "Can safety surveys be conducted at night?",
        "Tell me about the importance of safety in mines.",
        "When should a mine manager be notified of a safety survey?",
        "What facilities should the mine owner provide during a safety survey?",
        "How often should safety surveys be conducted in mines?",
        "Are safety surveys mandatory for all mines?",
        "What are the risks of not conducting safety surveys?",
        "What equipment is typically examined during a safety survey?",
        "Explain the role of the Chief Inspector in mine safety.",
        "What data is collected during a safety survey?",
        "What happens if a mine fails a safety survey?",
        "Can you provide statistics on mine accidents?",
        "How can miners contribute to safety in the workplace?",
        "Tell me about safety regulations in the mining industry.",
        "What are the common hazards in mines?",
        "What training is required for mine workers regarding safety?",
        "Are safety audits different from safety surveys?",
        "What is the legal framework for safety in mining?",
        "The Coal Act 1952 Section-9A Sub-section-1.",
        "Health survey in mines",
        "Safety survey in mines"
      ],
      "responses": [
        "The Chief Inspector, an Inspector, or an authorized officer can conduct safety and occupational health surveys in a mine at any time, whether during regular working hours or day and night as necessary. Before doing so, they must provide written notice to the mine manager. The mine's owner, agent, or manager is obligated to provide all essential facilities, which encompass machinery examination, sample collection, data gathering related to the survey, and transportation and examination of any employed mine personnel selected for the survey."
      ]
    },
    {
      "tag": "examination_in_mine_1952_sec9a",
      "patterns": [
        "What is the purpose of the examination in a mine survey?",
        "Who is chosen for examination during a safety and occupational health survey?",
        "Where should a person employed in a mine go for examination during the survey?",
        "What information should a mine worker provide during the examination?",
        "Why is health information important in mine surveys?",
        "Tell me about the responsibilities of mine workers during safety surveys.",
        "Are mine workers required to participate in safety surveys?",
        "What happens if a mine worker refuses to participate in the examination?",
        "Explain the process of examination during a mine survey.",
        "Can a mine worker choose not to provide information during the examination?",
        "Who conducts the examination during safety surveys?",
        "What are the consequences of not participating in the examination?",
        "How often are mine workers chosen for examination in surveys?",
        "Tell me about safety measures in mines.",
        "What are the objectives of occupational health surveys in mines?",
        "What rights do mine workers have during the examination?",
        "What type of information is collected during a mine survey?",
        "Are there any legal regulations for mine worker examinations?",
        "Can you explain the significance of health data in mine surveys?",
        "What is the role of the Chief Inspector in mine examinations?",
        "The Coal Act 1952 Section-9A Sub-section-2."
      ],
      "responses": [
        "Every person employed in a mine who is chosen for examination in any safety and occupational health survey must present themselves for examination at the necessary place and provide all information regarding their work and health for the survey."
      ]
    },
    {
      "tag": "working_time_in_mine_survey_1952_sec9a",
      "patterns": [
        "How is the time spent by mine workers during safety surveys counted?",
        "Is the time spent in a safety and occupational health survey considered working hours?",
        "Do mine workers receive overtime pay for survey participation?",
        "What happens to the working time of mine employees during a survey?",
        "Can you explain the compensation for overtime during surveys?",
        "Is survey participation included in the regular working hours of mine workers?",
        "Are there any exceptions for overtime pay during surveys?",
        "Tell me about the policies regarding working hours during mine surveys.",
        "Who determines the rate of wages for overtime during surveys?",
        "What are the implications of counting survey time as working time?",
        "Are there any regulations governing overtime pay in mines?",
        "What is the standard rate of wages for overtime in mine surveys?",
        "Can mine workers refuse to participate in surveys if they don't want overtime?",
        "How does counting survey time affect mine worker schedules?",
        "Are there any restrictions on the use of survey time for overtime?",
        "What rights do mine workers have regarding overtime during surveys?",
        "Can mine workers negotiate the rate of overtime pay for surveys?",
        "Are there any benefits to mine workers for participating in surveys?",
        "What are the legal provisions for compensating mine workers during surveys?",
        "Can mine workers choose to receive compensatory time off instead of overtime pay?",
        "The Coal Act 1952 Section-9A Sub-section-3."
      ],
      "responses": [
        "The time spent by any person employed in a mine who is chosen for examination in the safety and occupational health survey shall be counted towards their working time. However, any overtime shall be paid at the ordinary rate of wages."
      ]
    },
    {
      "tag": "ordinary_rate_of_wages_1952_sec9a",
      "patterns": [
        "What is the definition of the 'ordinary rate of wages' in mines?",
        "How is the 'ordinary rate of wages' calculated for mine workers?",
        "Can you explain the components of the 'ordinary rate of wages'?",
        "Does the 'ordinary rate of wages' include bonuses?",
        "Are amenities like free housing included in the 'ordinary rate of wages'?",
        "What is the significance of 'dearness allowance' in the 'ordinary rate of wages'?",
        "Is compensation for medical facilities considered in the 'ordinary rate of wages'?",
        "Are all types of allowances included in the 'ordinary rate of wages'?",
        "What is the purpose of the 'underground allowance' in the 'ordinary rate of wages'?",
        "Can you clarify what 'compensation in cash' means in this context?",
        "Are there any exceptions to including allowances in the 'ordinary rate of wages'?",
        "Can you provide examples of allowances that are not included in the 'ordinary rate of wages'?",
        "What is the difference between a bonus and compensation for amenities?",
        "How do mine workers benefit from the 'ordinary rate of wages' definition?",
        "Are there any legal requirements for defining the 'ordinary rate of wages'?",
        "Can mine workers negotiate their 'ordinary rate of wages'?",
        "Do changes in entitlements affect the 'ordinary rate of wages'?",
        "How often is the 'ordinary rate of wages' updated for mine workers?",
        "Can mine workers opt for non-cash benefits instead of the 'ordinary rate of wages'?",
        "Are there any regulations regarding the 'ordinary rate of wages' in mines?"
      ],
      "responses": [
        "For the purposes of sub-section-3 of section 9A The Coal Act 1952, 'ordinary rate of wages' means the basic wages plus any dearness allowance and underground allowance, and compensation in cash, including such compensation accruing through the free issue of foodgrains and edible oils as persons employed in a mine may, for the time being, be entitled to. However, it does not include a bonus (other than a bonus given as an incentive for production) or any compensation accruing through the provision of amenities such as free housing, free supply of coal, medical and educational facilities, sickness allowance, supply of kerosene oil, baskets, tools, and uniforms."
      ]
    },
    {
      "tag": "medical_treatment_for_unfit_workers_1952_sec9a",
      "patterns": [
        "What happens if a mine worker is found medically unfit during an examination?",
        "Can you explain the procedure for a mine worker found medically unfit?",
        "Who bears the cost of medical treatment for unfit mine workers?",
        "Do unfit mine workers receive full wages during their treatment?",
        "How is the entitlement to medical treatment determined for unfit mine workers?",
        "What kind of medical treatment is provided to unfit mine workers?",
        "Are there any conditions or criteria for providing medical treatment to unfit workers?",
        "What is the duration of medical treatment for unfit mine workers?",
        "Can unfit mine workers choose their healthcare providers for treatment?",
        "Is there a waiting period for unfit mine workers to receive medical treatment?",
        "Are there any limitations on the types of medical conditions covered by this policy?",
        "Is there a process for assessing the medical fitness of mine workers?",
        "What documentation is required for unfit mine workers to access medical treatment?",
        "Is there any legal framework governing medical treatment for unfit mine workers?",
        "Can unfit mine workers return to their duties after receiving medical treatment?",
        "How does this policy impact mine worker morale and job security?",
        "What support services are available to unfit mine workers during treatment?",
        "Are there any additional benefits provided to unfit mine workers during treatment?",
        "What are the responsibilities of the owner, agent, and manager in this context?",
        "Is there any dispute resolution mechanism for unfit mine workers and employers?",
        "Tell me about medical treatment of workers?",
        "The Coal Act 1952 Section-9A Sub-section-4."
      ],
      "responses": [
        "Any person who, on examination under sub-section (2), is found medically unfit to do his or her duty must be discharged and will be entitled to undergo medical treatment at the cost of the owner, agent, and manager with full wages during the period of such treatment."
      ]
    },
    {
      "tag": "alternative_employment_for_medically_unfit_workers_1952_sec9a",
      "patterns": [
        "What happens if a mine worker remains medically unfit after treatment?",
        "Can you explain the provisions for medically unfit mine workers?",
        "Who is responsible for providing alternative employment to medically unfit mine workers?",
        "Are there specific criteria for determining if a mine worker is medically unfit?",
        "How is the fitness for alternative employment assessed?",
        "What are the options for medically unfit mine workers if alternative employment is not available?",
        "What is a disability allowance for medically unfit mine workers?",
        "How is the disability allowance rate determined?",
        "Can a medically unfit mine worker choose to leave their employment?",
        "What is disability compensation for mine workers who decide to leave their job?",
        "Are there specific rates prescribed for disability compensation?",
        "Is there a waiting period for alternative employment or compensation?",
        "Are there any legal regulations regarding alternative employment and compensation?",
        "What documentation is required for a medically unfit mine worker to access benefits?",
        "Are there any time limits for seeking alternative employment or compensation?",
        "Can medically unfit mine workers return to their previous jobs after recovery?",
        "How does this policy affect the rights and welfare of medically unfit mine workers?",
        "Are there support services available to assist medically unfit mine workers?",
        "What are the responsibilities of the owner, agent, and manager in this context?",
        "Is there a dispute resolution process for medically unfit mine workers and employers?",
        "The Coal Act 1952 Section-9A Sub-section-5."
      ],
      "responses": [
        "If, after medical treatment, a person referred to in sub-section (4) is declared medically unfit to discharge the duty which he was discharging in a mine before presenting himself for the examination, and such unfitness is directly ascribable to his employment in the mine before such presentation, the owner, agent, and manager shall provide such person with alternative employment in the mine for which he is medically fit. If no such alternative employment is immediately available, the person shall be paid a disability allowance or lump sum disability compensation determined in accordance with the prescribed rates."
      ]
    },
    {
      "tag": "determination_of_rates_for_disabilities_1952_sec9a",
      "patterns": [
        "How are the rates determined under the provisos to sub-section (5)?",
        "Can you explain the factors considered in determining the rates for disabilities?",
        "What is the significance of monthly wages in rate determination?",
        "How does the nature of disabilities affect the rate determination?",
        "Are there specific factors related to rate determination?",
        "Who is responsible for determining the rates for disabilities?",
        "Is there a formula or methodology for rate determination?",
        "Are there any guidelines or criteria for rate determination?",
        "Can you provide examples of how rates vary based on different factors?",
        "Are there different rates for different types of disabilities?",
        "What data or information is used in the rate determination process?",
        "How often are the rates for disabilities reviewed or updated?",
        "Are there any legal regulations governing the rate determination process?",
        "Is there a transparent process for mine workers to understand rate determination?",
        "Are there any industry standards for rates related to disabilities?",
        "Can mine workers provide input or feedback on rate determination?",
        "How do the rates for disabilities impact the financial support provided to mine workers?",
        "Are there support services available to assist mine workers in understanding rates?",
        "What are the responsibilities of the owner, agent, and manager in this context?",
        "Is there a dispute resolution process for rate-related matters?",
        "The Coal Act 1952 Section-9A Sub-section-6."
      ],
      "responses": [
        "The rates under the provisos to sub-section (5) shall be determined having regard to the monthly wages of the employees, the nature of disabilities, and other related factors."
      ]
    },
    {
      "tag": "confidentiality_of_mine_records_1952_sec9a",
      "patterns": [
        "What is the confidentiality policy regarding mine records?",
        "Can you explain the handling of records and information from mine inspections?",
        "Who is responsible for maintaining the confidentiality of mine records?",
        "Under what circumstances can mine inspection records be disclosed?",
        "Are there any exceptions to the confidentiality rule?",
        "What types of information are included in mine records?",
        "Is there a process for determining when disclosure is necessary?",
        "How is the health, safety, and welfare of mine workers ensured?",
        "Can mine workers access their own inspection records?",
        "Are there legal regulations governing the confidentiality of mine records?",
        "What are the consequences of unauthorized disclosure of mine records?",
        "Is there any oversight or monitoring of record confidentiality?",
        "Are there penalties for violating the confidentiality policy?",
        "How long are mine records typically retained?",
        "Are there specific procedures for requesting access to mine records?",
        "Are there any industry standards for mine record confidentiality?",
        "What are the responsibilities of the Chief Inspector and Inspectors in this context?",
        "Is there a mechanism for reporting concerns related to record confidentiality?",
        "Can mine owners or managers request access to inspection records?",
        "Are there any safeguards in place to protect the confidentiality of records?",
        "Disclosure of mine records?",
        "The Coal Act 1952 section-10 sub-section-1"
      ],
      "responses": [
        "All copies of, and extracts from, registers or other records pertaining to any mine and all other information acquired by the Chief Inspector, an Inspector, or any person assisting them during mine inspection or survey shall be regarded as confidential. Such information shall not be disclosed to any person or authority unless the Chief Inspector or the Inspector deems disclosure necessary to ensure the health, safety, or welfare of any person employed in the mine or in any other mine adjacent thereto."
      ]
    },
    {
      "tag": "exceptions_to_mine_information_disclosure_1952_sec9a",
      "patterns": [
        "Are there any exceptions to the confidentiality rule in the Coal Act Section 10, Sub-section (1)?",
        "Can you specify situations where mine information can be disclosed?",
        "Who has the authority to request disclosure of mine information?",
        "Is there a process for disclosing mine information to specific entities?",
        "What entities or individuals can receive mine information under exceptions?",
        "Are there any specific criteria for disclosing mine information?",
        "How does disclosing mine information to a Committee or court of inquiry work?",
        "Can mine owners, agents, or managers access confidential mine information?",
        "Who is a Commissioner for workmen's compensation under the Workmen's Compensation Act?",
        "Under what circumstances can mine information be shared with the Indian Bureau of Mines?",
        "Are there any limitations on disclosing mine information to trade unions?",
        "Can other officers, authorities, or organizations be specified by the Central Government for information disclosure?",
        "Is there a process for requesting the disclosure of mine information?",
        "Are there legal regulations regarding exceptions to mine information disclosure?",
        "What are the responsibilities of the Chief Inspector and Inspectors in relation to information disclosure?",
        "Is there any oversight or monitoring of the information disclosure process?",
        "What are the consequences of unauthorized disclosure of mine information?",
        "Is there a mechanism for reporting concerns related to information disclosure?",
        "Can individuals or organizations appeal for the disclosure of mine information?",
        "How does information disclosure affect the rights and privacy of mine workers?",
        "When is disclosure of information not applicable?",
        "The Coal Act 1952 section-10 sub-section-2"
      ],
      "responses": [
        "Nothing in the Coal Act Section 10, Sub-section (1), shall apply to the disclosure of any such information (if so required) to various entities including courts, Committees or courts of inquiry, official superiors, mine owners, Commissioners for workmen's compensation, the Controller of the Indian Bureau of Mines, registered or recognized trade unions, and other specified officers, authorities, or organizations as may be designated by the Central Government."
      ]
    },
    {
      "tag": "punishment_for_information_disclosure_1952_sec9a",
      "patterns": [
        "What are the consequences of disclosing mine information without consent?",
        "Is there a penalty for unauthorized disclosure of mine information?",
        "Can you explain the punishment for violating the information disclosure provisions?",
        "Who can be held responsible for unauthorized disclosure?",
        "What is the role of the Chief Inspector and Inspectors in this context?",
        "Are there any exceptions to the punishment for unauthorized disclosure?",
        "Is imprisonment the only form of punishment for unauthorized disclosure?",
        "Can fines be imposed for unauthorized disclosure?",
        "What factors determine the severity of the punishment for unauthorized disclosure?",
        "How is consent from the Central Government obtained for disclosure?",
        "Are there any legal safeguards for individuals accused of unauthorized disclosure?",
        "Can individuals or organizations report unauthorized disclosures?",
        "Is there a mechanism for appealing against the punishment for unauthorized disclosure?",
        "What steps can be taken to prevent unauthorized disclosure of mine information?",
        "How does unauthorized disclosure impact mine workers and mine safety?",
        "Are there any legal regulations governing the punishment for unauthorized disclosure?",
        "Is there a statute of limitations for prosecuting unauthorized disclosure cases?",
        "What are the responsibilities of the Chief Inspector and Inspectors in relation to information disclosure?",
        "Is there a mechanism for reporting concerns related to information disclosure?",
        "What rights and protections are provided to individuals accused of unauthorized disclosure?",
        "Is the disclosure of information without Central governments consent Punishable?",
        "The Coal Act 1952 section-10 sub-section-3"
      ],
      "responses": [
        "If the Chief Inspector, an Inspector, or any other person referred to in Sub-section (1) discloses, contrary to the provisions of this section, any such information as mentioned without the consent of the Central Government, they shall be punishable with imprisonment for a term that may extend to one year, or with a fine, or with both."
      ]
    },
    {
      "tag": "sanction_for_trial_under_coal_act_1952_sec9a",
      "patterns": [
        "What is the procedure for initiating a trial under the Coal Act 1952, Section 10?",
        "Is there a requirement for seeking approval before proceeding to trial?",
        "Who has the authority to grant sanction for trial under the Coal Act?",
        "Can you explain the role of the Central Government in granting sanction?",
        "Are there any exceptions to the requirement for sanction?",
        "How is the necessity for trial determined?",
        "What criteria are considered before granting sanction for trial?",
        "Is there a specific process for applying for sanction?",
        "What happens if a court proceeds to trial without obtaining sanction?",
        "What are the consequences of proceeding without Central Government sanction?",
        "Is there a timeline for obtaining sanction for trial?",
        "Are there legal regulations governing the requirement for sanction?",
        "Is there a mechanism for appealing if sanction is denied?",
        "What rights and protections are provided to individuals facing trial under the Coal Act?",
        "Can individuals or organizations report cases that require trial?",
        "Is there a statute of limitations for initiating trials under the Coal Act?",
        "What role do the Chief Inspector and Inspectors play in this context?",
        "Are there any support services for individuals involved in trials?",
        "How does the requirement for sanction impact the efficiency of trials?",
        "Is there a process for requesting expedited sanction for urgent cases?",
        "Can a court proceed with a trial of ant offence under the coal act 1952?",
        "The Coal Act 1952 section-10 sub-section-4"
      ],
      "responses": [
        "No court shall proceed to the trial of any offence under the Coal Act 1952, Section 10, except with the previous sanction of the Central Government."
      ]
    },
    {
      "tag": "appointment_of_certifying_surgeons_1952_sec9a",
      "patterns": [
        "How are certifying surgeons appointed under The Coal Act 1952?",
        "Who has the authority to appoint certifying surgeons for the Act's purposes?",
        "What qualifications are required for medical practitioners to become certifying surgeons?",
        "Can you explain the responsibilities of certifying surgeons?",
        "How are local limits or specific mines assigned to certifying surgeons?",
        "Are there any limitations on the number of certifying surgeons that can be appointed?",
        "Are there specific qualifications or expertise required for certifying surgeons?",
        "What is the role of certifying surgeons in ensuring mine safety?",
        "What happens if a mine does not have an appointed certifying surgeon?",
        "How often are certifying surgeons appointed or reassigned?",
        "Are there any legal regulations governing the appointment of certifying surgeons?",
        "Is there a mechanism for appealing certifying surgeon appointments?",
        "Are certifying surgeons compensated for their services?",
        "Are there any ethical guidelines or standards for certifying surgeons?",
        "How do certifying surgeons contribute to the health and safety of mine workers?",
        "Is there a process for reporting concerns or grievances related to certifying surgeons?",
        "What role do the Chief Inspector and Inspectors play in relation to certifying surgeons?",
        "Can mine workers choose their certifying surgeons?",
        "Are there any support services available to mine workers in relation to certifying surgeons?",
        "What is the significance of certifying surgeons in The Coal Act 1952?",
        "The Coal Act 1952 section-11 sub-section-1"
      ],
      "responses": [
        "The Central Government may appoint qualified medical practitioners to be certifying surgeons for the purposes of The Coal Act 1952, within such local limits or for such mine or class or description of mines as it may assign to them respectively."
      ]
    },
    {
      "tag": "authorization_of_medical_practitioners_by_certifying_surgeon_1952_sec9a",
      "patterns": [
        "Under what conditions can a certifying surgeon authorize another medical practitioner?",
        "What is the process for a certifying surgeon to authorize another medical practitioner?",
        "Who has the authority to grant approval for the authorization of medical practitioners?",
        "What are the powers that a certifying surgeon can delegate to another medical practitioner?",
        "Can you explain the role and responsibilities of an authorized medical practitioner?",
        "Is there a specific duration for which an authorized medical practitioner can exercise powers?",
        "How does the authorization of medical practitioners impact the implementation of the Act?",
        "Are there any limitations or restrictions on the authorization process?",
        "Is there a mechanism for appealing authorization decisions?",
        "Can authorized medical practitioners receive compensation for their services?",
        "Are there any ethical guidelines or standards for authorized medical practitioners?",
        "What is the significance of authorizing medical practitioners in this Act?",
        "Is there a process for reporting concerns or grievances related to authorized medical practitioners?",
        "How do authorized medical practitioners contribute to the health and safety of mine workers?",
        "What role do the Chief Inspector and Inspectors play in relation to authorized medical practitioners?",
        "Can mine workers request specific authorized medical practitioners?",
        "Are there any support services available to mine workers related to authorized medical practitioners?",
        "What is the Central Government's role in imposing conditions on authorizations?",
        "How does the authorization process impact the efficiency of Act implementation?",
        "Are there any legal regulations governing the authorization of medical practitioners?",
        "The Coal Act 1952 section-11 sub-section-2"
      ],
      "responses": [
        "Subject to such conditions as the Central Government may think fit to impose, a certifying surgeon may, with the approval of the Central Government, authorize any qualified medical practitioner to exercise all or any of his powers under this Act for such period as the certifying surgeon may specify. References to a certifying surgeon shall be deemed to include references to any qualified medical practitioner when so authorized."
      ]
    },
    {
      "tag": "qualification_for_certifying_surgeons_1952_sec9a",
      "patterns": [
        "What are the qualifications required to be a certifying surgeon?",
        "Can you explain who can be appointed or authorized as a certifying surgeon?",
        "Are there any restrictions on the appointment of certifying surgeons?",
        "Who is eligible to exercise the powers of a certifying surgeon?",
        "What happens if someone is the owner, agent, or manager of a mine?",
        "Can individuals directly or indirectly interested in a mine become certifying surgeons?",
        "Are there any exceptions to the eligibility criteria for certifying surgeons?",
        "How does employment in a mine affect eligibility for certifying surgeons?",
        "What is the significance of ensuring no conflict of interest for certifying surgeons?",
        "Is there a process for verifying the qualifications of certifying surgeons?",
        "Are there any legal regulations governing the appointment and eligibility of certifying surgeons?",
        "Can individuals appeal if they are denied the position of certifying surgeon?",
        "Is there a mechanism for reporting concerns related to certifying surgeons?",
        "How does the eligibility criteria impact mine safety and worker health?",
        "Are there any support services for individuals interested in becoming certifying surgeons?",
        "What are the responsibilities and duties of certifying surgeons?",
        "Can mine workers request specific certifying surgeons for examinations?",
        "Is there a process for removing certifying surgeons from their positions?",
        "What is the role of the Central Government in overseeing certifying surgeon appointments?",
        "Are there any exceptions or special cases regarding certifying surgeon qualifications?",
        "The Coal Act 1952 section-11 sub-section-2"
      ],
      "responses": [
        "No person shall be appointed to be or authorized to exercise the powers of a certifying surgeon, or having been so appointed or authorized, continue to exercise such powers, who is or becomes the owner, agent, or manager of a mine, or is or becomes directly or indirectly interested therein, or in any process or business carried on therein or in any patent or machinery connected therewith, or is otherwise in the employment of the mine."
      ]
    },
    {
      "tag": "duties_of_certifying_surgeon_1952_sec9a",
      "patterns": [
        "What are the duties of a certifying surgeon in a mine?",
        "Can you explain the responsibilities of certifying surgeons in connection with dangerous occupations?",
        "How does a certifying surgeon carry out medical supervision in a mine?",
        "Are there specific duties related to examining persons engaged in dangerous processes?",
        "What is the role of a certifying surgeon in preventing illnesses in mines?",
        "Can you provide examples of dangerous occupations in a mine?",
        "Are there guidelines or regulations prescribing the duties of certifying surgeons?",
        "Is there a process for reporting concerns or issues related to a certifying surgeon's duties?",
        "How do certifying surgeons contribute to the safety and health of mine workers?",
        "What happens in cases of illness believed to be due to the nature of a mine's processes?",
        "Are there qualifications or training requirements for certifying surgeons?",
        "Can certifying surgeons request additional resources or support for their duties?",
        "Is there a mechanism for certifying surgeons to communicate with mine management?",
        "Are there any industry standards for the duties of certifying surgeons?",
        "What is the significance of medical supervision in mines?",
        "How are dangerous processes identified in a mine?",
        "What is the role of the Central Government in overseeing certifying surgeons' duties?",
        "Is there a process for evaluating the performance of certifying surgeons?",
        "Can mine workers provide feedback on the performance of certifying surgeons?",
        "Are there any exceptions or special cases regarding certifying surgeons' duties?",
        "The Coal Act 1952 section-11 sub-section-2"
      ],
      "responses": [
        "The certifying surgeon shall carry out such duties as may be prescribed in connection with the examination of persons engaged in a mine in dangerous occupations or processes as may be prescribed, and the exercise of medical supervision as may be prescribed for any mine or class of mines where cases of illness have occurred that are reasonable to believe are due to the nature of any process carried on or other conditions of work prevailing in the mine."
      ]
    },
    {
      "tag": "constitution_of_committee_under_coal_act_1952",
      "patterns": [
        "How is the Committee under the Coal Act 1952 constituted?",
        "Can you explain the composition of the Committee appointed under this Act?",
        "Who serves as the Chairman of the Committee?",
        "What is the role of the Chief Inspector of Mines in the Committee?",
        "How are the interests of miners represented in the Committee?",
        "How are the interests of mine owners represented in the Committee?",
        "Who appoints the qualified mining engineers in the Committee?",
        "Are there any specific criteria for the appointment of mining engineers to the Committee?",
        "What is the significance of representing workers' interests in the Committee?",
        "What is the significance of representing owners' interests in the Committee?",
        "Is there a notification process for constituting the Committee?",
        "Is there a set date specified for the constitution of the Committee?",
        "Is the Committee responsible for specific tasks or functions?",
        "What is the Committee's role in relation to the Coal Act 1952?",
        "Are there any regulations governing the functioning of the Committee?",
        "How often is the Committee constituted or reconstituted?",
        "Is there a mechanism for reporting concerns or issues related to the Committee?",
        "What is the Central Government's role in appointing Committee members?",
        "Can individuals or organizations propose candidates for the Committee?",
        "Are there any exceptions or special cases regarding Committee composition?",
        "The Coal Act 1952 section-12 sub-section-1"
      ],
      "responses": [
        "The Central Government shall, with effect from such date as that Government may specify by notification in the Official Gazette, constitute a Committee for the purposes of the Coal Act 1952. The Committee consists of a Chairman appointed by the Central Government, the Chief Inspector of Mines, two persons representing the interests of miners, two persons representing the interests of owners of mines, and two qualified mining engineers not directly employed in the mining industry. At least one of the persons representing miners' interests should be for coal mine workers, and at least one of the persons representing owners' interests should be for owners of coal mines."
      ]
    },
    {
      "tag": "constitution_of_specific_committees_under_coal_act_1952",
      "patterns": [
        "What is the purpose of constituting specific Committees under the Coal Act 1952?",
        "Can you explain the authority of the Central Government to form specific Committees?",
        "How are specific Committees different from the main Committee under the Act?",
        "What matters do these specific Committees deal with?",
        "Who appoints the members of these specific Committees?",
        "Is there a limit on the number of specific Committees that can be constituted?",
        "Are there specific criteria for appointing members to these Committees?",
        "What is the role of these specific Committees in the territories covered by the Act?",
        "How often are specific Committees formed or reformed?",
        "Is there a notification process for constituting specific Committees?",
        "Is there a set date specified for the constitution of specific Committees?",
        "What are the provisions of sub-section (1) regarding the constitution of Committees?",
        "How do these specific Committees contribute to the implementation of the Act?",
        "Is there a mechanism for reporting concerns or issues related to specific Committees?",
        "Are there any legal regulations governing the constitution of specific Committees?",
        "Can individuals or organizations propose candidates for specific Committees?",
        "Is there a process for dissolving specific Committees when they are no longer needed?",
        "What is the Central Government's role in overseeing specific Committees?",
        "Are there any exceptions or special cases regarding specific Committee constitution?",
        "What is the significance of these specific Committees in relation to the Coal Act 1952?",
        "The Coal Act 1952 section-12 sub-section-2"
      ],
      "responses": [
        "Without prejudice to the generality of sub-section (1), the Central Government may constitute one or more Committees to deal with specific matters relating to any part of the territories to which the Coal Act 1952 extends, or to a mine or a group of mines. The Central Government may appoint members for these Committees, and the provisions of sub-section (1) (except the proviso thereto) shall apply for the constitution of any Committee under this sub-section as they apply for the constitution of a Committee under that sub-section."
      ]
    },
    {
      "tag": "validity_of_committee_act_or_proceedings_coal_act_1952_sec12",
      "patterns": [
        "What happens if there is a vacancy among the members of a Committee?",
        "Does the existence of vacancies affect the validity of a Committee's act or proceeding?",
        "Is there a process for filling vacancies in a Committee?",
        "How are defects in the constitution of a Committee addressed?",
        "Can a Committee continue its work if there are vacant positions?",
        "Are there any exceptions to the validity of Committee acts or proceedings?",
        "What rights and protections are provided to Committees in this regard?",
        "How does the presence of vacancies impact the decision-making process of a Committee?",
        "Is there a mechanism for reporting concerns related to vacancies or defects in Committee constitution?",
        "Are there any legal regulations governing the validity of Committee acts or proceedings?",
        "What role does the Central Government play in addressing vacancies in Committees?",
        "Can individuals or organizations propose candidates to fill Committee vacancies?",
        "Is there a time limit for filling vacancies in a Committee?",
        "What is the significance of ensuring the validity of Committee acts and proceedings?",
        "How do vacancies or defects impact the effectiveness of a Committee?",
        "What rights and protections are provided to individuals affected by Committee decisions?",
        "Are there any exceptions or special cases regarding the validity of Committee acts or proceedings?",
        "How often are vacancies or defects addressed in Committee constitution?",
        "Can Committees continue their work during the process of filling vacancies?",
        "What is the role of the Chairman in addressing vacancies or defects in a Committee?",
        "The Coal Act 1952 section-12 sub-section-3"
      ],
      "responses": [
        "No act or proceeding of a Committee shall be invalid by reason only of the existence of any vacancy among its members or any defect in the constitution thereof."
      ]
    },
    {
      "tag": "duties_and_functions_of_committee_under_coal_act_1952_sec13",
      "patterns": [
        "What are the duties and functions of the Committee under Section 13 of the Coal Act 1952?",
        "Can you explain the role of the Committee in making rules and regulations under this Act?",
        "How does the Committee make recommendations to the Central Government?",
        "What is the Committee's responsibility in enquiring into accidents and other matters?",
        "How does the Committee report on accidents and referred matters?",
        "Is there a process for referring accidents or matters to the Committee?",
        "What appeals or objections does the Committee hear and decide?",
        "Are there any limitations on the appeals or objections that the Committee can address?",
        "Is there a mechanism for reporting concerns or issues to the Committee?",
        "How often does the Committee meet to perform its functions?",
        "Is there a timeline for the Committee to complete its tasks?",
        "What is the role of the Central Government in relation to the Committee's recommendations?",
        "Can individuals or organizations propose matters for the Committee to consider?",
        "Are there any legal regulations governing the Committee's duties and functions?",
        "How does the Committee contribute to the implementation of the Coal Act 1952?",
        "What is the significance of the Committee's role in hearing appeals and objections?",
        "What happens if there is a conflict between notices or orders under this Act and the Committee's decisions?",
        "Are Committee decisions binding, or can they be challenged?",
        "What is the process for appealing the decisions made by the Committee?",
        "Are there any exceptions or special cases regarding the Committee's functions?",
        "The Coal Act 1952 section-13 sub-section-1"
      ],
      "responses": [
        "As per sub-section 1, section 13 of the Coal Act 1952, the Committee constituted under sub-section (1) of section 12 shall consider proposals for making rules and regulations under this Act and make appropriate recommendations to the Central Government. It also enquires into accidents or other matters referred to it by the Central Government and makes reports. The Committee, subject to the provisions of sub-section (2), hears and decides appeals or objections against notices or orders under this Act or the regulations, rules, or bye-laws thereunder, as required by this Act or as may be prescribed."
      ]
    },
    {
      "tag": "chief_inspector_role_in_committee_proceedings_coal_act_1952_sec13",
      "patterns": [
        "What is the role of the Chief Inspector in the proceedings of the Committee?",
        "Can the Chief Inspector participate in Committee proceedings?",
        "Is the Chief Inspector allowed to make decisions in the Committee?",
        "How does the Chief Inspector's role differ in appeals or objections?",
        "Is there a specific prohibition on the Chief Inspector's involvement?",
        "What happens if the Chief Inspector is part of an appeal or objection case?",
        "Are there any exceptions to the Chief Inspector's role in the Committee?",
        "What is the significance of this provision in Section 13 of the Coal Act 1952?",
        "How are conflicts of interest addressed when the Chief Inspector is involved?",
        "Is there a mechanism for reporting concerns related to the Chief Inspector's role?",
        "How does this provision ensure impartiality in the Committee's proceedings?",
        "What role does the Chief Inspector play in the mining industry?",
        "Can individuals or organizations appeal to the Chief Inspector?",
        "Are there any legal regulations governing the Chief Inspector's involvement in the Committee?",
        "How does this provision impact the functioning of the Committee?",
        "What rights and protections are provided to parties involved in appeals or objections?",
        "Can the Chief Inspector be called as a witness in Committee proceedings?",
        "Are there any exceptions or special cases regarding the Chief Inspector's role?",
        "What is the role of the Chairman in the Committee when the Chief Inspector is involved?",
        "How does this provision ensure transparency and fairness in the Committee?",
        "The Coal Act 1952 section-13 sub-section-2"
      ],
      "responses": [
        "As per sub-section 2, section 13 of the Coal Act 1952, the Chief Inspector shall not take part in the proceedings of the Committee with respect to any appeal or objection against an order or notice made or issued by him or act in relation to any matter pertaining to such appeal or objection as a member of the Committee."
      ]
    },
    {
      "tag": "committee_powers_under_section_12_coal_act_1952_sec14",
      "patterns": [
        "What powers can a Committee constituted under Section 12 exercise?",
        "Can a Committee exercise the powers of an Inspector under this Act?",
        "What is the purpose of a Committee exercising Inspector powers?",
        "How does a Committee decide which powers to exercise?",
        "Is there a process for a Committee to request Inspector powers?",
        "Are there limitations on the powers a Committee can exercise?",
        "What are the functions of a Committee under the Coal Act of 1952?",
        "How does a Committee contribute to the implementation of this Act?",
        "Is there a mechanism for reporting concerns related to a Committee's exercise of powers?",
        "What is the role of the Central Government in overseeing a Committee's powers?",
        "Can individuals or organizations request specific actions from a Committee?",
        "Are there any legal regulations governing a Committee's exercise of powers?",
        "How does this provision impact the effectiveness of a Committee?",
        "What rights and protections are provided to individuals affected by a Committee's actions?",
        "Can a Committee delegate its powers to other entities or individuals?",
        "Are there any exceptions or special cases regarding a Committee's exercise of powers?",
        "What is the significance of this provision in Section 12 of the Coal Act of 1952?",
        "What happens if there is a conflict between a Committee's actions and Inspector actions?",
        "Is there a process for appealing or challenging a Committee's exercise of powers?",
        "How does this provision ensure the Committee can fulfill its functions?",
        "The Coal Act 1952 section-14 sub-section-1"
      ],
      "responses": [
        "A Committee constituted under Section 12 may exercise such of the powers of an Inspector under this Act as it thinks necessary or expedient for the purposes of discharging its functions under the Coal Act of 1952."
      ]
    },
    {
      "tag": "committee_powers_under_section_14_coal_act_1952",
      "patterns": [
        "What powers does a Committee constituted under Section 12 have according to Section 14 of the Coal Act 1952?",
        "Can you explain the powers granted to a Committee under Section 14?",
        "What is the significance of Section 14 in relation to a Committee's powers?",
        "How does Section 14 empower a Committee to discharge its functions?",
        "What are the specific matters covered by Section 14 in terms of powers?",
        "Is there a legal basis for a Committee to exercise these powers?",
        "How does a Committee use its powers related to discovery and inspection?",
        "Can a Committee enforce the attendance of individuals and examine them on oath?",
        "What authority does a Committee have in compelling the production of documents?",
        "Are there any limitations or restrictions on these powers?",
        "Is there a process for invoking these powers by a Committee?",
        "What is the Code of Civil Procedure, 1908 (5 of 1908), mentioned in Section 14?",
        "How does Section 14 contribute to the Committee's effectiveness?",
        "Is there a mechanism for reporting concerns related to a Committee's exercise of these powers?",
        "What role does the Central Government play in overseeing the Committee's powers?",
        "Can individuals or organizations request specific actions from a Committee based on these powers?",
        "Are there any exceptions or special cases regarding the powers granted by Section 14?",
        "How often are these powers invoked by Committees?",
        "What is the purpose of granting these legal powers to Committees?",
        "How does Section 14 ensure fairness and justice in the Committee's proceedings?",
        "The Coal Act 1952 section-14 sub-section-2"
      ],
      "responses": [
        "As per sub-section 2, Section 14 of the Coal Act 1952, a Committee constituted under Section 12 shall, for the purposes of discharging its functions, have the same powers as are vested in a court under the Code of Civil Procedure, 1908 (5 of 1908), when trying a suit in respect of the following matters: (a) discovery and inspection; (b) enforcing the attendance of any person and examining him on oath; (c) compelling the production of documents; and (d) such other matters as may be prescribed."
      ]
    },
    
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool."
      ]
    }
  ]
}
